package com.example.golkhune;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Context;
import android.os.Bundle;

import java.util.ArrayList;
import java.util.List;

import uk.co.chrisjenx.calligraphy.CalligraphyContextWrapper;

public class apartemani extends AppCompatActivity {
    RecyclerView recyclerView3;
    List<Item> mItem33 = new ArrayList<>();
    ItemAdapter_apartemani mAdapter3;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_apartemani);

        recyclerView3 =findViewById(R.id.recycler_view_apartemani);
        mAdapter3 = new ItemAdapter_apartemani(mItem33,this);
        RecyclerView.LayoutManager mLayoutManager3 = new LinearLayoutManager(getApplicationContext());
        recyclerView3.setLayoutManager(mLayoutManager3);
        recyclerView3.setAdapter(mAdapter3);
        setDeta3();

    }

    private void setDeta3() {
        mItem33.add(new Item(R.drawable.potos,"پوتوس",
                "تابستان5-4 روز 1 بار",
                "کم و مقاوم به سایه",
                "22 درجه سانتیگراد",
                "خاک مناسب:خاک باغچه\n" +
                        "\n" +
                        "،ماسه وخاک برگ\n" +
                        "کوددهی: 3 گرم در لیتر کود محلول در آب و یا کود مایع هر 2 هفته 1 بار از فروردین تا آبان ماه\n" +
                        "پتوس گیاهی برگ زینتی و آپارتمانی است. برگ ها قلبی شکل اند. بسیاری ازگونه ها حالت بالارونده دارند و تا سقف بالا می روند.\n" +
                        "\n" +
                        "دو نوع دارد: پتوسبرگ معمولی و پتوس برگ ابلق.\n" +
                        "با اینکه هر دو مقاوم به سایه هستند، ولی نوع ابلق آن، نیاز به نور کمی بیشتر برای تشکیل رنگیزه دارد. در صورتی که نور کافی دریافت نکند، برگ ها به سبزی گرایش پیدا می کنند.\n" +
                        "\n" +
                        "پتوس ها، درمنازل به راحتی قابل نگهداری هستند. نیاز به نور مستقیم خورشید ندارند، ودر صورت دریافت نور مستقیم، آفتاب سوختگی بصورت تاول و سوختگی روی برگ هانمود پیدا می کند.\n" +
                        "مقاوم به رطوبت کم محیط است و در صورتیکه رطوبت بسیاربالا باشد، برگ ها خیلی پهن و درشت می شوند. با اینکه به راحتی روی دیوارقابل هدایت است، اما ممکن است در قسمت های بالایی و نزدیک به سقف، در اثرتجمع گرما دچار سوختگی شود و در نتیجه گیاه بد شکل می شود.\n" +
                        "چون برگ زینتی است به آبیاری و مواد غذایی گیاه باید توجه شود. دورآبیاری ۲_۱ بار در هفته و هر ماه ۱ بار استفاده از کود مایع مناسبِ این گیاه است.\n" +
                        "\n" +
                        "در حالی که پوتوس یک گیاه آپارتمانی با نیاز های مراقبتی کم و پرورشِ آسان است، باید مراقب باشید! زیرا این گیاه سمی است! البته این گیاه کشنده نیست اما اگر خورده و هضم شود به دلیلِ وجود کلسیم اگزالات در ترکیباتش، به تحریک دستگاه گوارشی و استفراغ منجر می شود. این گیاه همچنین برای سگ ها، گربه ها و کودکان کم سن سمی است؛ البته همانطور که گفته شد کشنده نیست ولی آن ها را بسیار مریض و بد حال می کند.\n" +
                        "عوارض و درمان:\n" +
                        "در صورتی که مشاهده کردید برگهای گیاه زیبای آن می ریزند و ساقه ها خم میشوند، احتمال بدهید گیاه تشنهو هوا خشک است، گیاه را فراوان آبیاری کرده و به محل خنک تری منتقل کنید. نور کم و یا کمبود مواد غذایی میتواند باعث درازای ساقه ها و فاصله زیاد بین برگها شود.\n" +
                        "نقاط قهوه ای و سیاه در مرکز یا نوک برگ معرف آسیب اشعه مستقیم آفتاب است. اگر هم در سطح زیرین برگها لکه ی برجسته قهوه ای وجود داشت، هفته ای یکبار با سم حشره کش نفوذی گیاه را سمپاشی کنید تا علایم بر طرف گردد.\n" +
                        "در صورتی که از رشد فعال و ظهور برگهای جدید خبری نباشد می توان حدس زد، محیط گیاه خیلی سرد است.\n" +
                        "اگر آن رابه جای گرمتری ببرید مشکل بر طرف میشود. هوای سرد همچنین می تواند برگها را چین و چروکدار و قهوه ای کند. در اثر خاک باتلاقی و یا آبیاری با آب خیلی سرد، برگهای پایینی گیاه میریزند و زرد می شوند.\n"));
        mItem33.add(new Item(R.drawable.bambo,"بامبو",
                "هر 14 روز یک بار",
                "نور غیر مستقیم ",
                " 18 تا 22 درجه",
                "گیاه بامبو را نباید در معرض نور مستقیم خورشید قرار داد بامبو از گیاهان سازگار با شرایط مختلف است اما بهتر است برای حفظ شادابی آن شرایطش را محیا کنید.\n" +
                        "روش نگهداری و مراقبت از گیاه بامبو\n" +
                        "بامبولاکی از گیاهانی است که این روزها طرفداران زیادی را به علت سهولت پرورش و نگهداری آن پیدا کرده است . این گیاه به نام های دراسینای روبانی و گیاه نواری یا روبانی و یا خیزران خوش قدم، خوش یمن مشهور است.\n" +
                        "لاکی بامبو به دلیل شباهتش به خیزران به این نام مشهور شده است اما در واقع بامبو نیست و نام اصلی آن «دراسینا» و نام خانوادگی اش «ساندریانا» و از خانواده Liliacea می باشد که بومی کمرون بوده و در مناطق استوایی غرب آفریقا نیز می روید.\n" +
                        "اگر مراقب از این گیاه به درستی انجام شود ممکن است ارتفاعش تا حدود یک متر نیز برسد و چندین سال عمرکند. شما ممکن است که گیاه بامبو را بعنوان یک هدیه دریافت کرده باشید، یا خودتان خریده باشید.\n" +
                        "\n" +
                        "خرید و نگهداری بامبو لاکی\n" +
                        "1.گیاهی را بخرید که ساقه و برگ های آن سالم و شاداب باشند و سبزینه آن کمرنگ نشده باشدو از خرید گیاهانی که سبزینه فاصله دو بند یا دو گره از ساقه گیاه از سبزی به سفیدی گراییده باشد، اجتناب کنید.\n" +
                        "2.باید بدانید بوی بد گیاه دلیلی بر بیماری آن است بنابراین اگر بوی بدی از گیاه به مشام تان رسید، آن را نخرید.\n" +
                        "3.گیاهی را که انتهای بریده شده ساقه آن داخل آب قهوه ای رنگ شده باشد ، نخرید.\n" +
                        "4.حتما گیاهی را خریداری کنید که ریشه داشته باشد و از خریدن گیاه بدون ریشه در فصل های پاییز و زمستان اجتناب کنید.\n" +
                        "\n" +
                        "5. به انتهای بریده شده ساقه ای که در آب قرار می گیرد زمان تعویض آب و شست وشو ساقه ها، با دقت بنگرید و در صورتی که رنگ قهوه ای به خود گرفته بود ، آن قسمت را به وسیله ای جسمی تیز به صورت مورب ببرید، زیرا رنگ قهوه ای نشانه مسدود شدن آوندهای گیاه توسط املاح آب و مرگ گیاه است.\n" +
                        "6. گیاه را هرگز در جایی که نور مستقیم خورشید بدان می تابد نگذارید بلکه در محلی روشن، نزدیک پنجره قرار دهید حتی می توانید این گیاه را در جایی که پنجره ای ندارد قرار دهید، به این شرط که هفته ای یک روز نور غیر مستقیم بگیرد.\n" +
                        "7. چنانچه جوانه تنهایی سرساقه گیاه، یعنی بالای قسمت حلقوی گیاه از ده بند یا گره بلندتر شده است، باید پنج بند آن را بریده و برای تکثیر از آن استفاده کرد. چنانچه این پنج گره حذف نشوند، ممکن است قسمت حلقوی گیاه به تدریج باز و صاف و شق و رق گردیده و از زیبایی آن کاسته شود.\n" +
                        "گیاه بامبو را در چه گلدانی باید قرار دهید؟\n" +
                        "گیاه بامبو را در گلدانی که دهانه آن حدود 5 سانتیمتر گشادتر از قطر مجموع ساقه ها باشد قرار دهید و گلدان را با آب بدون کلر پر کنید و با دانه های لیکا (پوکه صنعتی) اطراف ساقه ها را طوری بپوشانید تا در درون گلدان به صورت شکیل بایستد. شما می توانید از دانه های لیکا به عنوان سطح اتکا و حایل برای بالا و پایین نگه داشتن ساقه ها استفاده کنید.\n" +
                        "\n" +
                        "دانه های لیکا به علت پخته شدن در دمای بالا، از هرنوع آفت و بیماری به دور هستند و رطوبت را به دلیل متخلل بودن در خود نگه می دارند و در صورت رفتن به مسافرت و فراموش نمودن آبیاری به خاطر داشتن خلل و فرج، آب را به اندازه کافی در خود ذخیر کرده و رطوبت لازم را به گیاه می رساند.\n" +
                        "نحوه مراقبت از گیاه بامبو:\n" +
                        "چگونه از گیاه بامبو خود مراقبت کنید؟\n" +
                        "این یک گیاه خانگی است، آن را دور از نور مستقیم خورشید قرار دهید. مطمئن شوید که سطح آب بالاتر از ریشه این گیاه قرار میگیرد حداقل یک اینچ بالاتر از ریشه)ساده است که این دو قاعده را دنبال کنید و گیاهتان را به مدت زمان طولانی نگه دارید.\n" +
                        "نور گیاه بامبو :\n" +
                        "گیاه بامبو میتواند با سطح متوسط نور غیر مستقیم به بهترین نحو رشد کند.مانند قرار دادن در کنار یک پنجره ای که نور میتابد.نور مستقیم برای گیاه بیش از حد قوی است و باعث میشود که رنگ برگ های آن ، قهوه ای شود.گیاه بامبو را باید همیشه در خانه نگه دارید. نور مستقیم آفتاب برای این گیاه زیان آور است.\n" +
                        "\n" +
                        "آب گیاه بامبو :\n" +
                        "پیشنهاد ما به شما این است که از آب معدنی یا آب تصفیه شده استفاده کنید. زیرا آب شیرین حاوی کلر است که باعث میشود کگه نوک برگ های گیاه قهوه ای شود.اگر تنها راه شما استفاده از آب شیر است، می توانید آن را در یک ظرفی به مدت 24 ساعت نگه دارید و بعد به گیاه بدهید.برای جلوگیری از خشک شدن ریشه ها باید همیشه سطح آب حداقل یک سانت بالاتر از ریشه باشد.\n" +
                        "گیاه را درون آب غوطه ور نکنید .استفاده از آب شور و آبی که کلسیم و منیزیم اضافی دارد، در روند رشد این گیاه اختلالاتی مانند ایجاد رنگ زرد و قهوه ای در لبه برگ ها به وجود می آورد.\n" +
                        "\n" +
                        "آب را هر 14 روز یک بار تغییر دهید تا از پوسیدگی ریشه ها جلوگیری شود. در پاسخ به سوال شما کاربران نمناکی برای جلوگیری از بو گرفتن آب، حداقل ماهی یک بار آن را تعویض کنید و دانه های لیکا و ساقه گیاه را هنگام تعویض آب گلدان با آب و کف صابون بدون اسانس ، بشویید. این کار را در محیطی سربسته، که هوا در آن جریان نداشته باشد، انجام دهید زیرا ریشه ها نباید در معرض هوای آزاد قرار گیرند.\n" +
                        "\n" +
                        "خاک مناسب گیاه بامبو :\n" +
                        "بهترین خاک برای کاشت این گیاه نسبت مساوی از خاک برگ مرغوب یا پیت موس، خاک باغچه، دانه های ریز لیکا یا پرلیت، و مقداری پودر قارچ کش ترکیب شده باشد تا زهکشی به خوبی انجام گیرد و از گزند قارچ گرفتگی نیز در امان بماند. به شرط آنکه ترکیب خاک مناسب و دارای مواد مغذی کافی باشد گیاه کاشته شده در درون خاک نیازی به کود ندارد.\n" +
                        "\n" +
                        "تغذیه گیاه بامبو :\n" +
                        "فقط از مواد غذایی یا کود های گیاهی استفاده کنید و از کودهای ارگانیک یا کود مخصوص این گیاه تنها زمانی استفاده کنید که گیاه تازه آغاز به زرد شدن کرده باشد زیرا کودهای ترکیبی حاوی مقدار زیادی نمک و فسفر هستند که سبب سوختن برگ ها خواهند شد.\n" +
                        "\n" +
                        "باید بدانید زیان کود زیاد بیش از کود ندادن است. بامبو نیازی به مواد مغذی و کود ندارد. میتواند سالها با آب تمیز زنده بماند.برخی غذا های سوپر سبز برای گیاه بامبو ساخته شده است.\n"));
        mItem33.add(new Item(R.drawable.bonsai,"بن سای ",
                "رطوبت نیاز ",
                "نور زیاد",
                "دوراز گرمای مستقیم",
                "درخت بن سای چیست ؟\n" +
                        "\n"+
                        "درخت بن سای درخت کوچکی است که در یک ظرف کشت می شود. در واقع کلمه \"بن سای\" در ژاپنی به معنای \" کاشته شده در ظرف\" است. بن سای به هنر کشت این درختان کوچک اشاره می کند و بخش جدایی ناپذیر فرهنگ ژاپنی است که به اوایل قرن 14 ام باز می گردد.\n" +
                        "\n" +
                        "زمانی که تنها ثروتمندترین اشراف زاده ها و اعضای عالیرتبه جامعه ژاپن می توانستند از این درختان لذت ببرند, اما اکنون نوعی هنر است که مردم سراسر جهان از آن لذت می برند.اولین بار دیدن بن سای چیز معمولی نیست.\n" +
                        "\n" +
                        "سناریوی معمول به این شکل است:شما یک بن سای را به عنوان هدیه ای برای کریسمس یا برای روز تولدتان می گیرید. آن را دوست دارید و می خواهید آن را خوب نگه دارید تا خوب رشد کند.\n" +
                        "با این حال، علی رغم بهترین تلاش ها، زرد می شود و یا برگ هایش شروع به ریزش می کنند و زودی می میرد.\n" +
                        "\n" +
                        "مراقبت از درخت بن سای:\n" +
                        "مراقبت از درخت بن سای ممکن است ابتدا سخت و ترسناک باشد. در اینجا چند نکته برای نشان دادن اینکه چطور از این درخت می توانید مراقبت کنید، وجود دارد. همچنین یک راهنمای مفید برای راهنمایی سریع برای ارجاع آسان ایجاد کردیم.\n" +
                        "نحوه قرار دادن درخت بن سای:\n" +
                        "برای تعیین بهترین مکان برای نمایش بن سای هایتان باید بدانید چه نوع درختی دارید و بایدها و نبایدهایش چیست. اکثر گونه های بن سای درخت هایی مانند سرو کوهی, کاج و صنوبر در فضای هستند که باید در معرض فصول مشابه با همتایان بزرگ تر خود قرار گیرند.\n" +
                        "بن سای های فضای باز هم شامل درختان برگریز هستند, به این معنی که برگ ها با فصل ها تغییر می کنند اینها عبارتند از افرا, نارون و چهل سکه. روی لبه پنجره آشپزخانه و یا روی میز قهوه آنها را قرار ندهید، بله، بن سای یک درخت است و درختان گیاهانی برای فضای باز هستند.\n" +
                        "مگر اینکه بن سای شما سریسا یا انجیر باشد، آن ها را هم، تا جایی که ممکن است بیرون نگه دارید. چند گونه دیگر برای بن سای وجود دارد که داخل خانه را تحمل خواهند کرد، اما هیچ یک از آن ها واقعاً در داخل خانه رشد نمی کنند و همه آن ها مشکلاتی را در آنجا خواهند داشت. بیشتر آن ها می میرند.\n" +
                        "\n" +
                        "موقعیت یابی:\n" +
                        "بن سای شما باید از گرمای مستقیم دور نگه داشته شود.\n" +
                        "نورپردازی:\n" +
                        "بن سای خود را در محلی قرار دهید که نور زیادی داشته باشد.\n" +
                        "رطوبت:\n" +
                        "بن سای به رطوبت نیاز دارد تا خاکش را مرطوب نگه دارد.\n" +
                        "یکی از دلایل مرگ بیشتر درختان، کم آب دادن است. چون لایه خاک بسیار کم عمق است و مستعد خشک شدن بسیار سریع است. درختان بن سای وقتی که لایه بالایی خاکشان خشک می شود, باید آبیاری شوند.\n" +
                        "برای اطمینان از اینکه به درستی آبیاری خود را آبیاری می کنید, باید هر روز درخت نب سای خود را ارزیابی کنید. قاعده انگشت شست به محض خشک شدن خاک, آب است.\n" +
                        "\n" +
                        "انتخاب خاک مناسب برای بن سای:\n" +
                        "کلید انتخاب خاک مناسب, انتخاب گزینه مناسب برای زه کشی مناسب است. ذرات درشت را به مخلوط خاک اضافه کنید, مانند سنگ آتشفشانی یا سنگ, برای بهبود زه کشی و ورود هوا به خاک است. مخلوط خاک ایده آل باید قادر به نگهداری آب باشد که با افزودن رس بهبود یابد.\n"));
         mItem33.add(new Item(R.drawable.aluevera,
                 "آلوئه ورا",
                 "12 یا 14 روز یک بار ",
                 "نور زیاد خورشید",
                 "17 تا 24 درجه ",
                 "یکی از گیاهان رایجی که در آپارتمان و منزل نگهداری می شود آلوئه ورا می باشد که علاوه بر زیبایی بخشیدن به خانه ، خواص درمانی فراوانی نیز دارد . بسیاری از افراد که گیاه آلوئه ورا را در منزل نگهداری می کنند ، به جز بهره بردن از زیبایی این گیاه بی درد سر و ساده از برگ های آن برای زیبایی پوست خود استفاده می کنند.\n" +
                         "\n"+
                         "اگر شما نیز علاقمند به نگهداری از این گیاه هستید اما روش نگهداری از آن را نمی دانید با این بخش از خانه داری نمناک همراه شوید تا درباره پرورش این گیاه اطلاعات بیشتری کسب کنید.\n" +
                         "\n" +
                         "طریقه نگهداری و پرورش گیاه آلوئه ورا\n" +
                         "\n" +
                         "آلوئه ورا گیاهی شبیه کاکتوس می باشد که با نام های صبر زرد و در هندوستان به نام «آیورودا» شناخته می شود و شرایط نگهداری و پرورش آن بسیار آسان است . این گیاه به پای ثابت سالن پذیرایی، تراس یا گلخانه های خانگی تبدیل شده است و خواص درمانی زیادی دارد و به صورت خوراکی و موضعی مصرف می شود.\n" +
                         "\n" +
                         "دمای مناسب نگهداری آلوئه ورا\n" +
                         "آلوئه ورا گیاهی است که بیشتر در مناطق گرمسیری و خشک پرورش می یابد . این گیاه به دمایی بین 17 تا 24 درجه سانتی گراد نیاز دارد و در گرما و سرمای شدید آسیب می بیند. اگر دوست دارید در خانه آلوئه ورا نگهداری کنید بهتر است به دمای نگهداری آن توجه نمایید و اگر منطقه زندگی شما روزهای گرم و شب های سردی دارد از پرورش این گیاه صرفه نظر کنید . بهتر در برخی از ساعات روز این گیاه را بیرون از خانه ببرید تا نور خورشید را مستقیما دریافت کند.\n" +
                         "\n" +
                         "آبیاری گیاه آلوئه ورا\n" +
                         "\n" +
                         "گیاه آلوئه ورا را 12 یا 14 روز یک بار زمانی که خاک این گیاه کاملا خشک شد آبیاری کنید زیرا آبیاری زیاد گیاه سبب خراب شدن گیاه می شود . مقدار آب دهی به این گیاه باید طوری باشد که آب از زهکش گلدان خارج نشود و اگر آب در زیر گلدانی جمع شد سریع آن را تخلیه کنید زیرا آب اضافه سبب فاسد شدن ریشه می شود.این گیاه در زمستان به آب کمتری احتیاج دارد و به خواب می رود وبهتر است مقدار آبیاری آن در زمستان ماهی یک دفعه باشد.\n" +
                         "\n" +
                         "از چه کودی استفاده کنیم؟\n" +
                         "کوددهی به آلوئه ورا\n" +
                         "از کود رقیق (آبکی) و یا از نوع نیمه قوی(10-40-10) برای پرورش آلوئه ورا استفاده کنید.چنانچه، خاک ،حاصلخیز نیست،باید کود نیمه قوی را در هر ماه یکبار از ابتدای فصل بهار تا آخر تابستان،به گیاه داد.کودهای ارگانیک و یا کودهای گرم را برای گیاهان کاشته شده در محیط بیرون،می توان استفاده کرد.\n" +
                         "\n" +
                         "تعویض گلدان\n" +
                         "بهترین خاک برای پرورش آلوئه ورا ترکیبی از ماسه یا پولیت 40 درصد با خاک برگ است که باید درون یک گلدان سفالی بریزیم و گیاه را در آن بکاریم . برای انتخاب گلدان باید به سایز گیاه توجه کنید و از انتخاب گلدان کوچک بپرهیزید .\n" +
                         "\n" +
                         "بعد از گذشت یک سال از کاشت آلوئه ورا گلدان را تعویض نمایید زیرا ریشه های آن به حد کافی رشد کرده اند. بهتر است هر 6 ماه یکبار نیز خاک گلدان را عوض کنید و دقت داشته باشید هنگام تعویض خاک زهکشی های گلدان را مسدود نکنید زیرا وجود زهکشی مانع از فساد ریشه گیاه می شود.\n" +
                         "\n" +
                         "تکثیر گیاه آلوئه ورا\n" +
                         "راه های مختلفی برای تکثیر آلوئه ورا وجود دارد اما ساده ترین راه تکثیر آلوئه ورا در خانه استفاده از پاجوش هاست . پاجوش ها یا جوانه ها در قاعده گیاه هر 6 ماه یک بار رشد می کنند . \n" +
                         "برای تکثیر گیاه آلوئه ورا روش های مختلفی وجود دارد که یکی از آنها استفاده از پاجوش هاست. آلوئه ورا هر 6 ماه یک بار پاجوش ها یا جوانه هایی می زند که درست در قاعده گیاه رشد می کند. این جوانه ها بهترین و ساده ترین روش خانگی برای تکثیر آلوئه وراست.\n" +
                         "خیلی آرام و به آهستگی این جوانه ها را با ریشه از گیاه جدا کنید و آنها را در یک گلدان جداگانه بکارید پس از گذشت دو تا سه هفته خواهید دید ریشه های گیاه رشد می کنند و یک آلوئه ورا را به وجود می آورند.\n"));
        mItem33.add(new Item(R.drawable.marjan,
                "مرجان بومی ",
                "۱۰ روز یکبار",
                "نور زیاد غیر مستقیم",
                "دمایی ۱۶ الی ۲۴ درجه ",
                "مرجان بومی منطقه همیشه در صحنه ی *ماداگاسکار* میباشد این منطقه از نظر فلور گیاهی منطقه ی بسیار قدرتمندی است و دارای گونه های خیلی خاصی است این گیاه مثل بنت القنسول از گیاهان گلدار این خانواده ی صمیمی است البته با تیغ های فراوان و با شاخه های منشعب و برگ هایی شبیه به برگ زرشک و گل هایی قرمز رنگ که یکی از زیباترین بخش های  این گیاهان است.در این گیاه،قسمت قرمز رنگ در واقع دوبراکته کلیوی شکل است که در زیر گلها ظاهر میشود.در تمام طول سال ممکن است گل بدهد ولی اغلب در زمستان به گل میرود.این گیاه نیمه گوشتی است که در قسمت زیرین چوبی شده است.به دلیل شیر زیاد و سفیدی که از ساقه تراوش می شود اصطلاحا به آن شیر سگ میگویند\n" +
                        "\n" +
                        "نور: به نور زیاد غیر مستقیم  احتیاج دارد  اگه نور مستقیم یا شدید باشه برگ ها زرد میشن ! داخل منزل پنجره ی روبه قبله یاهمان جنوبی  پشت پرده سفید مکان مناسبی برای نگهداری آن است. البته داخل منزل باید حتما تهویه داشته باشه اگه تهویه نداشته باشه گل نمیده ! مثلا اتاق پذیرایی بزرگ یا پنجره اشپزخونه خوبه براش ولی درکل راه پله روشن از همه بهتره. \n" +
                        "\n" +
                        "آبیاری: بین دو آبیاری حتما باید خاک خشک شده باشد بر عکس کاکتوس ها این گیاهان سوخت و ساز زیادی دارندو باید هر ۱۰ روز یکبار آبیاری شود البته جای نگرانی نیست اگر روزی فراموش کردید آبیاری کنید چون گیاه مقاومی است\n" +
                        "\n" +
                        "رطوبت: به خاطر نوع متابولیسم و تکامل خود به کمبود رطوبت مقاوم هستند ولی خب جای مرطوب برای آنها یک امتیاز محسوب میشود مثل شمال ایران که بسیار خوب رشد میکنند!! سعی کنید روی بوته اب ریخته نشه چون اصلا جنبه نداره و یهو قارچ میزنه روی برگ ها !\n" +
                        "\n" +
                        "افزایش:بسته به گونه،با بذر،قلمه و تقسیم بوته افزایش می یابد.در استفاده از قلمه برای جلوگیری از ترشح شیره در انتهای برش خورده،باید انتهای آنرا در خاک ذغال و یا آب گرم فرو برد . پس از آن در محیط کشت قرار داد.یا اینکه بعد از برش بذارید جایی تاریک مثه کمد یکی دور روز بمونه بعد بیارید بزنید توی ماسه ، و تا یک روز بهش آب ندید بعد ابش بدید. \n" +
                        "\n" +
                        "دما:بهترین رنج دمایی ۱۶ الی ۲۴ درجه میباشداین دما یعنی هوای معمولی داخل اتاق یعنی نباید جایش گرم باشد هوای گرم تابستان باعث زرد شدن برگ میشه دما بالای ۳۰ درجه بره باید ابیاری هم بیشتر بشه وگرنه زرد میکنه ولی هوای گرم برای گلدهیش خوب نیست و بهترین گلدهی رو توی هوای خنک داره !\n" +
                        "\n" +
                        "خاک : بهترین ترکیب ترکیب خاک کاکتوس یعنی ۳ قسمت ماسه ۲ قسمت خاک برگ و ۲ قسمت خاک باغچه است تا آب را از خود رد کند و خدای نکرده باعث پوسیدگی نشود موقع کاشت توصیه میشه با قارچکش کاربندازیم که سیستمیک و مناسب ضدعفونی خاک هست خاک رو ابیاری کنید تا جلوی پوسیدگی های بعدی گرفته بشه !\n" +
                        "\n" +
                        "هرس: برگ های زرد و خشک شده را بچینید اگر گیاه شما خیلی بلند شده میتوانید ساقه ی آن را از بالا بچینید و قلمه بزنید و ساقه قبلی هم از کنار جوانه میزند و گیاه گرد خواهد شد هرس شاخه های مختلف باعث گرد و پرگل تر شدن گیاه میشه.\n" +
                        "\n" +
                        "تغذیه: از بهار تا آخر پاییز دوهفته یبار یکبار با کود آهن و کودهای گرین آپارتمانی تغذیه کنید گیاه خودتون رو.  همینطور که گفتم این گل عاشق آهنه و دوهفته یبار بهش آهن بدید. داخل اتاقی که تهویه نداره گیاه ساقه هاش نازک میشن چون خوب کلسیم جذب نمیشه و خوب ریشه ها رشد نمیکنن !\n" +
                        "\n" +
                        "گلدهی : این گیاه روز کوتاه اختیاری است یعنی اگر شرایط مهیا باشد در طول سال گل میدهد ولی در نمیه دوم سال گلدهی بیشتر است تغذیه با آهن هم باعث افزایش گلدهی در گیاه خواهد شد  !\n" +
                        "\n" +
                        "بیماری و آفت:\n" +
                        "به شپشک آردآلود ، تریپس و شته روی گلها ، حساس است همینطور در تابستان ممکن است دچار بیماری قارچی شود که با مشاوره از سایت ما سم مورد نیاز را دریافت خواهید کرد.\n"));
        mItem33 .add(new Item(R.drawable.hana,
                "حنا",
                "ابیاری به مقدار مناسب",
                "نور غیر مستقیم ",
                "18 تا 22 درجه",
                "نام جنس گل حنا که به زبان فرانسوی به معنی بی حوصله است را به این دلیل به آن داده اند که در اثر لمس کردن کپسول میوه یک باره باز شده و بذرها پراکنده می شوند و نام Touch me not نیز به همین دلیل است. گلهای حنا خب دو دسته ی کلی هستند یکی گل حنای باغچه ای که سایه پسنده و پر گل و زیباست و یکی هم گل حنای گینه نو ، یا اصلاح شده و گل درشت !  صحبت ما اینجا سر حنای گینو نو هست که حدوده ۸ ساله توی ایران مد شده و یکی از ویژگی هاش خنثی بودن به طول روز هست که باعث شده توی خونه همیشه گل داشته باشه ! و البته توی باکس بیرون توی بالکن هم تا زمان سرما گل داشته باشه ! نکته ی قابل توجه گلهای درشت ، برگهای براق، دوره ی گلدهی زیاد ، تنوع رنگ بالا ، غیره هست که این گل رو به یه گل بی نظیر تبدیل کرده است !این واریته امروزه یکی از پرتیراژ ترین گلهای تولیدی در دنیا هست که دارای صدها هیبرید و رنگ مختلف ، گلهای پرپر و برگهای ابلق و غیره هست.\n" +
                        "\n" +
                        "\n" +
                        "نور\n" +
                        "خوشبختانه گیاه نورطلبی نیست و خب شرط لازم ولی نه کافی برای گلدهی این گیاه در منزل نور هستش، به این معنی که باید همیشه کنار پنجره با نور غیر مستقیم باشه! توجه کنید غیرمستقیم یعنی اصلا افتاب بهش نخوره!!  مثلا پنجره ی پشت به قبله یا همون شمالی! محیط آشپزخونه که اصلا ساخته شده برای این گل ! هم رطوبت داره و هم نور کنار پنجره البته ! به هرحال محیطی که سایه دستتون مرز مشخص نداره براش خوب  نیست ، سایه دستتون هرجا مرزش مشخص بود براش محیط خوبیه.\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "آبیاری\n" +
                        "یکی دیگه از شروط موفقیت این گل  ، قلق آبیاریش هست که خیلی مهمه ! ازون دسته گلهایی نیست که بخرید و بعد برید مسافرت به امید همسایه ! باید سروقت اب بخوره و شاید این موضوع کمی نگهداریشو سخت کرده باشه ! اولا گیاه کم آبی نیست دوما از قرارگرفتن گلدون توی ظرف اب هم بدش میاد !  اگه اب زیاد بخوره ، ساقه از پایین سیاه میشه و خم میشه پایین و اگه اب کم هم بدید باز شاخ و برگ آویزون میشن و بازم شوک وارد میشه به گل ! بهتره با خشکی روی خاک ابیاری بشود\n"));
    }
    //======================change font===============================
    @Override
    protected void attachBaseContext(Context newBase) {
        super.attachBaseContext(CalligraphyContextWrapper.wrap(newBase));
    }
}

