package com.example.golkhune;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Context;
import android.os.Bundle;

import java.util.ArrayList;
import java.util.List;

import uk.co.chrisjenx.calligraphy.CalligraphyContextWrapper;

public class biruni extends AppCompatActivity {
    RecyclerView recyclerView_biruni;
    List<Item> mItem_biruni = new ArrayList<>();
    ItemAdapter_apartemani mAdapter_biruni;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_biruni);

        recyclerView_biruni =findViewById(R.id.recycler_view_biruni);
        mAdapter_biruni= new ItemAdapter_apartemani(mItem_biruni,this);
        RecyclerView.LayoutManager mLayoutManager3 = new LinearLayoutManager(getApplicationContext());
        recyclerView_biruni.setLayoutManager(mLayoutManager3);
        recyclerView_biruni.setAdapter(mAdapter_biruni);
        setDeta3();

    }

    private void setDeta3() {
        mItem_biruni.add(new Item(R.drawable.aftabgardno,
                "آفتابگردان ",
                "آبیاری کافی و منظم  ",
                "نور کامل آفتاب  ",
                " ۲۵-۲۱ درجه ",
                "نام انگلیسی : Helianthus annuus\n" +
                        "\n" +
                        "خانواده : Asteraceae/Compositae\n" +
                        "آفتابگردان زینتی بومی غرب آمریکا است. واژه Helianthus از دو کلمه یونانی Helios به معنی آفتاب و Anthos به معنی گلی که مسیر آفتاب را دنبال می کند، گرفته شده است. این گونه گیاهی یکساله و پر رشد با ساقه منشعب یا غیر منشعب و مرتفع است. انواع پا کوتاه آن نیز تولید شده است. گل های آن به قطر ۳۰-۲۵ سانتی متر و بصورت کم پر و پرپر بوده، گلچه های شعاعی در رنگ های زرد، قرمز و به ندرت بنفش و گلچه های مرکزی در رنگ های زرد، قهوه ای یا ارغوانی مشاهده می شود. این گیاه برای کاشت در حاشیه، گلدان و نیز به عنوان گل بریدنی بکار می رود.\n" +
                        "گلدهی\n" +
                        "آفتابگردان زینتی روز بلند اختیاری است و با کشت بذر در بهار، در تابستان به گل میرود. با تغییر زمان کاشت بذر تا آبان می توان از گلدهی گیاه استفاده کرد.\n" +
                        "\n" +
                        "نیاز های گیاه آفتابگردان زینتی\n" +
                        "نیاز به نور کامل آفتاب دارد. به سرما مقاوم است، اما برای گلدهی خوب به تابستان های گرم و طولانی نیاز دارد؛ بنابراین شبیه گیاهان حساس به سرما با آن رفتار می شود. ریشه این گیاه عمیق است و خاک آن باید خوب شخم زده شود. نیاز به خاک مرطوب، ولی با زهکشی خوب، غنی از مواد آلی با pH خنثی تا قلیایی دارد. خشکی خاک را به خوبی تحمل می کند.\n" +
                        "\n" +
                        "\n" +
                        "گل آفتابگردان به آبیاری کافی و منظم احتیاج دارد اما می تواند تا حدودی دوره خشکی را تحمل نماید. و این امر به دلیل ریشه مستقیم و توسعه یافته گیاه آفتابگردان می باشدکه پتانسیل نفوذ آن در خاک به سه متر می رسد. آبیاری منظم و مرتب به خصوص در طی ماه اول به رشد و توسعه مناسب سیستم ریشه این گیاه کمک می کند. از طرفی آبیاری بیش از اندازه موجب عدم شکل گیری و یا بدشکل شدن بذرهای شکل گرفته در مرکز گل می شود و خیس بودن همیشگی خاک در نهایت موجب زردی برگها و ریزش آنان و پژمردگی و مرگ گیاه می شود.\n" +
                        "\n" +
                        "دمای مورد نیاز آفتابگردان زینتی :\n" +
                        "\n" +
                        "گیاه آفتابگردان بهترین رشد خود را در دمای ۲۵-۲۱ درجه انجام می دهد اما دما را تا ۳۳ درجه و همچنین ۱۷ درجه به خوبی تحمل کرده و به رشد خود نیز ادامه می دهد هر مقدار که گرما بیشتر شود بهتر است که آب بیشتری نیز در اختیار گیاه قرار داد و یا فواصل آبیاری را کوتاه تر کرد اما هر مقدار که هوا سردتر باشد بهتر است که فواصل آبیاری را نیز بیشتر کرد و همچنین در این شرایط به آب کمتری نیز احتیاج است.\n" +
                        "\n" +
                        "خاک مورد نیاز آفتابگردان زینتی :\n" +
                        "\n" +
                        "خاک سبک دارای کود حیوانی پوسیده که در اثر آبیاری  فراوان باطلاقی نشود و همچنین خاکی با زهکش خوب و حاوی مواد ارگانیک همانند خاک برگ و یا کود پوسیده دامی به رشد این گیاه کمک می کند. همچنین اضافه کردن شن به میزان ۱۰٪ میزان کل حجم مخلوط خاک به زهکش بهتر خاک کمک می کند.آفتابگردان به شوری خاک نسبتا مقاوم است و در محدوده ای از اسیدیته خنثی رشد خوبی دارد.\n" +
                        "\n" +
                        "تکثیر گیاه آفتابگردان زینتی\n" +
                        "\n" +
                        "ازدیاد آفتاب گردان زینتی از طریق بذر انجام می شود .برای کشت بذر آفتابگردان ابتدا باید خاک محل کشت را تا عمق مناسب شخم زد و سپس در اواسط بهار نسبت به کاشت بذرها اقدام نمود (توصیه میشود خاک محل کشت از زهکشی مناسبی برخوردار باشد و برای تقویت خاک می توان از کمپوست و یا خاک برگ و کود پوسیده دامی استفاده کرد ) بذر ها در عمق ۲ تا ۳ سانتی متری کاشته به فاصله ۱۰ الی ۱۵ سانتیمتر از یکدیگر کاشته می شوند در صورتی که می خواهید بذر را در محیط گلخانه و یا منزل کشت نمایید می توانید در بستر آماده از خاک برگ و شن بذرها را کاشته و سپس پس از برطرف شدن دوران یخبندان و متعادل شدن هوا گیاهان جوان را که ۴ برگی و یا ۶ برگی شده اند را محیط باز منتقل کرد . از زمان کاشت تا رویش گلها زمانی بین ۸ الی ۱۰ هفته زمان نیاز دارد.\n"));
        mItem_biruni.add(new Item(R.drawable.davodi,
                "گل داوودی",
                "هر روز عصر یا صبح",
                "نور کامل خورشید",
                "10 الی 27 درجه",
                "معرفی گل داوودی\n" +
                        "\n" +
                        "نام علمی این گیاه Chrysanthemum هست و از خانواده Compositae ها به حساب میاد و داری 200 گونه مختلف می بشاد. این گیاه یک ساله و چند ساله می باشد که نوع گونه ای که شما تهیه میکنید بستگی دارد و روی بسته بندی حتما نوشته خواهد شد. گل داوودی دارای برگ های سبز نیره و گلهای با واریته های رنگی گوناگون می باشد. شما میتونید این گیاه را در فضا های سبز خود ما بین گل های رز بکارید تا زیبایی باغچه خود را دو چندان کنید.\n" +
                        "شرایط نگهداری و نیازهای گل داوودی\n" +
                        "شما همان طور که گفتیم میتویند این گل را به راحتی در داخل باغچه بکارید فقط بهتر است مکانی رو برای کاشت انتخاب کنید که در زمان نور مستقیم ظهر گیاه در سایه باشد ، اگر این امکان برای شما فراهم نیست مشکلی برای گیاه به وجود نخواهد آمد ولی شرایط ایده آل پرورش آن را در ادامه مورد بررسی قرار می دهیم.\n" +
                        "\n" +
                        "خاک مناسب\n" +
                        "اگر قصد دارید که این گیاه را در گلدان بکارید ترکیبی از خاک لوم و شن بهترین خاک برای پرورش می باشد ولی میتویند از ترکیب خاک باغچه+خاک برگ+کوددامی به نسبت مساوی برای خاک کاشت استفاده کنید. ولی حتما اگر قصد کاشت در فضای باز را دارید روی بذرها از کود دامی پوسیده استفاده کنید.\n" +
                        "\n" +
                        "\n" +
                        "دما متناسب\n" +
                        "چون این گیاه دارای گونه های مختلفی می باشد پس شرایط دمامی متفاوتی هم برای رشد نیاز دارد پس سعی کنید گونه ای را انتخاب کنید که با شرایط محیط زندگی شما سازگارتر باشد، اما نیاز دمای این گیاه بین 10 الی 27 درجه مغییر می باشد\n" +
                        "\n" +
                        "نور مناسب\n" +
                        "\n" +
                        "این گیاه به نور کامل خورشید نیاز دارد ولی اگر نور کافی برای گیاه فراهم نکنید غنچه های آن باز نخواهند شد پس اگر در گلدان اقدام به کاشت میکنید حتما فکر نور باشید.بهترین محل برای کسانی که در گلدان این گیاه رو میکارند پشت پنجره جنوبی هست.\n" +
                        "\n" +
                        "نیاز آبی گل داوودی\n" +
                        "این گیاه به آبیاری مدام نیاز دارد و حتما باید محل کاشت مرطوب باشد پس اگر در باغچه گیاه را کاشته اید حتما هر روز عصر یا صبح گیاه را آبیاری کنید و اگر در گلدان اقدام به کاشت نموده اید حتما خاک را مرطوب نگهدارید ولی باتلاقی نکنید. البته میتوایند از غبارپاشی هم هر روز برای تامین رطوبت استفاده کنید ولی غبارپاشی را به هیچ وجه هنگام ظهر انجام ندید.\n" +
                        "\n" +
                        "تعذیه و کوددهی\n" +
                        "اگر این گیاه را در داخل گلدان کاشتید سعی کنید از دودهای ازت و پتاس بالا برای گلدهی استفاده کنید برای استفاده هر هفته یکبار کافی خواهد بود ولی اگر در باغچه کاشته باشید همون ابتدای کاست از کود دامی پوسیده استفاده کرده باشید کافی هست.\n" +
                        "\n" +
                        "روش کاشت گل داوودی در گلدان و باغچه\n" +
                        "برای این کار ابتدا باید بذر مناسب شرایط نگهداری و محل زندگی خود را از بذر فروشی ها و وسایل کشاورزی فروشی ها تهیه کنید مرحله به مرحله طبق مراحل زیر اقدام کنید\n" +
                        "\n" +
                        "انتخاب بستر مناسب\n" +
                        "همانطور که در بخش نیازها گفتیم اگر قصد کاشت در گلدان را دارید بستر کشت که شامل خاکبرگ و شن یا خاکبرگ، کوکوپیت، پرلیت و یا هر گونه خاک سبک دیگری  اماده کنید و بذرها را روی بستر کشت بپاشید ، در خصوص باغچه هم بعد از شخم زدن و ساف کدن خاک بذرها را روی خاک بپاشید. و سپس با استفاده از کود حیوانی (برای باغچه) و خاک برگ به ضحامت 5 میلی متر تا 1 سانتی متر روی بذرها را بپوشانید.\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "آبیاری\n" +
                        "پس از کاشت بذرها با استفاده از آبپاش گلدان ها را به آرامی آبیاری کنید تا بذرها خیلی جابجا نشوند و از هم فاصله نگیرین ، با پاشیدن آب روی بستر کاشت در باغچه هم گل های خود را آبیاری کنید و مراقب باشید که بذرها جابجا نشوند از شدت زیاد آبیاری\n" +
                        "مرطوب نگه داشتن محل کاشت\n" +
                        "\n" +
                        "تا زمانی که جوانه های گل از خاک خارج نشده حتما بستر کشت را مرطوب نگهداری کنید بریا حفظ رطوبت میتونید از نیالون هم استفاده کنید ولی خیلی نیاز به نشان دادن حساسیت نیست راحت کار خودتون بکنید.\n" +
                        "\n" +
                        "به همین راحتی شما بدون هیچ دردسری گل های داودی خودتون رو کاشتید و پس از گذت مدتی شروع به گلدهی خواهند کرد از این روش های عجیب و غریب که در سایت های مختلف هم نوشته خبری نست.\n" +
                        "روش های کاشت و تکثیر گل داوودی\n" +
                        "\n" +
                        "معمولا تولید کنندگان گلهای شاخ بریده داوودی به سه روش مختلف اقدام به کشات و تکثیر این گیاه میکند که در ادامه به بررسی آنها خواهیم پرداخت.\n" +
                        "اولین روش\n" +
                        "استفاده از پاجوش ها هست که با جدا کردن پا جوش ها از گیاه مادری میتونید به راحتی این گل را تکثیر کنید ولی در موارد خیلی زیاد دیده شده که بیماری های گیاه مادر با استفاده از خاک به گیاه جدید منتقل شده پس خیلی از این روش استفاده نمیشه.\n" +
                        "روش دوم :\n" +
                        "در این روش پاجوش های سالم رو انتخاب میکنند و سر و ته آنها را به اندازه 10 الی 15 سانتی متر قطع میکنند مثل قلمه زدن و در داخل خاک گلدان، خزانه انتظار و یا باغچه میکارند.\n" +
                        "روش سوم :\n" +
                        "در این روش که به رشو قلمه هم معرف هست ساقه های چیده شده گل رو در خرانه یا گلدان به طوری که قلمه ها حداقل 10 الی 15 سانتی متر طول داشته باشند تمام برگهای اضافی را از گیاه جدا کنید و سپس قلمه را در داخل خاک بکارید. پس از تقریبأ سه چهار هفته قلمه ها ریشه دار خواهند شد و پس از آن میتوانید گیاه را به گلدان جدید و یا باغچه منتقل کنید.\n" +
                        "نحوه پرورش قلمه در خزانه انتظار :\n" +
                        "شما میتوانید کار تکثیر گل داوودی را ( قلمه کاری )از اواسط  بهمن ماه تا اوایل اردیبهشت انجام دهید زمان دقیق به وضعیت آب و هوایی شما دارد. ولی بهترین تاریخ عمل قلمه زنی از اواسط اسفندماه تا اواسط فروردین ماه است.\n" +
                        "عمل قلمه کاری اگر زودتر انجام گیرد ، ریشه و ساقه ها بطئی رشد کرده و گل پرورش یافته درشت می شود و با العکس اگر عملیات کشت قلمه دیرتر صورت گیرد ، رشد و نمو گیاهی سریع و بوته ها ضعیف تر و گلها کوچکتر خواهد شد.\n" +
                        "\n" +
                        "\n" +
                        "دمای مورد نیاز برای رشد قلمه ها\n" +
                        "برای سرعت دادن به رشد، ریشه دهی خوب درجه حرارتی در حدود 15 تا 18 درجه سانتیگراد برای محل نگهداری قلمه ها لازم است. قلمه های کاشته شده نسبت به تابش آفتاب حساسیت ندارند و اگر چنانچه باغبانی بخواهد با حصیر مانعی برای نور آفتاب تند ایجاد نماید ، این نکته را باید توجه نماید که برگهای قلمه به هیچ وجه پژمرده نشوند.توصیه می شود که عمل آبیاری از روی خاک انجام گیرد.از اوایل تا اواسط تابستان به علت رشد رشه ، حتما باید گلدانها و یا مکان قلمه ها در خزانه را تعویض کنید.جابجایی قلمه ها گاهی اوقات چهار یا پنج بار باید صورت گیرد و هر بار فواصل ردیف و بوته ها را باید مطابق بزرگی گیاه در نظر گرفت.\n" +
                        "تعیین تاریخ برداشت گل داودی :\n" +
                        "در میان گلها ، گل داودی از گلهائی است که تغییرات تاریخ برداشت آن ( یعنی روز ، هفته یا ماه ) توسط باغبان می تواند به آسانی انجام گیرد.چون این گل حساسیت خیلی زیادی در برابر تغییرات طول زمانی روشنائی دارد ولی این موضوع بی ارتباط با مسئله اقتصادی تهیه گل نیست.\n" +
                        "همانطوریکه اغلب تولید کنندگان گلهای زینتی در جریان امر هستند ، چون گل داودی در پائیز و تا نیمه زمستان می تواند مورد استفاده قرار گیرد ، از نظر هزینه های غیر قابل اجتناب پرورش و توزیع این گل از فصل سرما ، توجه بیشتری را باید مبذول داشت.\n" +
                        "با در نظر گرفتن اینکه گل داودی در زمان پرورش در داخل گلخانه احتیاج به حدود 16 درجه سانتیگراد حرارت می باشد ، از نظر هزینه تولید گرما مسئله بزرگی را در زمستان برای تولید کننده فراهم می نماید.\n" +
                        "همانطوریکه قبلا توضیح داده شد ، بالاخره برای تعیین تاریخ برداشت گل داودی ازاثرات روشنائی ( درکم و زیاد کردن فاصله روشنائی) استفاده کرد حتی می توان روز برداشت ( چیدن گل ) این گل را تعیین نمود برای این کار از تاریک یا روشن نگهداشتن محل رشد و نمو بوته های گل داودی می توان به نتیجه خیلی خوبی رسید.\n" +
                        "برای تعیین تغییرات مدت روشنائی مورد لزوم گل داودی می توان از پارچه کاملا سیاه رنگ استفاده نمود. البته در بعضی از نقاط با شرایط آب و هوائی مناسب عده ای از پرورش دهندگان گلهای زینتی از نایلون سیاه استفاده می نمایند.\n" +
                        "با در نظر گرفتن مطالب گفته شده فوق همچنین با ایجاد روشنائی مصنوعی بوسیله لامپ مهتابی یا لامپ های معمولی میتوان تغییراتی در تعیین تاریخ برداشت گل داودی بوجود آورد. برای به عقب بردن تاریخ برداشت گل داودی در تابستان احتیاج به نور مصنوعی نیست ولی از شروع فصل پائیز گل داودی در بعضی از مناطق نیاز به روشنائی دارد.\n"));
        mItem_biruni.add(new Item(R.drawable.kokab,
                "گل کوکب ",
                "اب فراوان",
                "آفتاب فراوان",
                "دمای معمولی",
                "گل کوکب کوهی بومی امریکای شمالی بوده وبصورت علف هرز در مزارع می روید. تمام گونه این گیاه دارای گلهای فراوان وعمر طولانی دارند. ارتفاع آن متفاوت و به صورت بوته های خودرو نا منظم و شاخه شاخه دیده می شود\n" +
                        "\n" +
                        "\n" +
                        "نام علمی و لاتین:\n" +
                        "rudbeckia ،  asteracees  composees\n" +
                        " گل کوکب کوهی برگ ها به شکل کشیده،دراز، نوک نیزه ای، کرک دار و به رنگ سبز روشن می باشد. دمبرگها سخت و محکم بوده و طول آن ها به ۴۵ سانتیمتر میرسد. گلها دارای برگچه در زیر گلبرگ قرار دارند گلها نوک تیز و به رنگ های زرد تند، قهوه ای و قرمز رنگ می باشند. این گلها کلا پرکی با میخک های زرد رنگ است که حلقه ارغوانی رنگ مایل به قهوه ای دور کلا پرک را احاطه کرده است. مرکز گلهای باز شده دارای ظاهر فلزی متالیک می باشد. یک بوته حتی می تواند تا ۶۰ گل نیز داشته باشد. گلها از اواسط تابستان تا اواخر پاییز شکوفا می شوند. سرمای کوتاه مدت یا یخبندان سطحی و کوتاه مدت چندان به آنان صدمه وارد نمی آورد.\n" +
                        "\n" +
                        "در بعضی از واریته ها گل نیمه پر،پر و یا پر، پر کامل هستند. از گونه هایی که به عنوان نباتات دائمی استفاده میشود گونه r.spender  می باشد که نباتی است دائمی، پر پشت به ارتفاع ۵۰ سانتیمتر. گلها زرد زعفرانی و دیسک وسطحی متمایل به قرمز بوده و نباتات تمام طول تابستان را گل می کند.گونه های دیگر به صورت پا کوتاه و گلهای پر،پر وجود دارد.\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "نحوه کاشت و ازدیاد گل کوکب کوهی:\n" +
                        "بذر کوکب کوهی یکساله را مانند نباتات یکساله می توان کاشت. ولی گونه های که دائمی هستند به وسیله تقسیم بوته می توان تکثیر نمود. برای کاشت بذر را در اوایل فروردین می کارند و در اواخر اردیبهشت در بستر اصلی نشاء می گردند.\n" +
                        "\n" +
                        "خاک گل کوکب:\n" +
                        "کوکب کوهی به خاک رس و ماسه ای و نسبتا” غنی از مواد آلی و مکانهای گرم و آفتاب گیر احتیاج دارد.\n" +
                        "کاربرد گل کوکب:\n" +
                        "گیاه کوکب کوهی را گروهی در بین گلهای دیگر می کارند. در مقابل درختچه ها و سوزنی برگان  زیبایی  خاص خواهد داشت همچنین جهت تزیینات پلات باندها یا به صورت گروهی برای زینت چمنها و مقابل درختان دائمی بکار میرود. از گلهای بریده آنها نیز برای تهیه دسته گل استفاده می شود. عمر گلهای بریده تا ۱۵ روز در آب می باشد. در طول مدت رشد و گلدهی بایستی گلهای کاملا” باز شده و پلاسیده را قطع نمود زیرا غنچه ها پس از بریدن در گلدان باز نمی شوند\n"));
        mItem_biruni.add(new Item(R.drawable.lale,
                "لاله عباسی ",
                "کاهش آبیاری در فصل زمستان",
                "آفتاب کامل",
                "۱۵_۳۰ درجه ",
                "گل لاله عباسی گیاهی است چند ساله از جنس Mirabilis در خانواده Nyctaginaceae که اغلب به صورت یکساله پرورش داده می شود و از شایع ترین گونه های زینتی این جنس است. این گل دارای تنوع رنگ زیادی است.\n" +
                        "\n" +
                        "گل لاله عباسی گیاهی است چند ساله از جنس Mirabilis در خانواده Nyctaginaceae که اغلب به صورت یکساله پرورش داده می شود و از شایع ترین گونه های زینتی این جنس است. این گل دارای تنوع رنگ زیادی است. در ضمن این گل بومی مناطق گرمسیری جنوب امریکا و رشته کوه های آند در کشور پرو میباشد. یکی از جنبه های عجیب این گیاه که با نام ساعت ۴ “Four O’Clock” در دنیا شناخته میشود این است که گل های در رنگ های مختلف را می توان به طور همزمان در یک گیاه مشاهده کرد.\n" +
                        "\n" +
                        "شاخه های لاله عباسی منشعب و برگ ها تخم مرغی شکل است. گل های لاله عباسی به صورت گل آذین خوشه مرکب در محور برگ ها تشکیل می شوند. گل های آن معطر و ۵ لبه به قطر ۲٫۵ تا ۵ سانتی متر بوده؛ و در رنگ های قرمز، زرد، سفید، صورتی و به صورت یک رنگ یا چند رنگ مشاهده می شوند.\n" +
                        "\n" +
                        "گل لاله عباسی در بعدازظهر یا در در هوای ابری باز شده و صبح بسته می شوند.\n" +
                        "ریشه های لاله عباسی ژوخه ای بوده و می توان از آن جهت افزایش استفاده کرد.\n" +
                        "در برخی کشور ها از گل های این گیاه برای ساختن رنگ استفاده می شود.\n" +
                        "شرایط مناسب برای پرورش گل لاله عباسی\n" +
                        "رطوبت\n" +
                        "کمی مرطوب. کاهش آبیاری در فصل زمستان\n" +
                        "خاک:\n" +
                        "خاک رس آهکی و کمی مرطوب\n" +
                        "تکثیر این گیاه از طریق بذر در اوایل بهار و یا تقسیم غده در هر زمان امکانپذیر است. اگر دانه های درشت سیاه و سفید شما را در آب به مدت یک شب قبل از کاشت قرار دهید، این کار منجر به جوانه زدن سریعتر خواهد شد.\n" +
                        "این گیاه در برخی مراجع به عنوان یک گیاه توهم زا معرفی شده است و میبایست از مصرف آن به صورت های مختلف اجتناب نمود.\n"));
        mItem_biruni.add(new Item(R.drawable.mina,
                " گل مینا",
                "یک تا دو بار در هفته",
                " نور کامل آفتاب",
                " ۲۱ تا ۲۲ درجه ",
                "مبدأ آن چین و ژاپن است. گیاهی یک ساله با رنگ ها و شکل های مختلف گل بوده، برگ های آن متناوب و بیضوی با حاشیه دندانه دار است. انواع کم پر و پر پر با گلبرگ های باریک و پهن دارد. رنگ غالب آن ها سفید، صورتی، قرمز آتشی، آبی و ارغوانی است. دارای انواع پاکوتاه، متوسط و پابلند بوده که ارتفا آن ها از ۱۵ تا ۶۰ سانتی متر متغیر است. از انواع پابلند آن برای گل بریدنی و از انواع پاکوتاه آن برای کاشت در گلدان می توان استفاده کرد. نباید آن را با مینای چندساله که گاهی به آن مینای چینی نیز گفته می شود و گلبرگ های آن اغلب آبی، آبی مایل به بنفش و گاهی قرمز و سفید با مرکز زرد رنگ است، اشتباه کرد.\n" +
                        "\n" +
                        "گلدهی\n" +
                        " زمان گلدهی مینای یک ساله اواسط مرداد و شهریور است. برخی از رقم های آن دیرتر به گل می رود. از آنجا که این گیاه در بهار گل نمی دهد، برای خالی نماندن زمین از گل آن را با دیگر گل های بهاره به صورت ترکیبی می کارند. مینای یک ساله برای تسریع گل آغازی در دمای ۱۳ –۲۰ درجه سانتی گراد، به عنوان یک گیاه روز بلند اختیاری طبقه بندی می شود ولی در دمای ۱۳ درجه سانتی گراد یا کمتر، روز بلند اجباری است و در شرایط روز کوتاه فقط به فرم طوقه ای رشد می کند. پس از گل آغازی در شرایط روز کوتاه نمو گل تسریع می شود. زمان گلدهی تحت تاثیر نسبت روزهای بلند به روزهای کوتاه قرار می گیرد. در شرایط روز کوتاه به کار بردن تیمار روز بلند (۱۶ ساعت روشنایی) باعث افزایش طول ساقه و کاهش زمان تا گلدهی می شود. نوردهی دوره ای ۷.۵ دقیقه در هر نیم ساعت به طور معمول استفاده می شود.\n" +
                        "\n" +
                        "نیازها\n" +
                        " خاک مناسب آن یک خاک غنی با زه کشی مناسب است. خاک مورد  استفاده برای کاشت مینا پائیزه نباید با متیل بروماید گندزدایی شود چون باعث کاهش تندیدن بذر می شود. زیادی کلسیم در خاک نیز برای کاشت مینا پائیزه مناسب نیست. به حالت غرقابی بسیار حساس است و خاک سنگین برای رشد آن مناسب نیست. مینا پائیزه یک گیاه یک ساله زمستانه است اما می تواند در تابستان رشد کند. محصول تابستانه اغلب در محل سرپوشیده پرورش داده می شود. در مناطقی که بتوان دما را در محدوده ۱۰ درجه سانتی گراد نگهداری کرد، در سراسر سال قابل پرورش است. با وجودی که یک گیاه یک ساله زمستانه است اما به سرمازدگی بسیار حساس است و بنابراین کاشت بذر آن باید در زمانی انجام شود که گیاه با دمای یخبندان مواجه نشود. سایه را تحمل می کند ولی نور فراوان آفتاب را ترجیح می دهد. از آنجا که ریشه های مینا سطحی است نباید دچار کم آبی شود. حذف گل های پژمرده به افزایش دوره گلدهی کمک می کند. سربرداری در بعضی رقم های مینا اثر مفید دارد و میتواند باعث افزایش انشعابات جانبی و تعداد گل در گیاه شود، گرچه گلدهی را مدتی به عقب   می اندازد.\n" +
                        "\n" +
                        "افزایش\n" +
                        " با بذر افزایش می یابد بذر آن در اسفند در شاسی سرد کشت شده و پس از یک مرحله جابجایی در مرحله ۴ برگی، در اردیبهشت ماه به زمین اصلی منتقل می شود. زمان انتقال نشاء اثر زیادی روی موفقیت یا شکست در تولید این محصول دارد که به شرایط آب و هوایی بستگی دارد. پس از کاشت آبیاری شده و برای چند روز بهتر است روی آن ها سایبان ایجاد شود. برای ادامه گلدهی تا آخر پائیز بذر را در چند مرحله کشت می کنند. از زمان کاشت بذر تا گلدهی بسته به رقم ۳ تا ۵ ماه طول می کشد.\n" +
                        "\n" +
                        "آفات و بیماری ها\n" +
                        " یکی از آفات رایج برای این گیاه مورچه است که طوقه را می خورد و باعث خشک شدن آن می شود. اگر در باغچه ای مورچه وجود داشته باشد، با سم لیندین یا سوین می توان با آن مبارزه کرد. از آنجا که این گل امراض قارچی نیز دارد توصیه می شود دو سال پشت سر هم در یک محل کشت نشود.\n"));
        mItem_biruni.add(new Item(R.drawable.silen,
                "سلین",
                "اب به مقدار لازم",
                "آفتاب کامل ",
                "دمای معمولی",
                "گیاه یک \u200Cساله نسبتاً سریع \u200Cالرشدی به ارتفاع ۳۰ و گستردگی ۱۵ سانتی\u200Cمتر است ، گل\u200C های صورتی پررنگ آن در تابستان ظاهر می\u200Cشوند. سیلن بومی حوزه مدیترانه ست ، سطح برگ های آن به طور خفیفی کرکدار ، برگ ها بادامی یا بیضوی شکل وزبر خشن به رنگ سبز درخشان  ست ، پایه ی گیاه شاخه شاخه و کاملا باز شده و تقریبا به حالت نیمه خزنده ،گل ها کوچک، کاسبرگ ها مقاوم و گلبرگ ها بریده بریده ، گل ها ی آن ساده یا پرپر به صورت خوشه ای به رنگ صورتی ، سفید یا قرمز تند هستند ،انتقال نشا  سیلن در اردیبهشت یا خرداد و به فواصل ۳۰تا۴۰ سانتی متر به بستر اصلی صورت میگیرد،سیلن گیاهی پر توقع نیست و در تمامی خاک ها کاشته می شود.مکان رشد سیلن باید آفتابگیر باشد تا گلدهی و رشد ان به خوبی انجام شود.گیاه سیلن در خاک های مرطوب یا غرقابی پس از باران های نسبتا طولانی از بین می رود،گیاه سیلن بیشتر جنبه ی تزیینی دارد،از خواص درمانی سیلن میتوان به این موارد اشاره کرد که آب عصاره ی آن برای درمان ناراحتی های چشمی کاربرد دارد و از آن برای شستشوی بدن نیز استفاده می شود و از ریشه ی آن نوعی صابون برای شستشوی بدن به دست می آید\n" +
                        "\n" +
                        "گیاه سیلن ( قلیونک) در خاک های فقیر نیز به آسانی رشد پیدا میکند. این گیاه بومی اروپا و آفريقا است. بعضی این گیاه را گوشت خوار می پندارند زیرا مگس ها و حشرات روی کاسه گل چسبان این گیر می افتند اما با توجه به ملاحظات این گیاه مانند گوشتخواران واقعی از حشرات گیر افتاده تغذیه نمی کند.گیاه سیلن ( قلیونک) در واقع گیاهی همه ساله است اما بیشتر به عنوان گیاهی یک ساله مورد استفاده قرار می گیرد\n" +
                        "\n" +
                        "ساقه و برگ\n" +
                        "ساقه ها و برگ های این گیاه توسط موهای سفید نازکی پوشیده شده و پرز دار هستند\n" +
                        "خاستگاه\n" +
                        "خاستگاه سیلن ( قلیونک) باغ های کلبه ای در انگلستان است. سیلن ( قلیونک) یک گیاه وحشی روستایی ست\n" +
                        "کاربرد\n" +
                        "در فضای سبز از این گیاه در مرزبندی ها و در گلدان ها  استفاده می شود. در نتیجه این گیاه میتواند گیاه مناسبی برای محیط خارجی و داخلی باشد. این گیاه در آيين افریقایی ها برای نفوذ یا تاثیر بر رویاها استفاده می شده\n" +
                        "تكثير گیاه از طریق بذر می باشد\n" +
                        "زمان جوانه زنی\n" +
                        "۱۵ تا ۲۵ روز\n" +
                        "بذر\n" +
                        "بذر پاشی را در اوایل فصل و ۳ هفته قبل از آخرین یخبندان انجام بدهید\n" +
                        "مرحله ۱: ابتدا بذر را بر بروی خاک بپاشید\n" +
                        "مرحله ۲: به اندازه  ۱ سانتی متر  خاک سبک بر روی بذر ها بریزید\n" +
                        "مرحله ۳: آبیاری را انجام دهید\n" +
                        "گیاه شما به آسانی جوانه زده و به سرعت رشد خواهد کرد. این گیاه از گیاهان خودرو به شمار رفته و پس از آنکه شما یک بار دانه را کاشتید این گیاه خود می تواند دانه ها را پراکنده کند و به آسانی دوباره رشد کند. اما اگر این ویژگی برای شما مناسب نیست و دوست ندارید این گیاه بیش از حدی که کاشته اید پراکنده شود بعد از آنکه دانه ها جوانه زدند  جوانه رأسی را قطع کنید\n" +
                        "نگهداری  سیلن\n" +
                        "نیاز نوری\n" +
                        "این گیاه آفتاب کامل را ترجیح میدهد اما گرمای زیاد برای گیاهان مطلوب نیست.بهتر است این گیاه در قسمت های گرم تر زمین و در سایه نسبی یا سایه بعد از ظهر بکارید\n" +
                        "\n" +
                        "خاک\n" +
                        "این گیاه از نظر نیاز خاکی کم نیاز به شمار می رود و حتی در خاک های فقیر و نیمه فقیر ( همانند خاک هایی که سنگی هستند) رشد خوبی خواهد داشت. اما به این نکته توجه داشته باشید که هر گیاهی در خاکی که غنی باشد رشد مناسب تر و بهتری خواهد داشت. این گیاه خاک خشک یا کمی مرطوب را ترجیح میدهد. پس خاکی که این گیاه در آن کاشته می شود باید دارای زهکشی مناسبی باشد. توجه داشته باشید اگر خاک بیش از حد مرطوب شود احتمال آلودگی های قارچی و پوسیدگی ریشه وجود خواهد داشت\n" +
                        "کوددهی\n" +
                        "برای آنکه گیاه شما حداکثر عملکرد خود را داشته باشد در فصل رشد آن ۱ یا دو مرتبه از کودهای کامل که تمامی مواد مورد نیاز یک گیاه را دارند استفاده کنید. سعی کنید کودهای طبیعی را برای حفظ ظاهر مرتب گیاه داشته باشید. در پاییز  یک لایه کود گیاهی به ضخامت ۳ تا ۹ سانتی متر در سطح خاک این گیاه را به سرمازدگی مقاوم خواهد کرد. البته توجه داتشه باشید که کود گیاهی را در فصل بهار باید کنار بزنید تا قسمت های رویشی گیاه بتواند پدیدار شود\n" +
                        "\n" +
                        "حشرات و بيمارى ها\n" +
                        "گیاهان سیلن ( قلیونک) آفت ها و بيمارى های کمی دارند البته  آنها در خاک خیس و دارای آب به خوبی رشد نمی کنند و ممکن است به بيمارى های قارچي دچار شوند\n" +
                        "نکات\n" +
                        "این گیاه گاهی نیازمند قیم است\n" +
                        "برای جلوگیری از گسترش این گیاه  گیاهان پژمرده و مرده را از گیاه جدا کنید که دانه ها پراکنده نشوداین گیاه معمولا گیاهی مقاوم بوده و مشکلات کمی برای آن پیش می آید اما اگر مشکلی برای گیاهتان پیش آمد سریعا آن را برطرف کنید\n"));
    }
    //======================change font===============================
    @Override
    protected void attachBaseContext(Context newBase) {
        super.attachBaseContext(CalligraphyContextWrapper.wrap(newBase));
    }
}

