package com.example.golkhune;


import android.content.Context;
import android.os.Bundle;

import androidx.annotation.NonNull;
import androidx.fragment.app.Fragment;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import java.util.ArrayList;
import java.util.List;

import uk.co.chrisjenx.calligraphy.CalligraphyContextWrapper;


public class home extends Fragment {

    RecyclerView recyclerView_new,recyclerView_behtarin;
    List<Item> mItem = new ArrayList<>();
    List<Item> newItem = new ArrayList<>();


    public static home newInstance() {
        return new home();
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);

    }


    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        View rootView = inflater.inflate(R.layout.fragment_home, null);


        recyclerView_new = rootView.findViewById(R.id.recycler_view_new);
        recyclerView_new.setLayoutManager(new LinearLayoutManager(getActivity()));
        setDeta_new();
        recyclerView_new.setAdapter(new ItemAdapter_new(mItem, getActivity()));
        //for HORIZONTAL recyclerView
        recyclerView_new.setLayoutManager(new LinearLayoutManager(getContext(), LinearLayoutManager.HORIZONTAL, false));

        recyclerView_behtarin = rootView.findViewById(R.id.recycler_view_mahbubtarin);
        recyclerView_behtarin.setLayoutManager(new LinearLayoutManager(getActivity()));
        setDeta_mahbubtarin();
        recyclerView_behtarin.setAdapter(new ItemAdapter2(newItem, getActivity()));
        //for HORIZONTAL recyclerView
        recyclerView_behtarin.setLayoutManager(new LinearLayoutManager(getContext(), LinearLayoutManager.HORIZONTAL, false));

        return rootView;
    }
    @Override
    public void onViewCreated(View view, Bundle savedInstanceState) {
        super.onViewCreated(view, savedInstanceState);
    }
    private void setDeta_mahbubtarin() {
        newItem.add(new Item(R.drawable.dd,
                "دراسنا",
                "توضیحات بامبو",
                "نور مستقیم آفتاب ",
                "24-15 درجه ",
                "اسم علمی این گیاه Dracaena marginata ، از خانواده Liliaceae میباشد. این جنس دارای 40 گونه مختلف از درختچه های همیشه سبزاست. اغلب گونه های این جنس نخل مانند بوده و ریشه هایی دارند که درتمام طول، قطر یکسانی داشته و به رنگ زرد نارنجی می باشد. گونه marginata نسبت به شرایط مختلف آپارتمانی بسیار مقاوم است. برگهای خطر دارد که خشن و سبز رنگ هستندو گاهی دارای نوارهائی به رنگ زرد یا قرمز متمایل به قهوه ای می باشند. در مواقعی که خطوط زرد برگ زیاد باشد گیاه احتیاج به نور بیشتری دارد\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "تکثیر\n" +
                        "دراسنا گاهی به صورت چند ساقه ای رشد کرده و بزرگ می شود و نیاز به هرس وکنترل دارد. این زمان برای تکثیر مناسب است. دراسنا را می توان از طریق قلمه های انتهایی ساقه و قلمه های ساقه ای تکثیر کرد. می توان از جوانه های به وجود آمده در پای گیاه نیز استفاده کرد. قلمه ها را به اندازه 10 تا 15 سانتیمتر، با یک چاقوی تیز جدا کنید قلمه ای ساقه ای را از ساقه یا بدون برگ بگیرید و به تکه های 5 تا 5/7 سانتیمتری تقسیم نمایید . هر تکه باید داری یک جوانه خفته باشد. مواظب باشید قطعات ساقه را وارونه در خاک نگذارید. اگر سمت پایین ساقه در خاک قرار نگیرد ، ریشه ای تولید نمی کند. هر قلمه را در پودر هورمون ریشه زایی فرو ببرید. برگهای زیادی را از ساقه جدا کنید. وهر قلمه را در گلدانی با قطر دهانه 9 سانتیمتر ، حاوی ورمی کمپوست مخصوص قلمه و بذر قرار دهید. قلمه ها را با کیسه پلاستیکی بپوشانید و در دمای 24 درجه سانتیگراد، دور از تابش مستقیم خورشید نگاه دارید. پس از دو ماه که ریشه دهی انجام شد، کیسه را بردارید و تغذیه مصنوعی را شروع کنید. بهترین زمان برای تکثیر دراسنا، از اواسط تا اواخر بهار و یا اواخر تابستان تا اوایل پاییز است .گرفتن قلمه از شاخه های مسن در اواخر زمستان،ساقه ها را به طور افقی در شن قرار دهید،کاشت بذر در دمای 30 درجه در بهار،خاوبانیدن شاخه ها در بهار.\n" +
                        " \n" +
                        "خاک:\n" +
                        "این گیاه، خاک کمی اسیدی را دوست دارد بنابراین برای ترکیب خاک آن از خاک باغچه+خاک برگ+ شن یا پرلیت می توان استفاده کرد. و یا می توان از خاک های مخصوص گیاهان گلدانی که زهکش خوبی هم داشته باشند استفاده کرد. این گیاه را می توان در فصل رشد هر 3-2 هفته یکبار با یک کود مایع مخصوص گیاهان آپارتمانی و یا هر ماه با یک کودی مثل 10-10-10 آن را تغذیه مصنوعی کرد. تعویض گلدان باید هر 3-2 سال یکبار با یک شماره بالاتر انجام شود.\n" +
                        "آبیاری:\n" +
                        "خاک سطح گلدان این گیاه جز در فصل زمستان باید همواره نمدار بماند. هفته ای 3-2 مرتبه آبیاری در تابستان و یکبار در زمستان کافی است. آب مورد استفاده برای آبیاری را 48 ساعت در ظرفی نگه دارید و بعد استفاده کنید.\n" +
                        "نور:\n" +
                        "گیاه را از نور مستقیم آفتاب محافظت کنید. در محیط هایی با نور روشن، سرعت رشد گیاه سریع تر می شود و در نور کم هم گیاه می تواند زنده بماند. \n" +
                        "دما:\n" +
                        "دمای 24-15 درجه برای آن ایده آل است. با کاهش دما به زیر 12 درجه به گیاه صدمه وارد می شود و برگ ها شروع به ریزش می کنند تا این که گیاه می خشکد. در دماهای بالاتر از حد تحمل گیاه، با اسپری آب بر روی برگ ها مانع سوختگی نوک برگ ها شوید.\n"));
        newItem.add(new Item(R.drawable.orkideh,
                "ارکیده",
                "هفته ای 3-2 مرتبه ",
                " نور غیرمستقیم خورشید",
                " زیر ۱۵ درجه سانتی گراد ",
                "ارکیده فیلیپینی، همانطور که از اسمش مشخص است، از فیلیپین آمده تا با برگ های متفاوت و گل های صورتی خود جلوه ی منحصر به فردی به محیط منزل شما بدهد." +
                        " نظیر برگ های ارکیده فیلیپینی را کمتر دیده اید، برگ هایی با رنگ سبز تیره که مانند گوشواره به گل خود آویزان است.\n" +
                "در جنگل ها، ارکیده فیلیپینی یک اپیفایت است، یعنی گیاهی است که در داخل حفره های درخت های بزرگ رشد می کند. برگ های محکم و بزرگ آن قادرند تا رطوبت را به مقدار زیادی برای گیاه حفظ کنند، یعنی گیاه به این زودی ها تشنه نمی شود\n" +
                "رطوبت\n" +
                "ارکیده در هوای مرطوب به خوبی رشد می\u200Cکند، پس بهتر است آن را در مکان هایی مانند آشپزخانه و یا حمام قرار دهید و یا با اسپری کردن کمی آب به آن، رطوبتش را حفظ کنید.\n" +
                "\n" +
                "چنانچه در مورد نگهداری از گیاه ارکیده فیلیپینی سوالی دارید. سوال خود را از طریق بخش نظرات برای کارشناسان گُل سِتان ارسال کنید. کارشناسان گُل سِتان در اسرع وقت پاسخ گوی سوالات شما خواهند بود.\n"));
        newItem.add(new Item(R.drawable.ficoshendi,"فیکوس هندی",
                " ۱۵ دقیقه در تشت آب ",
                "نورمتوسط وغیرمستقیم",
                "30تا15 درجه ی سانتیگراد",
                "رطوبت\n" +
                        "برای تامین رطوبت مورد نیاز گیاه بهتر است یک ظرف آب در کنار آن قرار دهید و یا هفته ای یک تا دو بار اقدام به غبارپاشی کنید.توجه داشته باشید که غبار پاشی در زیر نور مستقیم آفتاب موجب ایجاد لکه های سوخت بر روی برگ های گیاه می شود پس از انجام این کار خودداری کنید.\n" +
                        "کود دهی\n" +
                        "جهت رشد بهتر گیاه فیکوس میتوانید از کود و تقویت کننده مخصوص گیاهان طبق دستور العمل استفاده کنید\n" +
                        "پیشنهاد : خرید انواع کود و تقویت کننده مخصوص گیاهان\n" +
                        "\n" +
                        "خاک\n" +
                        "بهترین خاک برای گیاه فیکوس ، خاک کمپوست میباشد.\n" +
                        "پیشنهاد : خرید انواع خاک و پرلیت مخصوص گیاهان\n" +
                        "تعویض گلدان:\n" +
                        "زمان مناسب برای تعویض گلدان هنگامی است که ریشه گیاه از خاک بیرون زده باشد در غیر این صورت تعویض گلدان را به تعویق بیندازید.\n" +
                        "هرس فیکوس\n" +
                        "زمان مناسب برای هرس این گیاه در اوایل تابستان و اواخر بهار است.برای انجام این کار ساقه هایی را که خارج از فرم و شکل اصلی گیاه رشد کرده اند و یا ساقه هایی را که بیش از اندازه بلند شده اند را قطع و یا کوتاه کنید.\n" +
                        "برای برش شاخه های اضافی برش را از بالای یک گره (گره ناحیه اتصال برگ ها به ساقه است) بزنید. در جدا کردن ساقه ها زیاده روی نکنید زیرا ممکن است باعث شوکه شدن گیاه شوید. حجم کل ساقه ای جدا شده باید حداکثر حدود ۳۰٪ حجم کل ساقه های گیاه باشد.\n" +
                        "\n" +
                        "تمیز کردن برگ ها\n" +
                        "برای تمیز کردن برگ ها از اسفنج مرطوب و یا پارچه ی پنبه ای کمک بگیرید و با کمک آب برگ ها را تمیز کنید و توجه داشته باشید که استفاده از مواد شیمیایی براق کننده برای گیاه مضر است و برای براق کردن برگ ها به روش طبیعی می توانید از مقاله ی زیر کمک بگیرید.\n"));
        newItem.add(new Item(R.drawable.pachira,
                "پاچیرا",
                "نیازآبی نسبتابالا ",
                "نور شدید",
                "۱۶تا۲۴درجه",
                "پاچیرا به درخت پول و یا درخت شانس مشهور می باشد و در فرهنگ و سنت چین این گیاه برای رشد، پیشرفت و کسب درآمد بسیار مهم بوده و در بیشتر مغازه ها و ادارات این گیاه زیبا دیده خواهد شد.\n" +
                        "این گیاه بسیار سریع الرشد دارای برگ های سبز تیره با حالت کشیده و پنجه مانند دارند و ساقه صاف و بلند و مرتجع این گیاه که اغلب به خاطر زیباتر شدن بافته می شوند چشم هر بیننده ای را می نوازد.\n" +
                        "پاچیرا در منزلتان براحتی زندگی و رشد میکند . شاید بتوان گفت گیاهی کم توقع است . آب کم ، نور غیر مستقیم پشت شیشه و نگهداری آسان از خصوصیات آن است همچنین گیاهی مناسب برای بونسای کردن برای علاقه مندان به این درختچه های مینیاتوری است.\n" +
                        "\n" +
                        "از آبیاری بیش از اندازه نیز پرهیز کنید و دقت داشته باشید که بین دو آبیاری سطح خاک شود آبیاری بیش از اندازه باعث زردی و سیاهی نوک برگ ها می شود.\n" +
                        "خاک پاچیرا :\n" +
                        "ترکیب پیت ماس یا خاک های هلندی با پرلیت به صورت ۶۰ به ۴۰ به نفع پرلیت برای تهویه مناسب و زهکشی کافی مناسب است.\n" +
                        "کوددهی:\n" +
                        "ماهی یک بار تغذیه با کود کامل برای این گیاه کافی می باشد.\n" +
                        "تعویض گلدان پاچیرا :\n" +
                        "بهترین زمان برای تعویض خاک پاچیرا و گلدان پاچیرا به یک سایز بزرگتر در زمانی است که گیاه کمی به خواب رفته باشد . یعنی از اواخر پاییز تا اواخر زمستان . در این موقع سال چون پاچیرا رشد قابل توجهی ندارد و به حالت سکون در امده است براحتی میتوان اقدام به تعویض خاک اطراف ریشه و گلدان آن نمود .\n" +
                        "تکثیر از طریق بذر:\n" +
                        " ۲۴ تا ۴۸ ساعت بذر را در آب ولرم قرار دهید سپس در خاکی نرم و مرطوب به عمق ۱ سانت بکارید و روی لبه گلدان را به وسیله پلاستیکی شفاف کاور کنید گلدان را در اتاقی روشن با دمای ۲۴ درجه قرار دهید و منتظر سبز شدن باشید بعد از سبز شدن کاور را بردارید و گلدان به کنار پنجره شمالی انتقال دهید.\n" +
                        "تکثیر از طریق قلمه:\n" +
                        " ساقه های جدید را در آخر پاییز جدا کنید طوری که حداقل ۲ گره داشته باشند و در پرلیت یا پیت ماس فرو کنید بعد از ریشه دهی آن را به گلدان شماره ۶ حاوی خاکی سبک و پر انرژی انتقال دهید.\n"));
        newItem.add(new Item(R.drawable.potos,
                "پوتوس",
                "تابستان5-4 روز 1 بار ",
                "کم و مقاوم به سایه ",
                "22 درجه سانتیگراد",
                "خاک مناسب: خاک باغچه، ماسه و خاک برگ\n" +
                        "کوددهی: 3 گرم در لیتر کود محلول در آب و یا کود مایع هر 2 هفته 1 بار از فروردین تا آبان ماه\n" +
                        "پتوس گیاهی برگ زینتی و آپارتمانی است. برگ ها قلبی شکل اند. بسیاری ازگونه ها حالت بالارونده دارند و تا سقف بالا می روند.\n" +
                        "\n" +
                        "دو نوع دارد: پتوسبرگ معمولی و پتوس برگ ابلق.\n" +
                        "با اینکه هر دو مقاوم به سایه هستند، ولی نوع ابلق آن، نیاز به نور کمی بیشتر برای تشکیل رنگیزه دارد. در صورتی که نور کافی دریافت نکند، برگ ها به سبزی گرایش پیدا می کنند.\n" +
                        "\n" +
                        "پتوس ها، درمنازل به راحتی قابل نگهداری هستند. نیاز به نور مستقیم خورشید ندارند، ودر صورت دریافت نور مستقیم، آفتاب سوختگی بصورت تاول و سوختگی روی برگ هانمود پیدا می کند.\n" +
                        "مقاوم به رطوبت کم محیط است و در صورتیکه رطوبت بسیاربالا باشد، برگ ها خیلی پهن و درشت می شوند. با اینکه به راحتی روی دیوارقابل هدایت است، اما ممکن است در قسمت های بالایی و نزدیک به سقف، در اثرتجمع گرما دچار سوختگی شود و در نتیجه گیاه بد شکل می شود.\n" +
                        "چون برگ زینتی است به آبیاری و مواد غذایی گیاه باید توجه شود. دورآبیاری ۲_۱ بار در هفته و هر ماه ۱ بار استفاده از کود مایع مناسبِ این گیاه است.\n" +
                        "\n" +
                        "در حالی که پوتوس یک گیاه آپارتمانی با نیاز های مراقبتی کم و پرورشِ آسان است، باید مراقب باشید! زیرا این گیاه سمی است! البته این گیاه کشنده نیست اما اگر خورده و هضم شود به دلیلِ وجود کلسیم اگزالات در ترکیباتش، به تحریک دستگاه گوارشی و استفراغ منجر می شود. این گیاه همچنین برای سگ ها، گربه ها و کودکان کم سن سمی است؛ البته همانطور که گفته شد کشنده نیست ولی آن ها را بسیار مریض و بد حال می کند.\n" +
                        "عوارض و درمان:\n" +
                        "در صورتی که مشاهده کردید برگهای گیاه زیبای آن می ریزند و ساقه ها خم میشوند، احتمال بدهید گیاه تشنهو هوا خشک است، گیاه را فراوان آبیاری کرده و به محل خنک تری منتقل کنید. نور کم و یا کمبود مواد غذایی میتواند باعث درازای ساقه ها و فاصله زیاد بین برگها شود.\n" +
                        "نقاط قهوه ای و سیاه در مرکز یا نوک برگ معرف آسیب اشعه مستقیم آفتاب است. اگر هم در سطح زیرین برگها لکه ی برجسته قهوه ای وجود داشت، هفته ای یکبار با سم حشره کش نفوذی گیاه را سمپاشی کنید تا علایم بر طرف گردد.\n" +
                        "در صورتی که از رشد فعال و ظهور برگهای جدید خبری نباشد می توان حدس زد، محیط گیاه خیلی سرد است.\n" +
                        "اگر آن رابه جای گرمتری ببرید مشکل بر طرف میشود. هوای سرد همچنین می تواند برگها را چین و چروکدار و قهوه ای کند. در اثر خاک باتلاقی و یا آبیاری با آب خیلی سرد، برگهای پایینی گیاه میریزند و زرد می شوند.\n"));
        newItem.add(new Item(R.drawable.kaochoo,
                "کائوچو",
                "آبیاری (شیوه غبارپاشی)",
                "نور متعادل",
                "80-70 درجه فارنهايت",
                "کائوچو یا لاستیک جزو مواد بسیار ضروری در زندگی مدرن امروزی است کائوچو به دلیل خواص کشسانی فوق العاده اش برای ساخت انواع محصولات اعم از لوازم بیمارستانی، وسایل خانگی و اسباب بازی مورد استفاده قرار می گیرد.\n" +
                        "\n" +
                        "این ماده در صنعت نیز کاربردهای فراوانی دارد.کائوچو از زمانی که گیاهان بر روی زمین به وجود آمدند وجود داشته است. برخی از فسیل های گیاهان تولیدکننده کائوچو، سه میلیون  سال قدمت دارند.\n" +
                        "\n" +
                        "کائوچو از گیاهان خاصی گرفته می شود. در واقع بیش از 400 نوع گیاه وجود دارد که از شیرابه آنها مقادیر مختلفی کائوچو به دست می آید. قسمت اعظم کائوچوی طبیعی جهان را درخت «هوا برازیلینسیس» تولید می کند. این درخت که طول آن به بیش از 35 متر می رسد، بومی کشور برزیل است. در حال حاضر، بزرگترین منابع کائوچوی طبیعی جهان در «مالایا» واقع در جنوب شرقی  آسیا قرار دارد.\n" +
                        "\n" +
                        "برای تهیه کائوچو ابتدا شکافی در تنه درخت به وجود می آورند و سپس شیرابه سفید رنگی را که از شکاف خارج می شود، جمع آوری می کنند. این شیرابه را پس از آنکه سفت و خشک شد، به صورت ورقه در می آورند.. به این ترتیب ورقه های کائوچوی خام برای صدور به سایر کشورها آماده می شوند. جالب است بدانید که کائوچوی خام، ماده ای سست و چسبناک است و خاصیت کشسانی زیادی ندارد. استحکام و کشسانی کائوچو را با افزودن گوگرد افزایش می دهند. به این کار «ولکانیزه» می گویند.\n" +
                        " بعد از عمل ولکانیزه، مواد پرکننده (معمولاً دوده کربن) به کائوچو افزوده می شود تاکشسانی و قدرت آن باز هم افزایش یابد. پس از طی این مراحل،کائوچوی خام به ماده ای با خاصیت کشسانی زیاد تبدیل می شود و مورد استفاده قرار می گیرد. البته تولیدکائوچو با این روش بسیار گران و پرهزینه است.\n"));
    }

    private void setDeta_new() {
        mItem.add(new Item(R.drawable.bbb,
                "برگ بو",
                "به مقدار لازم",
                "آفتاب کامل ",
                "۵ درجه",
                "گیاه برگ بو به راحتی در دمای -۵ درجه نیز دوام خواهد آورد، اما آن دسته گیاهانی که در گلدان رشد می کنند، دارای ریشه های حساس به دما هستند، بنابراین برای جلوگیری از یخ زدگی ریشه ها حتما به دور گلدان لایه های محافظتی بپیچید. این گیاه برای رشد به آفتاب کامل و یا نیمه آفتاب نیاز دارد و مکان های دارای سایه برای رشد آن مناسب نمی باشند. به همین دلیل گلدان برگ بوی خود را در قسمتی قرار دهید که در روز آفتاب مستقیم و در بعدازظهر سایه بگیرد.\n" +
                        "\n" +
                        "خاک مناسب برگ بو\n" +
                        "خاک مناسب این گیاه همان خاک معمولی بوده که می توانید خاک برگ و یا کود پوسیده دامی به نسبت ۵۰ درصد کمتر از حجم کل خاک با آن همراه کنید. برای آن دسته برگ بوهایی که در گلدان رشد می کنند نیز بهتر است گلدانی با حداقل ۳۰ سانتی متر عمق و قطری برابر با ۲۰ تا ۹۰ سانتی متر بسته به اندازه گیاه انتخاب کنید. برای خاک گلدانی نیز از مخلوط یک قسمت خاک معمولی+یک قسمت خاک برگ+یک قسمت شن بهره گرفته، و برای زهکشی مناسب حتما وسیله ای بلند همچون آجر زیر گلدان قرار دهید تا آب اضافه باعث پوسیدگی ریشه نشود. یادتان باشد تعویض گلدان باید اوایل بهار انجام شده و بهتر است این کار هر دو سال یکبار صورت بگیرد. این گیاه مخصوصا اگر از نوع گلدانی باشد نیاز به کودهای کامل همچون  فرمول های -۱۰-۱۰ هر ۵-۴ هفته یک مرتبه دارد.\n" +
                        "\n" +
                        "آفات و مشکلات گیاه برگ بو\n" +
                        "اگر به تغذیه مناسب گیاه برگ بود رسیدگی شود این گیاه در مقابل آفات مقاوم خواهد بود، اما در غیر اینصورت شاهد آفاتی همچون شته ها، کنه های تار عنکبوتی و شپشکهای گیاهی خواهید بود. زرد شدن برگ های گیاه به دلایل پیری برگ و یا کمبود عناصر غذایی و یا آسیب های ناشی از دمای هوا و سرد شدن بیش از اندازه و یا کمبود بیش از اندازه آب باشد. ممکن است شاهد پوسته شدن و ریختن پوست تنه گیاه پس از زمستان های سرد باشید، در این حالت می توان گفت مشکل حاد نبوده و باید ساقه های خشکیده را از زیر ناحیه ای که پوسته شده ببرید.\n" +
                        "\n"));
        mItem.add(new Item(R.drawable.polchini,"پول چینی",
                "فقط هفته ای یک بار ",
                "نور غیر مستقیم ",
                "کم",
                "گیاه پول چینی از جمله گیاهان آپارتمانی است که امروزه محبوبیت و شهرت بسیاری یافته است. از آنجایی که شرایط نگهداری و  مراقبت از این گیاه در طول عمر آن تاثیر بسزایی دارد؛ بر آن شدیم تا در این مقاله درباره نحوه کاشت گیاه پول چینی، ویژگی های آن و همچنین چگونگی مراقبت از آن بیشتر برای شما توضیح دهیم.\n" +
                        "\n" +
                        "گیاه پول چینی از جمله گیاهان بومی سرزمین چین است که با گذر زمان و به دلایل گوناگون به کشور ما نیز راه پیدا کرده است. امروزه این گل به دلیل زیبایی و ویژگی های بی نظیری که دارد محبوبیت بسیاری در میان ایرانیان پیدا کرده است. نام گل پول چینی تطابق زیادی به ظاهر آن دارد؛ چرا که برگ های این گیاه کاملا شبیه به سکه های پول در کشور چین هستند. اغلب این گیاه را با نام دیگری تحت عنوان گیاه پپرومیا پیله آ نیز می شناسند. این گیاه را از جمله گیاهان نادر و کمیاب می دانند که معمولا به راحتی پیدا نمی شود.\n" +
                        "\n" +
                        "تفاوت گیاه پول چینی با درخت پول چیست؟\n" +
                        "\n" +
                        "لازم است بدانید گیاه پول چینی هر چند با درخت پول چینی شباهت اسمی زیادی دارد؛ اما نباید این دو را یکی دانست. گیاه پول چینی با گیاه پاچیرا یا همان درخت پول چینی تفاوت های ظاهری و بیولوژیکی فراوانی دارند. به طور مثال از نظر ظاهری پاچیرا دارای برگ های سبز تیره، دراز و کشیده می باشد و ساقه اش بلند، صاف و مرتجع است. اما گیاه پول چینی برگ های گرد و پهن دارد. از نظر بیولوژیکی نیز لازم است بدانید گیاه پول چینی سایه دوست است و فقط هفته ای یک بار به آب نیاز دارد.\n" +
                        "\n" +
                        "گیاه پول چینی برای چه مکان هایی مناسب است؟\n" +
                        "\n" +
                        "با توجه به ویژگی های که گیاه پول چینی دارد، این گیاه در زمره گیاهان آپارتمانی قرار گرفته است. یکی از دلایلی که می توان برای نگهداری این گیاه در محیط های آپارتمانی دانست، آبیاری کم آن می باشد. از طرفی دیگر نیاز نداشتن به نور مستقیم آفتاب دلیل عمده دیگری است که می تواند این گیاه را در زمره گیاهان آپارتمانی کم دردسر قرار دهد. لذا می توان آن را برای زیباتر کردن خانه ها مسکونی، محیط های اداری، مکان های تجاری یا حتی راهروهای موجود در این فضاها و دیگر محیط های آپارتمانی با شرایط مساعد، مناسب دانست.\n"));
        mItem.add(new Item(R.drawable.nakhlasbi,
                "نخل دم اسبی",
                "سه هفته یک بار ",
                "نور مستقیم خورشید ",
                "12 تا 21 ",
                "پرورش و نگهداری گیاه لیندا\n" +
                        "\n"+
                        "   این گیاه به نخل دم اسبی و لیندا مشهور است . بومی جنوب غرب آمریکا و مکزیک است و به زندگی بیابانی عادت دارد. برگ های آن باریک و کشیده و ضخیم و مقاوم ، مجنون و آویزان و فنری است. این برگ ها سطح مقطع کمی دارند تا مانع از هدر رفتن آب گیاه شوند. حالت زیبای آن ناشی از سرازیر شدن برگ ها به طرف پایین بخصوص در سنین بالاست. انتهای ساقه ضخیم می شود و شکل عجیبی به خود می گیرد و نام انگلیسی آن به معنی پای فیل به همین علت است. پایه بسیار بزرگ و ورم کرده گیاه، آب را در خود ذخیره می نماید.\n" +
                        "ارتفاع لیندا ممکن است به دو متر هم برسد. با بالا رفتن سن گیاه از ساقه آن جوانه هایی می روید که به خاطر حفظ شکل و فرم آن باید فوراً حذف گردند. نگهداری از آن برای باغبان های آماتور نیز ساده است. زادگاه آن مکزیک است، برگها باریک و کشیده و ضخیم و مقاوم، مجنون و آویزان و فنری، حالت زیبای آن ناشی از سرازیر دشن برگها به طرف پایین بخصوص در سنین بالا، انتهای ساقه ضخیم و شکل عجیبی به خود می گیرد و نام انگلیسی آن به معنی پای فیل به همین علت است، در زبان عامه به لیندا معروف ات، به خاطرنوع خاص برگها و ساقه آن به عنوان گیاه گلدانی منفرد نگهداری می گردد، با بالا رفتن سن گیاه از ساقه آن جوانه هایی می ریود که به خاطر حفظ شکل و فرم آن باید فوراً حذف گردند. این جنس دارای24 گونه از درختچه ها و درختهای همیشه سبز میباشد.برگهای لیندا مجنون ، آویزان ، باریک ، کشیده ، ضخیم و مقاوم که طولشان تا 1.8 متررسیده و عرضشان کمتر از 2.5 سانتیمتر می باشد. رنگ برگها سبز تا سبز مایل به تیره و حالت زیبای لیندا ناشی از خمش برگها به طرف پایین بخصوص در سنین بالاست.رنگ گلهای آن سفید مایل به کرم است و به ندرت و فقط بر روی گیاهان مسن بخصوص در تابستان ظاهر میشود.\n" +
                        "\n" +
                        "نیازها\n" +
                        "تکثیر :کاشت بذر در خاک پیت در هوای گرم،ریشه دار نمودن جوانه های ظاهر شده روی ساقه\n" +
                        "نور:در جایی از آپارتمان به خوبی رشد می کند که نور مستقیم خورشید به جز ماههای تیر و مرداد روزانه چهار ساعت یا بیشتر در آنجا بتابد. در شرایطی که پرورش آن با نور مصنوعی فراهم شود نباید از حداقل هشتصد شمع و مدت تابش آن از 12 ساعت در روز کمتر باشد. \n" +
                        "رطوبت :در تمام طول سال هفته ای یکبار غبارپاشی کافی است،در مواقعی که درجه حرارت زیر 10 درجه است غبارپاشی نکنید.\n" +
                        "درجه حرارت:درجه حرارت ایده آل بین 18 تا 25 درجه سانتیگراد است. البته درجه حرارت های متغیر بین 5 تا 30 درجه را نیز به خوبی تحمل می کند.\n" +
                        "فصل تعویض گلدان:در صورت نیاز باید قبل از آغاز فعالیت مجدد گیاه در اوایل بهار در محیطی سربسته و بدون کوران انجام گیرد.\n" +
                        "دما :حرارت بالا را دوست دارد اما با حرارت متوسط نیز سازگار است . در دامنه دمایی 12 تا 21 درجه رشد کرده و به سرما حساس است . دمای لازم برای زمستان گذرانی حداقل در حدود 10 درجه سانتیگراد است .\n" +
                        "آبیاری :به دلیل خصوصیات گیاه لیندا برای زیست در شرایط طبیعی خودش ،گیاه لیندا قادر است تا یک سال آب را در ساقه خود ذخیره کند. بهتر است رطوبت خاک پایین باشد و خاک در بین دو آبیاری کاملا خشک شود . در طول فصل رشد بهتر است گیاه هر سه هفته یک بار آبیاری شود و در طول زمستان به نظر میرسد که بار آبیاری برای گیاه کافی است یعنی به اندازه ای که مانع از پژمردگی برگهای گیاه شود . آبیاری بیش از حد به گیاه لیندا متداولترین علت آسیب و نابودی گیاه است .\n" +
                        "اگر روی برگ های لیندا آب ریخته شد سریع برگ ها را خشک کنید و اگر برگ ها را خشک نکردید و بیشترشان پژمرده شد، سعی کنید برگ های پژمرده را از بدنه اش جدا کنید و تا بیرون آمدن جوانه های جدید صبر کنید تا گیاه تان به وضع عادی برگردد در غیر این صورت گیاه تان را از دست داده اید.\n" +
                        "لکه های قرمز را جدی بگیرید\n" +
                        "شاید مهم ترین آفتی که لیندا را تهدید می کند، کنه قرمز باشد. اگر روی برگ های لیندا لکه های قرمز دیدید، با دستمالی این لکه ها را از روی ساقه ها بردارید. اگر سریع متوجه شوید کنه های قرمز دیگر نمی توانند پیشروی کنند.\n" +
                        "\n" +
                        "عوارض و درمان\n" +
                        "برگهای جدید ظاهر نمیشوند و گیاه پژمرده و خسته است:یا نور کافی نیست که گلدان را به محل روشن تری منتقل کنید و یا اینکه تغذیه مصنوعی به تاخیر افتاده است،گیاه را طبق دستور تغذیه کنید.\n" +
                        "برگهای سطوح خارجی زرد شده و یکی پس از دیگری می افتند:ابیاری بیش از اندازه انجام شده است،اجازه دهید سطح خاک گلدان در فاصله بین دو ابیاری خشک شود،زهکش را بازدید کنید،زیر گلدانی فاقد اب باشد\n" +
                        "ساقه منقبض و چروک است:گیاه تشنه است،گلدان را درون تشت پر از اب قرار دهید،ابیاری را تنظیم کنید.\n" +
                        "برگها خشک شده و میریزند:هوا خیلی گرم است،گیاه را به محل خنک تری منتقل کنید،غبارپاشی را فراموش نکنید.\n" +
                        "لکه های سوخته روی برگها مشاهده میشود:عامل ان غبارپاشی در افتاب است،در سایه غبارپاشی کنید\n" +
                        "لکه های قهوه ای در سطح زیرین برگها مشاهده میشود:عامل ان افت است،هر ماه یکبار با سم حشره کش نفوذی طبق دستور سمپاشی کنید تا علائم از بین بروند،لکه ها را میتوانید با پنبه اغشته به محلول سم نیز مسموم کنید.\n" +
                        "زخم های سفید رنگ پنبه ای در هر دو طرف برگ مشاهده میشود:حمله افت باعث ان است،با سم حشره کش نفوذی هر 2 هفته یکبار سمپاشی و یا اینکه با پنبه خیس اغشته به محلول سم لکه ها را مسموم کنید.\n" +
                        "برگها سقوط میکنند:هوا خیلی سرد است،گیاه را به محل گرمتری منتقل کنی.\n" +
                        "برگهای مجنون و اویزان دم اسبی لیندا در صورتی زیبا تر است که گلدان ان در بلندی و یا روی چهارپایه ای قرار گیرد،قاعده ضخیم و گوشتی ساقه زمانی کاملا نمایان است که گیاه به صورت سطحی در گلدان کاشت شود.\n"));
        mItem.add(new Item(R.drawable.sine,
                "گلِ سینه",
                "رطوبت دائمی ",
                "۳۰ تا ۵۰%  ",
                "۱۰ درجۀ ",
                "این گونه از ارکیده که به گلِ سینه نیز معروف است، به خاطر مراقبت آسان، گزینۀ مناسبی برای نگهداری در آپارتمان می باشد.کاتالیا مانند سایر ارکیده های کشت شده، گیاهی هوازی است، به همین دلیل دارای اندام هایی به نام پیاز کاذب برای ذخیره آب می باشد و ریشه هایی بزرگ و گوشتی، پوشیده از لایه اسفنجی و ویلامن نگهدارندۀ آب، دارد. ریشه های این گل معمولاً در فاصله میان هر آب دهی، خشک هستند و باید در محیطی پر منفذ و با زهکشی مناسب کشت شوند.\n" +
                        "\n" +
                        "دارای اندام هایی به نام پیاز کاذب برای ذخیره آب می باشد و ریشه هایی بزرگ و گوشتی، پوشیده از لایه اسفنجی و ولایه نگهدارندۀ آب، دارد. ریشه های این گل معمولاً در فاصله میان هر آب دهی، خشک هستند و باید در محیطی پر منفذ و با زهکشی مناسب کشت شوند . گیاهان این خانواده تک لپه ٬علفی ٬ پایا و گرمسیری هستند. ارکیده ها دارای دو نوع رشد : ساقه ایستاده و ساقه خزنده هستند. گل آذین به صورت خوشه یا سنبله و گلها نامنظم است. هر گل شامل سه گلبرگ و سه کاسبرگ است. برگها دارای شبکه رگیرگی موازی می باشند. و برگها از شکل های مختلف کشیده ، گرد یا بیضی برخوردارند. برگها در بعضی جنس ها ضخیم و چرمی شکل و در برخی نازک هستند.\n" +
                        "\n" +
                        "نور مناسب کاتالیا :\n" +
                        "\n" +
                        "یکی از عوامل مهم کشت و گل دهی کاتالیا چه در خانه و چه در گلخانه، نور است. گیاهان باید در معرض نور درخشان خورشید قرار گیرند، اما منظور ما نور مستقیم ظهر نیست. بدین معنی که در خانه؛ کنار پنجره شرقی، غربی یا جنوبیِ که دارای سایه بان (مانند پرده) باشد و در گل خانه، ۳۰ تا ۵۰ % نور کامل خورشید کافی می باشد. برگ ها باید به رنگ سبز متوسط باشند.\n" +
                        "رطوبت مورد نیاز کاتالیا :\n" +
                        "\n" +
                        "کاتالیا به رطوبت نسبی بین ۵۰ تا ۸۰ درصد نیاز دارد. در خانه هم می توانید این شرایط را فراهم کنید: گیاه را در سینی شن که آن را با آب پر کرده اید، قرار دهید به گونه ای که گیاه بالا تر از آب باشد. اسپری کردن گل در صبح، فقط مناسب مناطق با آب و هوای خشک است. هوا همیشه باید در اطراف گل جریان داشته باشد (به خصوص در مناطق دارای رطوبت زیاد و سرد)، تا از ایجاد قارچ و بیماری های باکتریایی جلوگیری کند. در گلخانه نیز می توان با خیس کردن کف گلخانه رطوبت ایجاد کرد. سرد سازی با تبخیر، هوا را خنک و رطوبت را افزایش می دهد.\n" +
                        " \n" +
                        "آبیاری کاتیا :\n" +
                        "\n" +
                        "آب دهی باید به دو شیوه انجام شود: آب ریختن در گلدان یا ایجاد رطوبت در هوا. آب دهی در گلدان مشروط به رعایت ضوابط خاصی است: اندازه و نوع گلدان، دما، نور و غیره. خاک گل های بالغ کاتالیا باید قبل از آب دهی مجدد، کاملاً خشک باشد. نهال ها به رطوبت دائمی بیشتری نیاز دارند. گلدانی را که در آن گل کاشته اید، وزن کنید و گلدان خالی هم اندازۀ آن را هم وزن کرده و وزن آن ها را مقایسه نمائید تا ببینید آیا گیاه شما نیاز به آب دارد یا خیر. مداد تیزی را در خاک فرو کنید، اگر به راحتی داخل آن رفت، می تواند نشانۀ مرطوب بودن خاک باشد. اگر مطمئن نیستید، بهترین کار این است که یک یا دو روز تا زمان آب دهی صبر کنید. گیاهانی که دارای رشد فعالی هستند، بیشتر از گیاهانی که در حال استراحت هستند، نیاز به آب دارند. آب زیر ۱۰ درجۀ سانتی گراد ممکن است به گیاه آسیب رسانده و خاک را نرم کند.\n" +
                        "تکثیر کاتالیا :\n" +
                        "\n" +
                        "این گیاه بیشتر به بوسیله تقسیم بوته افزوده می شود. در روش افزایش بوسیله بذر ۴ـ۸ سال به درازا می کشد که به گل بنشیند ٬ امروزه برای افزایش این گیاه ٬ از کاشت مریستم در سیستم های ریز افزایی استفاده فراوان می شود .ارکیده ها تعداد بسیار زیادی بذر تولید کرده که بذر آنها فاقد هر گونه آندوسپرمی می با شد از این رو در طبیعت برای سبز شدن نیاز به همکاری قارچ ها دارند.\n" +
                        " \n" +
                        "کود مورد نیاز کاتالیا :\n" +
                        "\n" +
                        "کود دهی باید به طور منظم انجام شود و می بایست از کودِ دارای نسبتِ بالای نیتروژن یا نسبت مشابه آن (از پوست صنوبر) استفاده شود. گهگاه از کودِ دارای فسفر زیاد یا تقویت کنندۀ گل دهی استفاده کنید تا جوانه هایی قوی و گل هایی سالم داشته باشید. گیاهان دارای رشد فعال، هر دو هفته یک بار به کود نیاز دارند، در غیر این صورت یک بار در ماه این کار را انجام دهید. در هر بار آب دهی می توانید کود را از یک چهارمِ محلول توصیه شده بریزید. هر ماه یک بار با فشار به گل آب بدهید تا از جمع شدن نمک های کود جلوگیری کنید.\n" +
                        "تعویض گلدان کاتالیا :\n" +
                        "\n" +
                        "گل های بالغ کاتالیا معمولا در گلدان متوسط و نهال آن در گلدان کوچک، پرورش داده می شوند. زمانی که گل دارای ۶ پیاز کاذب و بالغ شد، باید در یک گلدان بزرگ تر قرار داده شده و تقسیم نیز نشود. در صورت تقسیم گیاه هر قسمت باید دارای ۳ تا ۵ پیاز باشد. گلدانی را انتخاب کنید که ۲ تا ۳ سال برای رشد آنجا داشته باشد. مخروطی از خاک را ته گلدان قرار دهید، ریشه های فرسوده را ببرید و ریشه های محکم و شاداب را روی این مخروط پخش کنید. تقریباً تا اواسط گلدان را با خاک پر کنید و سپس اطراف ریشه ها را با خاک پر کنید، خاک را محکم فشار دهید و در صورت نیاز یک چوب در آن قرار دهید. برای مدتی گیاه را مرطوب، در سایه و با ریشۀ خشک نگه دارید تا ریشه های جدید برویند. محلول ویتامین B۱ می تواند به رویش ریشه های تازه کمک کند.\n"));
        mItem.add(new Item(R.drawable.ficus,
                "گل فیکوس ",
                "متوسط ",
                "در سایه آفتاب ",
                "13 تا 29 درجه ",
                "خواص بتانیکی گل فیکوس :\n" +
                        "نوع: این گیاه، دارای گونه های مختلف از قبیل برگ پهن، برگ ریز و غیره می باشد در سایه آفتاب از رشد بهتری برخوردار است\n" +
                        "و به روشنایی نسبی نیاز دارد.\n" +
                        "ساقه: ساقه ها خشبی، نیمه خشبی و مفتولی رونده می باشند. دارای شیرابه مخصوص هستند که در نتیجه زخمی شدن ساقه از آن ها جاری می شود.\n" +
                        "برگ: برگ های فیکوس ها، همیشه سبز هستند و به اشکال درختی، درختچه و بالا رونده دیده می شوند.\n" +
                        "درجه حرارت لازم برای گل فیکوس :\n" +
                        "فیکوس ها در گرمای معتدل به خوبی رشد و نمو می کنند و دمای مطلوب آن ها بین 13 تا 29 درجه ی سانتی گراد است.\n" +
                        "نور مناسب برای رشد فیکوس :\n" +
                        "در نور متوسط تا زیاد، به خوبی رشد و نمو می کنن\n" +
                        "به طوری که این گیاهان در جنگل ها، در سایه ی درختان دیگر به خوبی رشد و نمو می کنند. در منازل هم، نور کم و حرارت متغیر اتاق ها را تحمل می نمایند. البته بهتر است برای انواع درختی، محل پر نور ساختمان و برای سایر انواع، محل سایه را انتخاب کنید.\n" +
                        "رطوبت هوا :\n" +
                        "فیکوس ها به رطوبت نسبی 25 تا 50 درصد نیاز دارند به همین دلیل بهتر است هرچند وقت یک بار،سطح برگ ها را با اسفنج مرطوب پاک نمایید تا ضمن تمیز و براق نمودن برگ ها که جلوه خاصی به زیبایی گیاه می بخشد\n" +
                        "رطوبت نسبی مورد نیاز آن ها نیز تامین گردد. در ارقام برگ ریز نیز می توانید با اسپری کردن آب بر روی برگ ها، مخصوصا در فصول گرم سال، نیاز رطوبتی آن ها را تامین کنید.\n" +
                        "آبیاری گل فیکوس :\n" +
                        "نیاز آبی فیکوس متوسط است به طوری که در فاصله ی بین دو آبیاری باید سطح خاک گلدان خشک گردد.\n" +
                        "ضمنا نسبت به زیادی و سردی آب حساس است و رعایت نکردن این نکته، باعث ریزش برگ ها می شود.\n" +
                        "توجه: در آبیاری فیکوس ها هرگز آن ها را غرقاب نکنید.\n" +
                        "\n" +
                        "خاک مناسب برای فیکوس :\n" +
                        "-فیکوس ها در خاک غنی از مواد آلی و کود پوسیده ی دامی سریعا رشد و نمو می کنند.\n" +
                        "-برای تهیه خاک مناسب باید ترکیب خاک شامل یک سوم خاک باغچه + یک سوم خاک برگ پوسیده + یک سوم کود پوسیده دامی می باشد.\n" +
                        "-هر دو سال یک مرتبه ، در فصل بهار ، خاک گلدان را عوض نمایید. پس از این که گیاه تنومند شد نیازی به تعویض گلدان نخواهد داشت فقط هرچند ماه یک مرتبه خاک سطحی گلدان را سیخک زده، با کود شیمیایی کامل آن را تقویت کنید.\n" +
                        "کود مناسب برای فیکوس \n" +
                        "-خاک گلدان فیکوس باید از نظر مواد آلی و معدنی غنی باشد.\n" +
                        "-کوددهی به صورت محلول پاشی از طریق به کار بردن یک کود کامل و کود های میکرو فقط در زمان رشد و نمو فیکوس ها توصیه می شود.\n" +
                        "-در صورتی که به دلیل درجه حرارت محیط یا هر عامل دیگر، رشد فیکوس ها متوقف شودکودپاشی خصوصا با غلظت زیاد باعث سوختگی برگ های جدید می گردد.\n"));
        mItem.add(new Item(R.drawable.filonderond,
                "فیلودندرون",
                "وسط آبیاری بایدخشک بشه ",
                "نور ملایم ",
                "۱۲ درجه ",
                "فیلودندرون جز اون دسته ای گلهاییه که من حتما برای خونم خودم میخرم ،مخصوصا اتاق پذیرایی، با اون برگها مینیاتوری و زیباش جلوه ی خاصی به اتاق میده ، نگهداریشمکه راحته و درکل یه گلیه که کسی هرجایی نمیبینه ! برخلاف بقیه هم خونواده هاش نیازی به قیم نداره ، گیاهی است از خانواده آراسه و زادگاه ان امریکای جنوبی است،برگها سبز براق است که با بزرگتر شدن شکافها و دندانه های برگ عمیق تر و شکل برگ انجیر به خود میگیرد.ریشه های هوایی ان منحصر به ریشه های نزدیکی قاعده ی برگهاست که باید به طرف خاک گلدان هدایت گردد.همانطوری که از نام انگلیسی ان بر می اید و فیلودندرون را راست قامت نهاده اند احتیاج به قیم ندارد و برگها از مرکز می رویند،هوای گرم و مرطوب از شرایط ایده ال ان است و بعلت گستردیگی بوته و برگها باید دور از محل پر رفت و امد باشد،نگهداری فیلودندرون ها ساده و گیاهی مناسب برای مبتدیان است.\n" +
                        "\n" +
                        "نیازها: \n" +
                        "نور: کنار پنجره با نور ملایم بهترین مکان برای این گیاه است،اشعه ی مستقیم آفتاب مخصوصا در ظهر به برگهای گیاه صدمه می زند\n" +
                        "دما: حداقل درجه حرارت در زمستان ۱۲ درجه و حداکثر ان در تابستان ۲۴ درجه توصیه می گردد.در درجه حرارت بالاتر غبارپاشی الزامی است.\n" +
                        "آبیاری: بین دو آبیاری باید خاکش خشک بشه !\n" +
                        "رطوبت: یک جزیره زیرش درست کنید تا همیشه بخار آب دور برگاشو بگیره و رطوبت پایدار داشته باشید توی زمستون هم ظرف اب روی شوفاژ یا بخاری قرار بدید\n" +
                        "تغذیه :هر دو هفته یکبار جهت تامین مواد غذایی گیاه از کود شیمیایی گرین ایتالیا در لینک زیر مطلب  مخصوص گیاهان زینتی استفاده کنید.\n" +
                        "خاک مناسب :خاک  کمپوست یا خاک هلندی بهترین محیط برای رشد ریشه است.\n" +
                        "تعویض گلدان: با شروع فصل رشد در هر سال زمان تعویض گلدان فرا میرسد.در صورت سنگین بودن گلدان به تعویض خاکهای سطحی با خاک نو و غنی اکتفا کنید.بهتراست اجازه دهید ریشه از زیر گلدان بیرون بزند بعد تعویض کنید.\n" +
                        "تکثیر: ازدیاد این گل در منزل کار اسانی نیست،حرفه ای ها از بذر و قلمه استفاده میکنند\n" +
                        "عوارض و درمان:\n" +
                        "برگها میریزند:هوا خیلی گرم و خشک است،آبیاری را بیشتر کنید،گلدان را به محل خنک تر منتقل کنید.\n" +
                        "برگها زرد میشوند و میریزند:ابیاری زیاده از حد است،سوراخ ته گلدان را بازدید کنید،در صورت باتلاقی شدن گلدان با یک میله آهنی به ملایمت خاک و ریگ انتهای گلدان را بحرکت دراورید.در زمستان فاصله ابیاری را کمتر کنید.\n" +
                        "برگ های جدید یا ظاهر نمیشوند یا خیلی کوچک هستند:به گلدان بزرگتر احتیاج دارد،در صورت عدم امکان تعویض تغذیه مصنوعی توصیه می شود.\n" +
                        "\n" +
                        "ساقه ها دراز و ضعیف هستند:نور کم است،گلدان را به محل روشن تر با اشعه ی غیرمتسقیم افتاب منتقل دهید.\n" +
                        "سبزینه ها در برگ ها کم شده اند و سطح زیرین انها مملو از تار عنکبوت است:حمله کنه قرمز میکروسکوپی باعث این عارضه است،با سم کنه کش طبق دستور هر دو هفته یکبار سمپاشی کنید.\n" +
                        "لکه های سوخته روی برگها مشاهده میشود:اشعه ی مستقیم افتاب یا غبارپاشی در افتاب باعث ان است،گلدان را به نیم سایه منتقل کنید،و از غبارپاشی در افتاب بپرهیزید.\n" +
                        "برگها رنگ پریده و کم رشد شده اند:هوا سرد است،گلدان را به محل گرمتری انتقال دهید\n" +
                        "تمیز نمودن برگها:با دست چپ برگها را نگهداشته و با دست راست و با اسفنج  و یا پا پارچه ی مرطوب برگها را تمیز نمایید.در صورت لزوم فقط هر ماه یکبار  از مواد براق کننده ی شیمیایی استفاده کنید.\n" +
                        "فروشندگان گل و گیاه برای جلب نظر مشتری برگ ها را با مواد براق کننده تمیز میکنند،روزنه های موجود در سطح برگها که برای اعمال حیاتی گیاه باید باز باشند،با اینگونه مواد مسدود میشود،غبارپاشی برای تمیز کردن برگها کافی است.\n"));
    }
    @Override
    public void onAttach(@NonNull Context context) {
        super.onAttach(CalligraphyContextWrapper.wrap(context));
    }


}
