package com.example.golkhune.model;

import com.example.golkhune.Item;
import com.example.golkhune.R;
import java.util.ArrayList;

public class FlowersSearch {
    ArrayList<Item> arrayList ;

    public ArrayList setList(){
        arrayList = new ArrayList<>();
        arrayList.add(new Item("فیلم آموزشی"));
        arrayList.add(new Item("روش از بین بردن آفت گیاهان"));
        arrayList.add(new Item("روش تعویض خاک گلدان"));
        arrayList.add(new Item("از بین بردن علف هرز"));
        arrayList.add(new Item("زرد شدن برگ درخت ها"));
        arrayList.add(new Item("آب دادن به گل و گیاه"));
        arrayList.add(new Item(R.drawable.bambo,"بامبو",
                "هر 14 روز یک بار",
                "نور غیر مستقیم ",
                " 18 تا 22 درجه",
                "گیاه بامبو را نباید در معرض نور مستقیم خورشید قرار داد بامبو از گیاهان سازگار با شرایط مختلف است اما بهتر است برای حفظ شادابی آن شرایطش را محیا کنید.\n" +
                        "روش نگهداری و مراقبت از گیاه بامبو\n" +
                        "بامبولاکی از گیاهانی است که این روزها طرفداران زیادی را به علت سهولت پرورش و نگهداری آن پیدا کرده است . این گیاه به نام های دراسینای روبانی و گیاه نواری یا روبانی و یا خیزران خوش قدم، خوش یمن مشهور است.\n" +
                        "لاکی بامبو به دلیل شباهتش به خیزران به این نام مشهور شده است اما در واقع بامبو نیست و نام اصلی آن «دراسینا» و نام خانوادگی اش «ساندریانا» و از خانواده Liliacea می باشد که بومی کمرون بوده و در مناطق استوایی غرب آفریقا نیز می روید.\n" +
                        "اگر مراقب از این گیاه به درستی انجام شود ممکن است ارتفاعش تا حدود یک متر نیز برسد و چندین سال عمرکند. شما ممکن است که گیاه بامبو را بعنوان یک هدیه دریافت کرده باشید، یا خودتان خریده باشید.\n" +
                        "\n" +
                        "خرید و نگهداری بامبو لاکی\n" +
                        "1.گیاهی را بخرید که ساقه و برگ های آن سالم و شاداب باشند و سبزینه آن کمرنگ نشده باشدو از خرید گیاهانی که سبزینه فاصله دو بند یا دو گره از ساقه گیاه از سبزی به سفیدی گراییده باشد، اجتناب کنید.\n" +
                        "2.باید بدانید بوی بد گیاه دلیلی بر بیماری آن است بنابراین اگر بوی بدی از گیاه به مشام تان رسید، آن را نخرید.\n" +
                        "3.گیاهی را که انتهای بریده شده ساقه آن داخل آب قهوه ای رنگ شده باشد ، نخرید.\n" +
                        "4.حتما گیاهی را خریداری کنید که ریشه داشته باشد و از خریدن گیاه بدون ریشه در فصل های پاییز و زمستان اجتناب کنید.\n" +
                        "\n" +
                        "5. به انتهای بریده شده ساقه ای که در آب قرار می گیرد زمان تعویض آب و شست وشو ساقه ها، با دقت بنگرید و در صورتی که رنگ قهوه ای به خود گرفته بود ، آن قسمت را به وسیله ای جسمی تیز به صورت مورب ببرید، زیرا رنگ قهوه ای نشانه مسدود شدن آوندهای گیاه توسط املاح آب و مرگ گیاه است.\n" +
                        "6. گیاه را هرگز در جایی که نور مستقیم خورشید بدان می تابد نگذارید بلکه در محلی روشن، نزدیک پنجره قرار دهید حتی می توانید این گیاه را در جایی که پنجره ای ندارد قرار دهید، به این شرط که هفته ای یک روز نور غیر مستقیم بگیرد.\n" +
                        "7. چنانچه جوانه تنهایی سرساقه گیاه، یعنی بالای قسمت حلقوی گیاه از ده بند یا گره بلندتر شده است، باید پنج بند آن را بریده و برای تکثیر از آن استفاده کرد. چنانچه این پنج گره حذف نشوند، ممکن است قسمت حلقوی گیاه به تدریج باز و صاف و شق و رق گردیده و از زیبایی آن کاسته شود.\n" +
                        "گیاه بامبو را در چه گلدانی باید قرار دهید؟\n" +
                        "گیاه بامبو را در گلدانی که دهانه آن حدود 5 سانتیمتر گشادتر از قطر مجموع ساقه ها باشد قرار دهید و گلدان را با آب بدون کلر پر کنید و با دانه های لیکا (پوکه صنعتی) اطراف ساقه ها را طوری بپوشانید تا در درون گلدان به صورت شکیل بایستد. شما می توانید از دانه های لیکا به عنوان سطح اتکا و حایل برای بالا و پایین نگه داشتن ساقه ها استفاده کنید.\n" +
                        "\n" +
                        "دانه های لیکا به علت پخته شدن در دمای بالا، از هرنوع آفت و بیماری به دور هستند و رطوبت را به دلیل متخلل بودن در خود نگه می دارند و در صورت رفتن به مسافرت و فراموش نمودن آبیاری به خاطر داشتن خلل و فرج، آب را به اندازه کافی در خود ذخیر کرده و رطوبت لازم را به گیاه می رساند.\n" +
                        "نحوه مراقبت از گیاه بامبو:\n" +
                        "چگونه از گیاه بامبو خود مراقبت کنید؟\n" +
                        "این یک گیاه خانگی است، آن را دور از نور مستقیم خورشید قرار دهید. مطمئن شوید که سطح آب بالاتر از ریشه این گیاه قرار میگیرد حداقل یک اینچ بالاتر از ریشه)ساده است که این دو قاعده را دنبال کنید و گیاهتان را به مدت زمان طولانی نگه دارید.\n" +
                        "نور گیاه بامبو :\n" +
                        "گیاه بامبو میتواند با سطح متوسط نور غیر مستقیم به بهترین نحو رشد کند.مانند قرار دادن در کنار یک پنجره ای که نور میتابد.نور مستقیم برای گیاه بیش از حد قوی است و باعث میشود که رنگ برگ های آن ، قهوه ای شود.گیاه بامبو را باید همیشه در خانه نگه دارید. نور مستقیم آفتاب برای این گیاه زیان آور است.\n" +
                        "\n" +
                        "آب گیاه بامبو :\n" +
                        "پیشنهاد ما به شما این است که از آب معدنی یا آب تصفیه شده استفاده کنید. زیرا آب شیرین حاوی کلر است که باعث میشود کگه نوک برگ های گیاه قهوه ای شود.اگر تنها راه شما استفاده از آب شیر است، می توانید آن را در یک ظرفی به مدت 24 ساعت نگه دارید و بعد به گیاه بدهید.برای جلوگیری از خشک شدن ریشه ها باید همیشه سطح آب حداقل یک سانت بالاتر از ریشه باشد.\n" +
                        "گیاه را درون آب غوطه ور نکنید .استفاده از آب شور و آبی که کلسیم و منیزیم اضافی دارد، در روند رشد این گیاه اختلالاتی مانند ایجاد رنگ زرد و قهوه ای در لبه برگ ها به وجود می آورد.\n" +
                        "\n" +
                        "آب را هر 14 روز یک بار تغییر دهید تا از پوسیدگی ریشه ها جلوگیری شود. در پاسخ به سوال شما کاربران نمناکی برای جلوگیری از بو گرفتن آب، حداقل ماهی یک بار آن را تعویض کنید و دانه های لیکا و ساقه گیاه را هنگام تعویض آب گلدان با آب و کف صابون بدون اسانس ، بشویید. این کار را در محیطی سربسته، که هوا در آن جریان نداشته باشد، انجام دهید زیرا ریشه ها نباید در معرض هوای آزاد قرار گیرند.\n" +
                        "\n" +
                        "خاک مناسب گیاه بامبو :\n" +
                        "بهترین خاک برای کاشت این گیاه نسبت مساوی از خاک برگ مرغوب یا پیت موس، خاک باغچه، دانه های ریز لیکا یا پرلیت، و مقداری پودر قارچ کش ترکیب شده باشد تا زهکشی به خوبی انجام گیرد و از گزند قارچ گرفتگی نیز در امان بماند. به شرط آنکه ترکیب خاک مناسب و دارای مواد مغذی کافی باشد گیاه کاشته شده در درون خاک نیازی به کود ندارد.\n" +
                        "\n" +
                        "تغذیه گیاه بامبو :\n" +
                        "فقط از مواد غذایی یا کود های گیاهی استفاده کنید و از کودهای ارگانیک یا کود مخصوص این گیاه تنها زمانی استفاده کنید که گیاه تازه آغاز به زرد شدن کرده باشد زیرا کودهای ترکیبی حاوی مقدار زیادی نمک و فسفر هستند که سبب سوختن برگ ها خواهند شد.\n" +
                        "\n" +
                        "باید بدانید زیان کود زیاد بیش از کود ندادن است. بامبو نیازی به مواد مغذی و کود ندارد. میتواند سالها با آب تمیز زنده بماند.برخی غذا های سوپر سبز برای گیاه بامبو ساخته شده است.\n"));
        arrayList.add(new Item(R.drawable.bonsai,"بن سای ",
                "رطوبت نیاز ",
                "نور زیاد",
                "دوراز گرمای مستقیم",
                "درخت بن سای چیست ؟\n" +
                        "\n"+
                        "درخت بن سای درخت کوچکی است که در یک ظرف کشت می شود. در واقع کلمه \"بن سای\" در ژاپنی به معنای \" کاشته شده در ظرف\" است. بن سای به هنر کشت این درختان کوچک اشاره می کند و بخش جدایی ناپذیر فرهنگ ژاپنی است که به اوایل قرن 14 ام باز می گردد.\n" +
                        "\n" +
                        "زمانی که تنها ثروتمندترین اشراف زاده ها و اعضای عالیرتبه جامعه ژاپن می توانستند از این درختان لذت ببرند, اما اکنون نوعی هنر است که مردم سراسر جهان از آن لذت می برند.اولین بار دیدن بن سای چیز معمولی نیست.\n" +
                        "\n" +
                        "سناریوی معمول به این شکل است:شما یک بن سای را به عنوان هدیه ای برای کریسمس یا برای روز تولدتان می گیرید. آن را دوست دارید و می خواهید آن را خوب نگه دارید تا خوب رشد کند.\n" +
                        "با این حال، علی رغم بهترین تلاش ها، زرد می شود و یا برگ هایش شروع به ریزش می کنند و زودی می میرد.\n" +
                        "\n" +
                        "مراقبت از درخت بن سای:\n" +
                        "مراقبت از درخت بن سای ممکن است ابتدا سخت و ترسناک باشد. در اینجا چند نکته برای نشان دادن اینکه چطور از این درخت می توانید مراقبت کنید، وجود دارد. همچنین یک راهنمای مفید برای راهنمایی سریع برای ارجاع آسان ایجاد کردیم.\n" +
                        "نحوه قرار دادن درخت بن سای:\n" +
                        "برای تعیین بهترین مکان برای نمایش بن سای هایتان باید بدانید چه نوع درختی دارید و بایدها و نبایدهایش چیست. اکثر گونه های بن سای درخت هایی مانند سرو کوهی, کاج و صنوبر در فضای هستند که باید در معرض فصول مشابه با همتایان بزرگ تر خود قرار گیرند.\n" +
                        "بن سای های فضای باز هم شامل درختان برگریز هستند, به این معنی که برگ ها با فصل ها تغییر می کنند اینها عبارتند از افرا, نارون و چهل سکه. روی لبه پنجره آشپزخانه و یا روی میز قهوه آنها را قرار ندهید، بله، بن سای یک درخت است و درختان گیاهانی برای فضای باز هستند.\n" +
                        "مگر اینکه بن سای شما سریسا یا انجیر باشد، آن ها را هم، تا جایی که ممکن است بیرون نگه دارید. چند گونه دیگر برای بن سای وجود دارد که داخل خانه را تحمل خواهند کرد، اما هیچ یک از آن ها واقعاً در داخل خانه رشد نمی کنند و همه آن ها مشکلاتی را در آنجا خواهند داشت. بیشتر آن ها می میرند.\n" +
                        "\n" +
                        "موقعیت یابی:\n" +
                        "بن سای شما باید از گرمای مستقیم دور نگه داشته شود.\n" +
                        "نورپردازی:\n" +
                        "بن سای خود را در محلی قرار دهید که نور زیادی داشته باشد.\n" +
                        "رطوبت:\n" +
                        "بن سای به رطوبت نیاز دارد تا خاکش را مرطوب نگه دارد.\n" +
                        "یکی از دلایل مرگ بیشتر درختان، کم آب دادن است. چون لایه خاک بسیار کم عمق است و مستعد خشک شدن بسیار سریع است. درختان بن سای وقتی که لایه بالایی خاکشان خشک می شود, باید آبیاری شوند.\n" +
                        "برای اطمینان از اینکه به درستی آبیاری خود را آبیاری می کنید, باید هر روز درخت نب سای خود را ارزیابی کنید. قاعده انگشت شست به محض خشک شدن خاک, آب است.\n" +
                        "\n" +
                        "انتخاب خاک مناسب برای بن سای:\n" +
                        "کلید انتخاب خاک مناسب, انتخاب گزینه مناسب برای زه کشی مناسب است. ذرات درشت را به مخلوط خاک اضافه کنید, مانند سنگ آتشفشانی یا سنگ, برای بهبود زه کشی و ورود هوا به خاک است. مخلوط خاک ایده آل باید قادر به نگهداری آب باشد که با افزودن رس بهبود یابد.\n"));
        arrayList.add(new Item(R.drawable.aluevera,
                "آلوئه ورا",
                "12 یا 14 روز یک بار ",
                "نور زیاد خورشید",
                "17 تا 24 درجه ",
                "یکی از گیاهان رایجی که در آپارتمان و منزل نگهداری می شود آلوئه ورا می باشد که علاوه بر زیبایی بخشیدن به خانه ، خواص درمانی فراوانی نیز دارد . بسیاری از افراد که گیاه آلوئه ورا را در منزل نگهداری می کنند ، به جز بهره بردن از زیبایی این گیاه بی درد سر و ساده از برگ های آن برای زیبایی پوست خود استفاده می کنند.\n" +
                        "\n"+
                        "اگر شما نیز علاقمند به نگهداری از این گیاه هستید اما روش نگهداری از آن را نمی دانید با این بخش از خانه داری نمناک همراه شوید تا درباره پرورش این گیاه اطلاعات بیشتری کسب کنید.\n" +
                        "\n" +
                        "طریقه نگهداری و پرورش گیاه آلوئه ورا\n" +
                        "\n" +
                        "آلوئه ورا گیاهی شبیه کاکتوس می باشد که با نام های صبر زرد و در هندوستان به نام «آیورودا» شناخته می شود و شرایط نگهداری و پرورش آن بسیار آسان است . این گیاه به پای ثابت سالن پذیرایی، تراس یا گلخانه های خانگی تبدیل شده است و خواص درمانی زیادی دارد و به صورت خوراکی و موضعی مصرف می شود.\n" +
                        "\n" +
                        "دمای مناسب نگهداری آلوئه ورا\n" +
                        "آلوئه ورا گیاهی است که بیشتر در مناطق گرمسیری و خشک پرورش می یابد . این گیاه به دمایی بین 17 تا 24 درجه سانتی گراد نیاز دارد و در گرما و سرمای شدید آسیب می بیند. اگر دوست دارید در خانه آلوئه ورا نگهداری کنید بهتر است به دمای نگهداری آن توجه نمایید و اگر منطقه زندگی شما روزهای گرم و شب های سردی دارد از پرورش این گیاه صرفه نظر کنید . بهتر در برخی از ساعات روز این گیاه را بیرون از خانه ببرید تا نور خورشید را مستقیما دریافت کند.\n" +
                        "\n" +
                        "آبیاری گیاه آلوئه ورا\n" +
                        "\n" +
                        "گیاه آلوئه ورا را 12 یا 14 روز یک بار زمانی که خاک این گیاه کاملا خشک شد آبیاری کنید زیرا آبیاری زیاد گیاه سبب خراب شدن گیاه می شود . مقدار آب دهی به این گیاه باید طوری باشد که آب از زهکش گلدان خارج نشود و اگر آب در زیر گلدانی جمع شد سریع آن را تخلیه کنید زیرا آب اضافه سبب فاسد شدن ریشه می شود.این گیاه در زمستان به آب کمتری احتیاج دارد و به خواب می رود وبهتر است مقدار آبیاری آن در زمستان ماهی یک دفعه باشد.\n" +
                        "\n" +
                        "از چه کودی استفاده کنیم؟\n" +
                        "کوددهی به آلوئه ورا\n" +
                        "از کود رقیق (آبکی) و یا از نوع نیمه قوی(10-40-10) برای پرورش آلوئه ورا استفاده کنید.چنانچه، خاک ،حاصلخیز نیست،باید کود نیمه قوی را در هر ماه یکبار از ابتدای فصل بهار تا آخر تابستان،به گیاه داد.کودهای ارگانیک و یا کودهای گرم را برای گیاهان کاشته شده در محیط بیرون،می توان استفاده کرد.\n" +
                        "\n" +
                        "تعویض گلدان\n" +
                        "بهترین خاک برای پرورش آلوئه ورا ترکیبی از ماسه یا پولیت 40 درصد با خاک برگ است که باید درون یک گلدان سفالی بریزیم و گیاه را در آن بکاریم . برای انتخاب گلدان باید به سایز گیاه توجه کنید و از انتخاب گلدان کوچک بپرهیزید .\n" +
                        "\n" +
                        "بعد از گذشت یک سال از کاشت آلوئه ورا گلدان را تعویض نمایید زیرا ریشه های آن به حد کافی رشد کرده اند. بهتر است هر 6 ماه یکبار نیز خاک گلدان را عوض کنید و دقت داشته باشید هنگام تعویض خاک زهکشی های گلدان را مسدود نکنید زیرا وجود زهکشی مانع از فساد ریشه گیاه می شود.\n" +
                        "\n" +
                        "تکثیر گیاه آلوئه ورا\n" +
                        "راه های مختلفی برای تکثیر آلوئه ورا وجود دارد اما ساده ترین راه تکثیر آلوئه ورا در خانه استفاده از پاجوش هاست . پاجوش ها یا جوانه ها در قاعده گیاه هر 6 ماه یک بار رشد می کنند . \n" +
                        "برای تکثیر گیاه آلوئه ورا روش های مختلفی وجود دارد که یکی از آنها استفاده از پاجوش هاست. آلوئه ورا هر 6 ماه یک بار پاجوش ها یا جوانه هایی می زند که درست در قاعده گیاه رشد می کند. این جوانه ها بهترین و ساده ترین روش خانگی برای تکثیر آلوئه وراست.\n" +
                        "خیلی آرام و به آهستگی این جوانه ها را با ریشه از گیاه جدا کنید و آنها را در یک گلدان جداگانه بکارید پس از گذشت دو تا سه هفته خواهید دید ریشه های گیاه رشد می کنند و یک آلوئه ورا را به وجود می آورند.\n"));
        arrayList.add(new Item(R.drawable.marjan,
                "مرجان بومی ",
                "۱۰ روز یکبار",
                "نور زیاد غیر مستقیم",
                "دمایی ۱۶ الی ۲۴ درجه ",
                "مرجان بومی منطقه همیشه در صحنه ی *ماداگاسکار* میباشد این منطقه از نظر فلور گیاهی منطقه ی بسیار قدرتمندی است و دارای گونه های خیلی خاصی است این گیاه مثل بنت القنسول از گیاهان گلدار این خانواده ی صمیمی است البته با تیغ های فراوان و با شاخه های منشعب و برگ هایی شبیه به برگ زرشک و گل هایی قرمز رنگ که یکی از زیباترین بخش های  این گیاهان است.در این گیاه،قسمت قرمز رنگ در واقع دوبراکته کلیوی شکل است که در زیر گلها ظاهر میشود.در تمام طول سال ممکن است گل بدهد ولی اغلب در زمستان به گل میرود.این گیاه نیمه گوشتی است که در قسمت زیرین چوبی شده است.به دلیل شیر زیاد و سفیدی که از ساقه تراوش می شود اصطلاحا به آن شیر سگ میگویند\n" +
                        "\n" +
                        "نور: به نور زیاد غیر مستقیم  احتیاج دارد  اگه نور مستقیم یا شدید باشه برگ ها زرد میشن ! داخل منزل پنجره ی روبه قبله یاهمان جنوبی  پشت پرده سفید مکان مناسبی برای نگهداری آن است. البته داخل منزل باید حتما تهویه داشته باشه اگه تهویه نداشته باشه گل نمیده ! مثلا اتاق پذیرایی بزرگ یا پنجره اشپزخونه خوبه براش ولی درکل راه پله روشن از همه بهتره. \n" +
                        "\n" +
                        "آبیاری: بین دو آبیاری حتما باید خاک خشک شده باشد بر عکس کاکتوس ها این گیاهان سوخت و ساز زیادی دارندو باید هر ۱۰ روز یکبار آبیاری شود البته جای نگرانی نیست اگر روزی فراموش کردید آبیاری کنید چون گیاه مقاومی است\n" +
                        "\n" +
                        "رطوبت: به خاطر نوع متابولیسم و تکامل خود به کمبود رطوبت مقاوم هستند ولی خب جای مرطوب برای آنها یک امتیاز محسوب میشود مثل شمال ایران که بسیار خوب رشد میکنند!! سعی کنید روی بوته اب ریخته نشه چون اصلا جنبه نداره و یهو قارچ میزنه روی برگ ها !\n" +
                        "\n" +
                        "افزایش:بسته به گونه،با بذر،قلمه و تقسیم بوته افزایش می یابد.در استفاده از قلمه برای جلوگیری از ترشح شیره در انتهای برش خورده،باید انتهای آنرا در خاک ذغال و یا آب گرم فرو برد . پس از آن در محیط کشت قرار داد.یا اینکه بعد از برش بذارید جایی تاریک مثه کمد یکی دور روز بمونه بعد بیارید بزنید توی ماسه ، و تا یک روز بهش آب ندید بعد ابش بدید. \n" +
                        "\n" +
                        "دما:بهترین رنج دمایی ۱۶ الی ۲۴ درجه میباشداین دما یعنی هوای معمولی داخل اتاق یعنی نباید جایش گرم باشد هوای گرم تابستان باعث زرد شدن برگ میشه دما بالای ۳۰ درجه بره باید ابیاری هم بیشتر بشه وگرنه زرد میکنه ولی هوای گرم برای گلدهیش خوب نیست و بهترین گلدهی رو توی هوای خنک داره !\n" +
                        "\n" +
                        "خاک : بهترین ترکیب ترکیب خاک کاکتوس یعنی ۳ قسمت ماسه ۲ قسمت خاک برگ و ۲ قسمت خاک باغچه است تا آب را از خود رد کند و خدای نکرده باعث پوسیدگی نشود موقع کاشت توصیه میشه با قارچکش کاربندازیم که سیستمیک و مناسب ضدعفونی خاک هست خاک رو ابیاری کنید تا جلوی پوسیدگی های بعدی گرفته بشه !\n" +
                        "\n" +
                        "هرس: برگ های زرد و خشک شده را بچینید اگر گیاه شما خیلی بلند شده میتوانید ساقه ی آن را از بالا بچینید و قلمه بزنید و ساقه قبلی هم از کنار جوانه میزند و گیاه گرد خواهد شد هرس شاخه های مختلف باعث گرد و پرگل تر شدن گیاه میشه.\n" +
                        "\n" +
                        "تغذیه: از بهار تا آخر پاییز دوهفته یبار یکبار با کود آهن و کودهای گرین آپارتمانی تغذیه کنید گیاه خودتون رو.  همینطور که گفتم این گل عاشق آهنه و دوهفته یبار بهش آهن بدید. داخل اتاقی که تهویه نداره گیاه ساقه هاش نازک میشن چون خوب کلسیم جذب نمیشه و خوب ریشه ها رشد نمیکنن !\n" +
                        "\n" +
                        "گلدهی : این گیاه روز کوتاه اختیاری است یعنی اگر شرایط مهیا باشد در طول سال گل میدهد ولی در نمیه دوم سال گلدهی بیشتر است تغذیه با آهن هم باعث افزایش گلدهی در گیاه خواهد شد  !\n" +
                        "\n" +
                        "بیماری و آفت:\n" +
                        "به شپشک آردآلود ، تریپس و شته روی گلها ، حساس است همینطور در تابستان ممکن است دچار بیماری قارچی شود که با مشاوره از سایت ما سم مورد نیاز را دریافت خواهید کرد.\n"));
        arrayList .add(new Item(R.drawable.hana,
                "حنا",
                "ابیاری به مقدار مناسب",
                "نور غیر مستقیم ",
                "18 تا 22 درجه",
                "نام جنس گل حنا که به زبان فرانسوی به معنی بی حوصله است را به این دلیل به آن داده اند که در اثر لمس کردن کپسول میوه یک باره باز شده و بذرها پراکنده می شوند و نام Touch me not نیز به همین دلیل است. گلهای حنا خب دو دسته ی کلی هستند یکی گل حنای باغچه ای که سایه پسنده و پر گل و زیباست و یکی هم گل حنای گینه نو ، یا اصلاح شده و گل درشت !  صحبت ما اینجا سر حنای گینو نو هست که حدوده ۸ ساله توی ایران مد شده و یکی از ویژگی هاش خنثی بودن به طول روز هست که باعث شده توی خونه همیشه گل داشته باشه ! و البته توی باکس بیرون توی بالکن هم تا زمان سرما گل داشته باشه ! نکته ی قابل توجه گلهای درشت ، برگهای براق، دوره ی گلدهی زیاد ، تنوع رنگ بالا ، غیره هست که این گل رو به یه گل بی نظیر تبدیل کرده است !این واریته امروزه یکی از پرتیراژ ترین گلهای تولیدی در دنیا هست که دارای صدها هیبرید و رنگ مختلف ، گلهای پرپر و برگهای ابلق و غیره هست.\n" +
                        "\n" +
                        "\n" +
                        "نور\n" +
                        "خوشبختانه گیاه نورطلبی نیست و خب شرط لازم ولی نه کافی برای گلدهی این گیاه در منزل نور هستش، به این معنی که باید همیشه کنار پنجره با نور غیر مستقیم باشه! توجه کنید غیرمستقیم یعنی اصلا افتاب بهش نخوره!!  مثلا پنجره ی پشت به قبله یا همون شمالی! محیط آشپزخونه که اصلا ساخته شده برای این گل ! هم رطوبت داره و هم نور کنار پنجره البته ! به هرحال محیطی که سایه دستتون مرز مشخص نداره براش خوب  نیست ، سایه دستتون هرجا مرزش مشخص بود براش محیط خوبیه.\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "آبیاری\n" +
                        "یکی دیگه از شروط موفقیت این گل  ، قلق آبیاریش هست که خیلی مهمه ! ازون دسته گلهایی نیست که بخرید و بعد برید مسافرت به امید همسایه ! باید سروقت اب بخوره و شاید این موضوع کمی نگهداریشو سخت کرده باشه ! اولا گیاه کم آبی نیست دوما از قرارگرفتن گلدون توی ظرف اب هم بدش میاد !  اگه اب زیاد بخوره ، ساقه از پایین سیاه میشه و خم میشه پایین و اگه اب کم هم بدید باز شاخ و برگ آویزون میشن و بازم شوک وارد میشه به گل ! بهتره با خشکی روی خاک ابیاری بشود\n"));
        arrayList.add(new Item(R.drawable.aftabgardno,
                "آفتابگردان ",
                "آبیاری کافی و منظم  ",
                "نور کامل آفتاب  ",
                " ۲۵-۲۱ درجه ",
                "نام انگلیسی : Helianthus annuus\n" +
                        "\n" +
                        "خانواده : Asteraceae/Compositae\n" +
                        "آفتابگردان زینتی بومی غرب آمریکا است. واژه Helianthus از دو کلمه یونانی Helios به معنی آفتاب و Anthos به معنی گلی که مسیر آفتاب را دنبال می کند، گرفته شده است. این گونه گیاهی یکساله و پر رشد با ساقه منشعب یا غیر منشعب و مرتفع است. انواع پا کوتاه آن نیز تولید شده است. گل های آن به قطر ۳۰-۲۵ سانتی متر و بصورت کم پر و پرپر بوده، گلچه های شعاعی در رنگ های زرد، قرمز و به ندرت بنفش و گلچه های مرکزی در رنگ های زرد، قهوه ای یا ارغوانی مشاهده می شود. این گیاه برای کاشت در حاشیه، گلدان و نیز به عنوان گل بریدنی بکار می رود.\n" +
                        "گلدهی\n" +
                        "آفتابگردان زینتی روز بلند اختیاری است و با کشت بذر در بهار، در تابستان به گل میرود. با تغییر زمان کاشت بذر تا آبان می توان از گلدهی گیاه استفاده کرد.\n" +
                        "\n" +
                        "نیاز های گیاه آفتابگردان زینتی\n" +
                        "نیاز به نور کامل آفتاب دارد. به سرما مقاوم است، اما برای گلدهی خوب به تابستان های گرم و طولانی نیاز دارد؛ بنابراین شبیه گیاهان حساس به سرما با آن رفتار می شود. ریشه این گیاه عمیق است و خاک آن باید خوب شخم زده شود. نیاز به خاک مرطوب، ولی با زهکشی خوب، غنی از مواد آلی با pH خنثی تا قلیایی دارد. خشکی خاک را به خوبی تحمل می کند.\n" +
                        "\n" +
                        "\n" +
                        "گل آفتابگردان به آبیاری کافی و منظم احتیاج دارد اما می تواند تا حدودی دوره خشکی را تحمل نماید. و این امر به دلیل ریشه مستقیم و توسعه یافته گیاه آفتابگردان می باشدکه پتانسیل نفوذ آن در خاک به سه متر می رسد. آبیاری منظم و مرتب به خصوص در طی ماه اول به رشد و توسعه مناسب سیستم ریشه این گیاه کمک می کند. از طرفی آبیاری بیش از اندازه موجب عدم شکل گیری و یا بدشکل شدن بذرهای شکل گرفته در مرکز گل می شود و خیس بودن همیشگی خاک در نهایت موجب زردی برگها و ریزش آنان و پژمردگی و مرگ گیاه می شود.\n" +
                        "\n" +
                        "دمای مورد نیاز آفتابگردان زینتی :\n" +
                        "\n" +
                        "گیاه آفتابگردان بهترین رشد خود را در دمای ۲۵-۲۱ درجه انجام می دهد اما دما را تا ۳۳ درجه و همچنین ۱۷ درجه به خوبی تحمل کرده و به رشد خود نیز ادامه می دهد هر مقدار که گرما بیشتر شود بهتر است که آب بیشتری نیز در اختیار گیاه قرار داد و یا فواصل آبیاری را کوتاه تر کرد اما هر مقدار که هوا سردتر باشد بهتر است که فواصل آبیاری را نیز بیشتر کرد و همچنین در این شرایط به آب کمتری نیز احتیاج است.\n" +
                        "\n" +
                        "خاک مورد نیاز آفتابگردان زینتی :\n" +
                        "\n" +
                        "خاک سبک دارای کود حیوانی پوسیده که در اثر آبیاری  فراوان باطلاقی نشود و همچنین خاکی با زهکش خوب و حاوی مواد ارگانیک همانند خاک برگ و یا کود پوسیده دامی به رشد این گیاه کمک می کند. همچنین اضافه کردن شن به میزان ۱۰٪ میزان کل حجم مخلوط خاک به زهکش بهتر خاک کمک می کند.آفتابگردان به شوری خاک نسبتا مقاوم است و در محدوده ای از اسیدیته خنثی رشد خوبی دارد.\n" +
                        "\n" +
                        "تکثیر گیاه آفتابگردان زینتی\n" +
                        "\n" +
                        "ازدیاد آفتاب گردان زینتی از طریق بذر انجام می شود .برای کشت بذر آفتابگردان ابتدا باید خاک محل کشت را تا عمق مناسب شخم زد و سپس در اواسط بهار نسبت به کاشت بذرها اقدام نمود (توصیه میشود خاک محل کشت از زهکشی مناسبی برخوردار باشد و برای تقویت خاک می توان از کمپوست و یا خاک برگ و کود پوسیده دامی استفاده کرد ) بذر ها در عمق ۲ تا ۳ سانتی متری کاشته به فاصله ۱۰ الی ۱۵ سانتیمتر از یکدیگر کاشته می شوند در صورتی که می خواهید بذر را در محیط گلخانه و یا منزل کشت نمایید می توانید در بستر آماده از خاک برگ و شن بذرها را کاشته و سپس پس از برطرف شدن دوران یخبندان و متعادل شدن هوا گیاهان جوان را که ۴ برگی و یا ۶ برگی شده اند را محیط باز منتقل کرد . از زمان کاشت تا رویش گلها زمانی بین ۸ الی ۱۰ هفته زمان نیاز دارد.\n"));
        arrayList.add(new Item(R.drawable.davodi,
                "گل داوودی",
                "هر روز عصر یا صبح",
                "نور کامل خورشید",
                "10 الی 27 درجه",
                "معرفی گل داوودی\n" +
                        "\n" +
                        "نام علمی این گیاه Chrysanthemum هست و از خانواده Compositae ها به حساب میاد و داری 200 گونه مختلف می بشاد. این گیاه یک ساله و چند ساله می باشد که نوع گونه ای که شما تهیه میکنید بستگی دارد و روی بسته بندی حتما نوشته خواهد شد. گل داوودی دارای برگ های سبز نیره و گلهای با واریته های رنگی گوناگون می باشد. شما میتونید این گیاه را در فضا های سبز خود ما بین گل های رز بکارید تا زیبایی باغچه خود را دو چندان کنید.\n" +
                        "شرایط نگهداری و نیازهای گل داوودی\n" +
                        "شما همان طور که گفتیم میتویند این گل را به راحتی در داخل باغچه بکارید فقط بهتر است مکانی رو برای کاشت انتخاب کنید که در زمان نور مستقیم ظهر گیاه در سایه باشد ، اگر این امکان برای شما فراهم نیست مشکلی برای گیاه به وجود نخواهد آمد ولی شرایط ایده آل پرورش آن را در ادامه مورد بررسی قرار می دهیم.\n" +
                        "\n" +
                        "خاک مناسب\n" +
                        "اگر قصد دارید که این گیاه را در گلدان بکارید ترکیبی از خاک لوم و شن بهترین خاک برای پرورش می باشد ولی میتویند از ترکیب خاک باغچه+خاک برگ+کوددامی به نسبت مساوی برای خاک کاشت استفاده کنید. ولی حتما اگر قصد کاشت در فضای باز را دارید روی بذرها از کود دامی پوسیده استفاده کنید.\n" +
                        "\n" +
                        "\n" +
                        "دما متناسب\n" +
                        "چون این گیاه دارای گونه های مختلفی می باشد پس شرایط دمامی متفاوتی هم برای رشد نیاز دارد پس سعی کنید گونه ای را انتخاب کنید که با شرایط محیط زندگی شما سازگارتر باشد، اما نیاز دمای این گیاه بین 10 الی 27 درجه مغییر می باشد\n" +
                        "\n" +
                        "نور مناسب\n" +
                        "\n" +
                        "این گیاه به نور کامل خورشید نیاز دارد ولی اگر نور کافی برای گیاه فراهم نکنید غنچه های آن باز نخواهند شد پس اگر در گلدان اقدام به کاشت میکنید حتما فکر نور باشید.بهترین محل برای کسانی که در گلدان این گیاه رو میکارند پشت پنجره جنوبی هست.\n" +
                        "\n" +
                        "نیاز آبی گل داوودی\n" +
                        "این گیاه به آبیاری مدام نیاز دارد و حتما باید محل کاشت مرطوب باشد پس اگر در باغچه گیاه را کاشته اید حتما هر روز عصر یا صبح گیاه را آبیاری کنید و اگر در گلدان اقدام به کاشت نموده اید حتما خاک را مرطوب نگهدارید ولی باتلاقی نکنید. البته میتوایند از غبارپاشی هم هر روز برای تامین رطوبت استفاده کنید ولی غبارپاشی را به هیچ وجه هنگام ظهر انجام ندید.\n" +
                        "\n" +
                        "تعذیه و کوددهی\n" +
                        "اگر این گیاه را در داخل گلدان کاشتید سعی کنید از دودهای ازت و پتاس بالا برای گلدهی استفاده کنید برای استفاده هر هفته یکبار کافی خواهد بود ولی اگر در باغچه کاشته باشید همون ابتدای کاست از کود دامی پوسیده استفاده کرده باشید کافی هست.\n" +
                        "\n" +
                        "روش کاشت گل داوودی در گلدان و باغچه\n" +
                        "برای این کار ابتدا باید بذر مناسب شرایط نگهداری و محل زندگی خود را از بذر فروشی ها و وسایل کشاورزی فروشی ها تهیه کنید مرحله به مرحله طبق مراحل زیر اقدام کنید\n" +
                        "\n" +
                        "انتخاب بستر مناسب\n" +
                        "همانطور که در بخش نیازها گفتیم اگر قصد کاشت در گلدان را دارید بستر کشت که شامل خاکبرگ و شن یا خاکبرگ، کوکوپیت، پرلیت و یا هر گونه خاک سبک دیگری  اماده کنید و بذرها را روی بستر کشت بپاشید ، در خصوص باغچه هم بعد از شخم زدن و ساف کدن خاک بذرها را روی خاک بپاشید. و سپس با استفاده از کود حیوانی (برای باغچه) و خاک برگ به ضحامت 5 میلی متر تا 1 سانتی متر روی بذرها را بپوشانید.\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "آبیاری\n" +
                        "پس از کاشت بذرها با استفاده از آبپاش گلدان ها را به آرامی آبیاری کنید تا بذرها خیلی جابجا نشوند و از هم فاصله نگیرین ، با پاشیدن آب روی بستر کاشت در باغچه هم گل های خود را آبیاری کنید و مراقب باشید که بذرها جابجا نشوند از شدت زیاد آبیاری\n" +
                        "مرطوب نگه داشتن محل کاشت\n" +
                        "\n" +
                        "تا زمانی که جوانه های گل از خاک خارج نشده حتما بستر کشت را مرطوب نگهداری کنید بریا حفظ رطوبت میتونید از نیالون هم استفاده کنید ولی خیلی نیاز به نشان دادن حساسیت نیست راحت کار خودتون بکنید.\n" +
                        "\n" +
                        "به همین راحتی شما بدون هیچ دردسری گل های داودی خودتون رو کاشتید و پس از گذت مدتی شروع به گلدهی خواهند کرد از این روش های عجیب و غریب که در سایت های مختلف هم نوشته خبری نست.\n" +
                        "روش های کاشت و تکثیر گل داوودی\n" +
                        "\n" +
                        "معمولا تولید کنندگان گلهای شاخ بریده داوودی به سه روش مختلف اقدام به کشات و تکثیر این گیاه میکند که در ادامه به بررسی آنها خواهیم پرداخت.\n" +
                        "اولین روش\n" +
                        "استفاده از پاجوش ها هست که با جدا کردن پا جوش ها از گیاه مادری میتونید به راحتی این گل را تکثیر کنید ولی در موارد خیلی زیاد دیده شده که بیماری های گیاه مادر با استفاده از خاک به گیاه جدید منتقل شده پس خیلی از این روش استفاده نمیشه.\n" +
                        "روش دوم :\n" +
                        "در این روش پاجوش های سالم رو انتخاب میکنند و سر و ته آنها را به اندازه 10 الی 15 سانتی متر قطع میکنند مثل قلمه زدن و در داخل خاک گلدان، خزانه انتظار و یا باغچه میکارند.\n" +
                        "روش سوم :\n" +
                        "در این روش که به رشو قلمه هم معرف هست ساقه های چیده شده گل رو در خرانه یا گلدان به طوری که قلمه ها حداقل 10 الی 15 سانتی متر طول داشته باشند تمام برگهای اضافی را از گیاه جدا کنید و سپس قلمه را در داخل خاک بکارید. پس از تقریبأ سه چهار هفته قلمه ها ریشه دار خواهند شد و پس از آن میتوانید گیاه را به گلدان جدید و یا باغچه منتقل کنید.\n" +
                        "نحوه پرورش قلمه در خزانه انتظار :\n" +
                        "شما میتوانید کار تکثیر گل داوودی را ( قلمه کاری )از اواسط  بهمن ماه تا اوایل اردیبهشت انجام دهید زمان دقیق به وضعیت آب و هوایی شما دارد. ولی بهترین تاریخ عمل قلمه زنی از اواسط اسفندماه تا اواسط فروردین ماه است.\n" +
                        "عمل قلمه کاری اگر زودتر انجام گیرد ، ریشه و ساقه ها بطئی رشد کرده و گل پرورش یافته درشت می شود و با العکس اگر عملیات کشت قلمه دیرتر صورت گیرد ، رشد و نمو گیاهی سریع و بوته ها ضعیف تر و گلها کوچکتر خواهد شد.\n" +
                        "\n" +
                        "\n" +
                        "دمای مورد نیاز برای رشد قلمه ها\n" +
                        "برای سرعت دادن به رشد، ریشه دهی خوب درجه حرارتی در حدود 15 تا 18 درجه سانتیگراد برای محل نگهداری قلمه ها لازم است. قلمه های کاشته شده نسبت به تابش آفتاب حساسیت ندارند و اگر چنانچه باغبانی بخواهد با حصیر مانعی برای نور آفتاب تند ایجاد نماید ، این نکته را باید توجه نماید که برگهای قلمه به هیچ وجه پژمرده نشوند.توصیه می شود که عمل آبیاری از روی خاک انجام گیرد.از اوایل تا اواسط تابستان به علت رشد رشه ، حتما باید گلدانها و یا مکان قلمه ها در خزانه را تعویض کنید.جابجایی قلمه ها گاهی اوقات چهار یا پنج بار باید صورت گیرد و هر بار فواصل ردیف و بوته ها را باید مطابق بزرگی گیاه در نظر گرفت.\n" +
                        "تعیین تاریخ برداشت گل داودی :\n" +
                        "در میان گلها ، گل داودی از گلهائی است که تغییرات تاریخ برداشت آن ( یعنی روز ، هفته یا ماه ) توسط باغبان می تواند به آسانی انجام گیرد.چون این گل حساسیت خیلی زیادی در برابر تغییرات طول زمانی روشنائی دارد ولی این موضوع بی ارتباط با مسئله اقتصادی تهیه گل نیست.\n" +
                        "همانطوریکه اغلب تولید کنندگان گلهای زینتی در جریان امر هستند ، چون گل داودی در پائیز و تا نیمه زمستان می تواند مورد استفاده قرار گیرد ، از نظر هزینه های غیر قابل اجتناب پرورش و توزیع این گل از فصل سرما ، توجه بیشتری را باید مبذول داشت.\n" +
                        "با در نظر گرفتن اینکه گل داودی در زمان پرورش در داخل گلخانه احتیاج به حدود 16 درجه سانتیگراد حرارت می باشد ، از نظر هزینه تولید گرما مسئله بزرگی را در زمستان برای تولید کننده فراهم می نماید.\n" +
                        "همانطوریکه قبلا توضیح داده شد ، بالاخره برای تعیین تاریخ برداشت گل داودی ازاثرات روشنائی ( درکم و زیاد کردن فاصله روشنائی) استفاده کرد حتی می توان روز برداشت ( چیدن گل ) این گل را تعیین نمود برای این کار از تاریک یا روشن نگهداشتن محل رشد و نمو بوته های گل داودی می توان به نتیجه خیلی خوبی رسید.\n" +
                        "برای تعیین تغییرات مدت روشنائی مورد لزوم گل داودی می توان از پارچه کاملا سیاه رنگ استفاده نمود. البته در بعضی از نقاط با شرایط آب و هوائی مناسب عده ای از پرورش دهندگان گلهای زینتی از نایلون سیاه استفاده می نمایند.\n" +
                        "با در نظر گرفتن مطالب گفته شده فوق همچنین با ایجاد روشنائی مصنوعی بوسیله لامپ مهتابی یا لامپ های معمولی میتوان تغییراتی در تعیین تاریخ برداشت گل داودی بوجود آورد. برای به عقب بردن تاریخ برداشت گل داودی در تابستان احتیاج به نور مصنوعی نیست ولی از شروع فصل پائیز گل داودی در بعضی از مناطق نیاز به روشنائی دارد.\n"));
        arrayList.add(new Item(R.drawable.kokab,
                "گل کوکب ",
                "اب فراوان",
                "آفتاب فراوان",
                "دمای معمولی",
                "گل کوکب کوهی بومی امریکای شمالی بوده وبصورت علف هرز در مزارع می روید. تمام گونه این گیاه دارای گلهای فراوان وعمر طولانی دارند. ارتفاع آن متفاوت و به صورت بوته های خودرو نا منظم و شاخه شاخه دیده می شود\n" +
                        "\n" +
                        "\n" +
                        "نام علمی و لاتین:\n" +
                        "rudbeckia ،  asteracees  composees\n" +
                        " گل کوکب کوهی برگ ها به شکل کشیده،دراز، نوک نیزه ای، کرک دار و به رنگ سبز روشن می باشد. دمبرگها سخت و محکم بوده و طول آن ها به ۴۵ سانتیمتر میرسد. گلها دارای برگچه در زیر گلبرگ قرار دارند گلها نوک تیز و به رنگ های زرد تند، قهوه ای و قرمز رنگ می باشند. این گلها کلا پرکی با میخک های زرد رنگ است که حلقه ارغوانی رنگ مایل به قهوه ای دور کلا پرک را احاطه کرده است. مرکز گلهای باز شده دارای ظاهر فلزی متالیک می باشد. یک بوته حتی می تواند تا ۶۰ گل نیز داشته باشد. گلها از اواسط تابستان تا اواخر پاییز شکوفا می شوند. سرمای کوتاه مدت یا یخبندان سطحی و کوتاه مدت چندان به آنان صدمه وارد نمی آورد.\n" +
                        "\n" +
                        "در بعضی از واریته ها گل نیمه پر،پر و یا پر، پر کامل هستند. از گونه هایی که به عنوان نباتات دائمی استفاده میشود گونه r.spender  می باشد که نباتی است دائمی، پر پشت به ارتفاع ۵۰ سانتیمتر. گلها زرد زعفرانی و دیسک وسطحی متمایل به قرمز بوده و نباتات تمام طول تابستان را گل می کند.گونه های دیگر به صورت پا کوتاه و گلهای پر،پر وجود دارد.\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "نحوه کاشت و ازدیاد گل کوکب کوهی:\n" +
                        "بذر کوکب کوهی یکساله را مانند نباتات یکساله می توان کاشت. ولی گونه های که دائمی هستند به وسیله تقسیم بوته می توان تکثیر نمود. برای کاشت بذر را در اوایل فروردین می کارند و در اواخر اردیبهشت در بستر اصلی نشاء می گردند.\n" +
                        "\n" +
                        "خاک گل کوکب:\n" +
                        "کوکب کوهی به خاک رس و ماسه ای و نسبتا” غنی از مواد آلی و مکانهای گرم و آفتاب گیر احتیاج دارد.\n" +
                        "کاربرد گل کوکب:\n" +
                        "گیاه کوکب کوهی را گروهی در بین گلهای دیگر می کارند. در مقابل درختچه ها و سوزنی برگان  زیبایی  خاص خواهد داشت همچنین جهت تزیینات پلات باندها یا به صورت گروهی برای زینت چمنها و مقابل درختان دائمی بکار میرود. از گلهای بریده آنها نیز برای تهیه دسته گل استفاده می شود. عمر گلهای بریده تا ۱۵ روز در آب می باشد. در طول مدت رشد و گلدهی بایستی گلهای کاملا” باز شده و پلاسیده را قطع نمود زیرا غنچه ها پس از بریدن در گلدان باز نمی شوند\n"));
        arrayList.add(new Item(R.drawable.lale,
                "لاله عباسی ",
                "کاهش آبیاری در فصل زمستان",
                "آفتاب کامل",
                "۱۵_۳۰ درجه ",
                "گل لاله عباسی گیاهی است چند ساله از جنس Mirabilis در خانواده Nyctaginaceae که اغلب به صورت یکساله پرورش داده می شود و از شایع ترین گونه های زینتی این جنس است. این گل دارای تنوع رنگ زیادی است.\n" +
                        "\n" +
                        "گل لاله عباسی گیاهی است چند ساله از جنس Mirabilis در خانواده Nyctaginaceae که اغلب به صورت یکساله پرورش داده می شود و از شایع ترین گونه های زینتی این جنس است. این گل دارای تنوع رنگ زیادی است. در ضمن این گل بومی مناطق گرمسیری جنوب امریکا و رشته کوه های آند در کشور پرو میباشد. یکی از جنبه های عجیب این گیاه که با نام ساعت ۴ “Four O’Clock” در دنیا شناخته میشود این است که گل های در رنگ های مختلف را می توان به طور همزمان در یک گیاه مشاهده کرد.\n" +
                        "\n" +
                        "شاخه های لاله عباسی منشعب و برگ ها تخم مرغی شکل است. گل های لاله عباسی به صورت گل آذین خوشه مرکب در محور برگ ها تشکیل می شوند. گل های آن معطر و ۵ لبه به قطر ۲٫۵ تا ۵ سانتی متر بوده؛ و در رنگ های قرمز، زرد، سفید، صورتی و به صورت یک رنگ یا چند رنگ مشاهده می شوند.\n" +
                        "\n" +
                        "گل لاله عباسی در بعدازظهر یا در در هوای ابری باز شده و صبح بسته می شوند.\n" +
                        "ریشه های لاله عباسی ژوخه ای بوده و می توان از آن جهت افزایش استفاده کرد.\n" +
                        "در برخی کشور ها از گل های این گیاه برای ساختن رنگ استفاده می شود.\n" +
                        "شرایط مناسب برای پرورش گل لاله عباسی\n" +
                        "رطوبت\n" +
                        "کمی مرطوب. کاهش آبیاری در فصل زمستان\n" +
                        "خاک:\n" +
                        "خاک رس آهکی و کمی مرطوب\n" +
                        "تکثیر این گیاه از طریق بذر در اوایل بهار و یا تقسیم غده در هر زمان امکانپذیر است. اگر دانه های درشت سیاه و سفید شما را در آب به مدت یک شب قبل از کاشت قرار دهید، این کار منجر به جوانه زدن سریعتر خواهد شد.\n" +
                        "این گیاه در برخی مراجع به عنوان یک گیاه توهم زا معرفی شده است و میبایست از مصرف آن به صورت های مختلف اجتناب نمود.\n"));
        arrayList.add(new Item(R.drawable.mina,
                " گل مینا",
                "یک تا دو بار در هفته",
                " نور کامل آفتاب",
                " ۲۱ تا ۲۲ درجه ",
                "مبدأ آن چین و ژاپن است. گیاهی یک ساله با رنگ ها و شکل های مختلف گل بوده، برگ های آن متناوب و بیضوی با حاشیه دندانه دار است. انواع کم پر و پر پر با گلبرگ های باریک و پهن دارد. رنگ غالب آن ها سفید، صورتی، قرمز آتشی، آبی و ارغوانی است. دارای انواع پاکوتاه، متوسط و پابلند بوده که ارتفا آن ها از ۱۵ تا ۶۰ سانتی متر متغیر است. از انواع پابلند آن برای گل بریدنی و از انواع پاکوتاه آن برای کاشت در گلدان می توان استفاده کرد. نباید آن را با مینای چندساله که گاهی به آن مینای چینی نیز گفته می شود و گلبرگ های آن اغلب آبی، آبی مایل به بنفش و گاهی قرمز و سفید با مرکز زرد رنگ است، اشتباه کرد.\n" +
                        "\n" +
                        "گلدهی\n" +
                        " زمان گلدهی مینای یک ساله اواسط مرداد و شهریور است. برخی از رقم های آن دیرتر به گل می رود. از آنجا که این گیاه در بهار گل نمی دهد، برای خالی نماندن زمین از گل آن را با دیگر گل های بهاره به صورت ترکیبی می کارند. مینای یک ساله برای تسریع گل آغازی در دمای ۱۳ –۲۰ درجه سانتی گراد، به عنوان یک گیاه روز بلند اختیاری طبقه بندی می شود ولی در دمای ۱۳ درجه سانتی گراد یا کمتر، روز بلند اجباری است و در شرایط روز کوتاه فقط به فرم طوقه ای رشد می کند. پس از گل آغازی در شرایط روز کوتاه نمو گل تسریع می شود. زمان گلدهی تحت تاثیر نسبت روزهای بلند به روزهای کوتاه قرار می گیرد. در شرایط روز کوتاه به کار بردن تیمار روز بلند (۱۶ ساعت روشنایی) باعث افزایش طول ساقه و کاهش زمان تا گلدهی می شود. نوردهی دوره ای ۷.۵ دقیقه در هر نیم ساعت به طور معمول استفاده می شود.\n" +
                        "\n" +
                        "نیازها\n" +
                        " خاک مناسب آن یک خاک غنی با زه کشی مناسب است. خاک مورد  استفاده برای کاشت مینا پائیزه نباید با متیل بروماید گندزدایی شود چون باعث کاهش تندیدن بذر می شود. زیادی کلسیم در خاک نیز برای کاشت مینا پائیزه مناسب نیست. به حالت غرقابی بسیار حساس است و خاک سنگین برای رشد آن مناسب نیست. مینا پائیزه یک گیاه یک ساله زمستانه است اما می تواند در تابستان رشد کند. محصول تابستانه اغلب در محل سرپوشیده پرورش داده می شود. در مناطقی که بتوان دما را در محدوده ۱۰ درجه سانتی گراد نگهداری کرد، در سراسر سال قابل پرورش است. با وجودی که یک گیاه یک ساله زمستانه است اما به سرمازدگی بسیار حساس است و بنابراین کاشت بذر آن باید در زمانی انجام شود که گیاه با دمای یخبندان مواجه نشود. سایه را تحمل می کند ولی نور فراوان آفتاب را ترجیح می دهد. از آنجا که ریشه های مینا سطحی است نباید دچار کم آبی شود. حذف گل های پژمرده به افزایش دوره گلدهی کمک می کند. سربرداری در بعضی رقم های مینا اثر مفید دارد و میتواند باعث افزایش انشعابات جانبی و تعداد گل در گیاه شود، گرچه گلدهی را مدتی به عقب   می اندازد.\n" +
                        "\n" +
                        "افزایش\n" +
                        " با بذر افزایش می یابد بذر آن در اسفند در شاسی سرد کشت شده و پس از یک مرحله جابجایی در مرحله ۴ برگی، در اردیبهشت ماه به زمین اصلی منتقل می شود. زمان انتقال نشاء اثر زیادی روی موفقیت یا شکست در تولید این محصول دارد که به شرایط آب و هوایی بستگی دارد. پس از کاشت آبیاری شده و برای چند روز بهتر است روی آن ها سایبان ایجاد شود. برای ادامه گلدهی تا آخر پائیز بذر را در چند مرحله کشت می کنند. از زمان کاشت بذر تا گلدهی بسته به رقم ۳ تا ۵ ماه طول می کشد.\n" +
                        "\n" +
                        "آفات و بیماری ها\n" +
                        " یکی از آفات رایج برای این گیاه مورچه است که طوقه را می خورد و باعث خشک شدن آن می شود. اگر در باغچه ای مورچه وجود داشته باشد، با سم لیندین یا سوین می توان با آن مبارزه کرد. از آنجا که این گل امراض قارچی نیز دارد توصیه می شود دو سال پشت سر هم در یک محل کشت نشود.\n"));
        arrayList.add(new Item(R.drawable.silen,
                "سلین",
                "اب به مقدار لازم",
                "آفتاب کامل ",
                "دمای معمولی",
                "گیاه یک \u200Cساله نسبتاً سریع \u200Cالرشدی به ارتفاع ۳۰ و گستردگی ۱۵ سانتی\u200Cمتر است ، گل\u200C های صورتی پررنگ آن در تابستان ظاهر می\u200Cشوند. سیلن بومی حوزه مدیترانه ست ، سطح برگ های آن به طور خفیفی کرکدار ، برگ ها بادامی یا بیضوی شکل وزبر خشن به رنگ سبز درخشان  ست ، پایه ی گیاه شاخه شاخه و کاملا باز شده و تقریبا به حالت نیمه خزنده ،گل ها کوچک، کاسبرگ ها مقاوم و گلبرگ ها بریده بریده ، گل ها ی آن ساده یا پرپر به صورت خوشه ای به رنگ صورتی ، سفید یا قرمز تند هستند ،انتقال نشا  سیلن در اردیبهشت یا خرداد و به فواصل ۳۰تا۴۰ سانتی متر به بستر اصلی صورت میگیرد،سیلن گیاهی پر توقع نیست و در تمامی خاک ها کاشته می شود.مکان رشد سیلن باید آفتابگیر باشد تا گلدهی و رشد ان به خوبی انجام شود.گیاه سیلن در خاک های مرطوب یا غرقابی پس از باران های نسبتا طولانی از بین می رود،گیاه سیلن بیشتر جنبه ی تزیینی دارد،از خواص درمانی سیلن میتوان به این موارد اشاره کرد که آب عصاره ی آن برای درمان ناراحتی های چشمی کاربرد دارد و از آن برای شستشوی بدن نیز استفاده می شود و از ریشه ی آن نوعی صابون برای شستشوی بدن به دست می آید\n" +
                        "\n" +
                        "گیاه سیلن ( قلیونک) در خاک های فقیر نیز به آسانی رشد پیدا میکند. این گیاه بومی اروپا و آفريقا است. بعضی این گیاه را گوشت خوار می پندارند زیرا مگس ها و حشرات روی کاسه گل چسبان این گیر می افتند اما با توجه به ملاحظات این گیاه مانند گوشتخواران واقعی از حشرات گیر افتاده تغذیه نمی کند.گیاه سیلن ( قلیونک) در واقع گیاهی همه ساله است اما بیشتر به عنوان گیاهی یک ساله مورد استفاده قرار می گیرد\n" +
                        "\n" +
                        "ساقه و برگ\n" +
                        "ساقه ها و برگ های این گیاه توسط موهای سفید نازکی پوشیده شده و پرز دار هستند\n" +
                        "خاستگاه\n" +
                        "خاستگاه سیلن ( قلیونک) باغ های کلبه ای در انگلستان است. سیلن ( قلیونک) یک گیاه وحشی روستایی ست\n" +
                        "کاربرد\n" +
                        "در فضای سبز از این گیاه در مرزبندی ها و در گلدان ها  استفاده می شود. در نتیجه این گیاه میتواند گیاه مناسبی برای محیط خارجی و داخلی باشد. این گیاه در آيين افریقایی ها برای نفوذ یا تاثیر بر رویاها استفاده می شده\n" +
                        "تكثير گیاه از طریق بذر می باشد\n" +
                        "زمان جوانه زنی\n" +
                        "۱۵ تا ۲۵ روز\n" +
                        "بذر\n" +
                        "بذر پاشی را در اوایل فصل و ۳ هفته قبل از آخرین یخبندان انجام بدهید\n" +
                        "مرحله ۱: ابتدا بذر را بر بروی خاک بپاشید\n" +
                        "مرحله ۲: به اندازه  ۱ سانتی متر  خاک سبک بر روی بذر ها بریزید\n" +
                        "مرحله ۳: آبیاری را انجام دهید\n" +
                        "گیاه شما به آسانی جوانه زده و به سرعت رشد خواهد کرد. این گیاه از گیاهان خودرو به شمار رفته و پس از آنکه شما یک بار دانه را کاشتید این گیاه خود می تواند دانه ها را پراکنده کند و به آسانی دوباره رشد کند. اما اگر این ویژگی برای شما مناسب نیست و دوست ندارید این گیاه بیش از حدی که کاشته اید پراکنده شود بعد از آنکه دانه ها جوانه زدند  جوانه رأسی را قطع کنید\n" +
                        "نگهداری  سیلن\n" +
                        "نیاز نوری\n" +
                        "این گیاه آفتاب کامل را ترجیح میدهد اما گرمای زیاد برای گیاهان مطلوب نیست.بهتر است این گیاه در قسمت های گرم تر زمین و در سایه نسبی یا سایه بعد از ظهر بکارید\n" +
                        "\n" +
                        "خاک\n" +
                        "این گیاه از نظر نیاز خاکی کم نیاز به شمار می رود و حتی در خاک های فقیر و نیمه فقیر ( همانند خاک هایی که سنگی هستند) رشد خوبی خواهد داشت. اما به این نکته توجه داشته باشید که هر گیاهی در خاکی که غنی باشد رشد مناسب تر و بهتری خواهد داشت. این گیاه خاک خشک یا کمی مرطوب را ترجیح میدهد. پس خاکی که این گیاه در آن کاشته می شود باید دارای زهکشی مناسبی باشد. توجه داشته باشید اگر خاک بیش از حد مرطوب شود احتمال آلودگی های قارچی و پوسیدگی ریشه وجود خواهد داشت\n" +
                        "کوددهی\n" +
                        "برای آنکه گیاه شما حداکثر عملکرد خود را داشته باشد در فصل رشد آن ۱ یا دو مرتبه از کودهای کامل که تمامی مواد مورد نیاز یک گیاه را دارند استفاده کنید. سعی کنید کودهای طبیعی را برای حفظ ظاهر مرتب گیاه داشته باشید. در پاییز  یک لایه کود گیاهی به ضخامت ۳ تا ۹ سانتی متر در سطح خاک این گیاه را به سرمازدگی مقاوم خواهد کرد. البته توجه داتشه باشید که کود گیاهی را در فصل بهار باید کنار بزنید تا قسمت های رویشی گیاه بتواند پدیدار شود\n" +
                        "\n" +
                        "حشرات و بيمارى ها\n" +
                        "گیاهان سیلن ( قلیونک) آفت ها و بيمارى های کمی دارند البته  آنها در خاک خیس و دارای آب به خوبی رشد نمی کنند و ممکن است به بيمارى های قارچي دچار شوند\n" +
                        "نکات\n" +
                        "این گیاه گاهی نیازمند قیم است\n" +
                        "برای جلوگیری از گسترش این گیاه  گیاهان پژمرده و مرده را از گیاه جدا کنید که دانه ها پراکنده نشوداین گیاه معمولا گیاهی مقاوم بوده و مشکلات کمی برای آن پیش می آید اما اگر مشکلی برای گیاهتان پیش آمد سریعا آن را برطرف کنید\n"));
        arrayList.add(new Item(R.drawable.dd,
                "دراسنا",
                "توضیحات بامبو",
                "نور مستقیم آفتاب ",
                "24-15 درجه ",
                "اسم علمی این گیاه Dracaena marginata ، از خانواده Liliaceae میباشد. این جنس دارای 40 گونه مختلف از درختچه های همیشه سبزاست. اغلب گونه های این جنس نخل مانند بوده و ریشه هایی دارند که درتمام طول، قطر یکسانی داشته و به رنگ زرد نارنجی می باشد. گونه marginata نسبت به شرایط مختلف آپارتمانی بسیار مقاوم است. برگهای خطر دارد که خشن و سبز رنگ هستندو گاهی دارای نوارهائی به رنگ زرد یا قرمز متمایل به قهوه ای می باشند. در مواقعی که خطوط زرد برگ زیاد باشد گیاه احتیاج به نور بیشتری دارد\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "تکثیر\n" +
                        "دراسنا گاهی به صورت چند ساقه ای رشد کرده و بزرگ می شود و نیاز به هرس وکنترل دارد. این زمان برای تکثیر مناسب است. دراسنا را می توان از طریق قلمه های انتهایی ساقه و قلمه های ساقه ای تکثیر کرد. می توان از جوانه های به وجود آمده در پای گیاه نیز استفاده کرد. قلمه ها را به اندازه 10 تا 15 سانتیمتر، با یک چاقوی تیز جدا کنید قلمه ای ساقه ای را از ساقه یا بدون برگ بگیرید و به تکه های 5 تا 5/7 سانتیمتری تقسیم نمایید . هر تکه باید داری یک جوانه خفته باشد. مواظب باشید قطعات ساقه را وارونه در خاک نگذارید. اگر سمت پایین ساقه در خاک قرار نگیرد ، ریشه ای تولید نمی کند. هر قلمه را در پودر هورمون ریشه زایی فرو ببرید. برگهای زیادی را از ساقه جدا کنید. وهر قلمه را در گلدانی با قطر دهانه 9 سانتیمتر ، حاوی ورمی کمپوست مخصوص قلمه و بذر قرار دهید. قلمه ها را با کیسه پلاستیکی بپوشانید و در دمای 24 درجه سانتیگراد، دور از تابش مستقیم خورشید نگاه دارید. پس از دو ماه که ریشه دهی انجام شد، کیسه را بردارید و تغذیه مصنوعی را شروع کنید. بهترین زمان برای تکثیر دراسنا، از اواسط تا اواخر بهار و یا اواخر تابستان تا اوایل پاییز است .گرفتن قلمه از شاخه های مسن در اواخر زمستان،ساقه ها را به طور افقی در شن قرار دهید،کاشت بذر در دمای 30 درجه در بهار،خاوبانیدن شاخه ها در بهار.\n" +
                        " \n" +
                        "خاک:\n" +
                        "این گیاه، خاک کمی اسیدی را دوست دارد بنابراین برای ترکیب خاک آن از خاک باغچه+خاک برگ+ شن یا پرلیت می توان استفاده کرد. و یا می توان از خاک های مخصوص گیاهان گلدانی که زهکش خوبی هم داشته باشند استفاده کرد. این گیاه را می توان در فصل رشد هر 3-2 هفته یکبار با یک کود مایع مخصوص گیاهان آپارتمانی و یا هر ماه با یک کودی مثل 10-10-10 آن را تغذیه مصنوعی کرد. تعویض گلدان باید هر 3-2 سال یکبار با یک شماره بالاتر انجام شود.\n" +
                        "آبیاری:\n" +
                        "خاک سطح گلدان این گیاه جز در فصل زمستان باید همواره نمدار بماند. هفته ای 3-2 مرتبه آبیاری در تابستان و یکبار در زمستان کافی است. آب مورد استفاده برای آبیاری را 48 ساعت در ظرفی نگه دارید و بعد استفاده کنید.\n" +
                        "نور:\n" +
                        "گیاه را از نور مستقیم آفتاب محافظت کنید. در محیط هایی با نور روشن، سرعت رشد گیاه سریع تر می شود و در نور کم هم گیاه می تواند زنده بماند. \n" +
                        "دما:\n" +
                        "دمای 24-15 درجه برای آن ایده آل است. با کاهش دما به زیر 12 درجه به گیاه صدمه وارد می شود و برگ ها شروع به ریزش می کنند تا این که گیاه می خشکد. در دماهای بالاتر از حد تحمل گیاه، با اسپری آب بر روی برگ ها مانع سوختگی نوک برگ ها شوید.\n"));
        arrayList.add(new Item(R.drawable.orkideh,
                "ارکیده",
                "هفته ای 3-2 مرتبه ",
                " نور غیرمستقیم خورشید",
                " زیر ۱۵ درجه سانتی گراد ",
                "ارکیده فیلیپینی، همانطور که از اسمش مشخص است، از فیلیپین آمده تا با برگ های متفاوت و گل های صورتی خود جلوه ی منحصر به فردی به محیط منزل شما بدهد." +
                        " نظیر برگ های ارکیده فیلیپینی را کمتر دیده اید، برگ هایی با رنگ سبز تیره که مانند گوشواره به گل خود آویزان است.\n" +
                        "در جنگل ها، ارکیده فیلیپینی یک اپیفایت است، یعنی گیاهی است که در داخل حفره های درخت های بزرگ رشد می کند. برگ های محکم و بزرگ آن قادرند تا رطوبت را به مقدار زیادی برای گیاه حفظ کنند، یعنی گیاه به این زودی ها تشنه نمی شود\n" +
                        "رطوبت\n" +
                        "ارکیده در هوای مرطوب به خوبی رشد می\u200Cکند، پس بهتر است آن را در مکان هایی مانند آشپزخانه و یا حمام قرار دهید و یا با اسپری کردن کمی آب به آن، رطوبتش را حفظ کنید.\n" +
                        "\n" +
                        "چنانچه در مورد نگهداری از گیاه ارکیده فیلیپینی سوالی دارید. سوال خود را از طریق بخش نظرات برای کارشناسان گُل سِتان ارسال کنید. کارشناسان گُل سِتان در اسرع وقت پاسخ گوی سوالات شما خواهند بود.\n"));
        arrayList.add(new Item(R.drawable.ficoshendi,"فیکوس هندی",
                " ۱۵ دقیقه در تشت آب ",
                "نورمتوسط وغیرمستقیم",
                "30تا15 درجه ی سانتیگراد",
                "رطوبت\n" +
                        "برای تامین رطوبت مورد نیاز گیاه بهتر است یک ظرف آب در کنار آن قرار دهید و یا هفته ای یک تا دو بار اقدام به غبارپاشی کنید.توجه داشته باشید که غبار پاشی در زیر نور مستقیم آفتاب موجب ایجاد لکه های سوخت بر روی برگ های گیاه می شود پس از انجام این کار خودداری کنید.\n" +
                        "کود دهی\n" +
                        "جهت رشد بهتر گیاه فیکوس میتوانید از کود و تقویت کننده مخصوص گیاهان طبق دستور العمل استفاده کنید\n" +
                        "پیشنهاد : خرید انواع کود و تقویت کننده مخصوص گیاهان\n" +
                        "\n" +
                        "خاک\n" +
                        "بهترین خاک برای گیاه فیکوس ، خاک کمپوست میباشد.\n" +
                        "پیشنهاد : خرید انواع خاک و پرلیت مخصوص گیاهان\n" +
                        "تعویض گلدان:\n" +
                        "زمان مناسب برای تعویض گلدان هنگامی است که ریشه گیاه از خاک بیرون زده باشد در غیر این صورت تعویض گلدان را به تعویق بیندازید.\n" +
                        "هرس فیکوس\n" +
                        "زمان مناسب برای هرس این گیاه در اوایل تابستان و اواخر بهار است.برای انجام این کار ساقه هایی را که خارج از فرم و شکل اصلی گیاه رشد کرده اند و یا ساقه هایی را که بیش از اندازه بلند شده اند را قطع و یا کوتاه کنید.\n" +
                        "برای برش شاخه های اضافی برش را از بالای یک گره (گره ناحیه اتصال برگ ها به ساقه است) بزنید. در جدا کردن ساقه ها زیاده روی نکنید زیرا ممکن است باعث شوکه شدن گیاه شوید. حجم کل ساقه ای جدا شده باید حداکثر حدود ۳۰٪ حجم کل ساقه های گیاه باشد.\n" +
                        "\n" +
                        "تمیز کردن برگ ها\n" +
                        "برای تمیز کردن برگ ها از اسفنج مرطوب و یا پارچه ی پنبه ای کمک بگیرید و با کمک آب برگ ها را تمیز کنید و توجه داشته باشید که استفاده از مواد شیمیایی براق کننده برای گیاه مضر است و برای براق کردن برگ ها به روش طبیعی می توانید از مقاله ی زیر کمک بگیرید.\n"));
        arrayList.add(new Item(R.drawable.pachira,
                "پاچیرا",
                "نیازآبی نسبتابالا ",
                "نور شدید",
                "۱۶تا۲۴درجه",
                "پاچیرا به درخت پول و یا درخت شانس مشهور می باشد و در فرهنگ و سنت چین این گیاه برای رشد، پیشرفت و کسب درآمد بسیار مهم بوده و در بیشتر مغازه ها و ادارات این گیاه زیبا دیده خواهد شد.\n" +
                        "این گیاه بسیار سریع الرشد دارای برگ های سبز تیره با حالت کشیده و پنجه مانند دارند و ساقه صاف و بلند و مرتجع این گیاه که اغلب به خاطر زیباتر شدن بافته می شوند چشم هر بیننده ای را می نوازد.\n" +
                        "پاچیرا در منزلتان براحتی زندگی و رشد میکند . شاید بتوان گفت گیاهی کم توقع است . آب کم ، نور غیر مستقیم پشت شیشه و نگهداری آسان از خصوصیات آن است همچنین گیاهی مناسب برای بونسای کردن برای علاقه مندان به این درختچه های مینیاتوری است.\n" +
                        "\n" +
                        "از آبیاری بیش از اندازه نیز پرهیز کنید و دقت داشته باشید که بین دو آبیاری سطح خاک شود آبیاری بیش از اندازه باعث زردی و سیاهی نوک برگ ها می شود.\n" +
                        "خاک پاچیرا :\n" +
                        "ترکیب پیت ماس یا خاک های هلندی با پرلیت به صورت ۶۰ به ۴۰ به نفع پرلیت برای تهویه مناسب و زهکشی کافی مناسب است.\n" +
                        "کوددهی:\n" +
                        "ماهی یک بار تغذیه با کود کامل برای این گیاه کافی می باشد.\n" +
                        "تعویض گلدان پاچیرا :\n" +
                        "بهترین زمان برای تعویض خاک پاچیرا و گلدان پاچیرا به یک سایز بزرگتر در زمانی است که گیاه کمی به خواب رفته باشد . یعنی از اواخر پاییز تا اواخر زمستان . در این موقع سال چون پاچیرا رشد قابل توجهی ندارد و به حالت سکون در امده است براحتی میتوان اقدام به تعویض خاک اطراف ریشه و گلدان آن نمود .\n" +
                        "تکثیر از طریق بذر:\n" +
                        " ۲۴ تا ۴۸ ساعت بذر را در آب ولرم قرار دهید سپس در خاکی نرم و مرطوب به عمق ۱ سانت بکارید و روی لبه گلدان را به وسیله پلاستیکی شفاف کاور کنید گلدان را در اتاقی روشن با دمای ۲۴ درجه قرار دهید و منتظر سبز شدن باشید بعد از سبز شدن کاور را بردارید و گلدان به کنار پنجره شمالی انتقال دهید.\n" +
                        "تکثیر از طریق قلمه:\n" +
                        " ساقه های جدید را در آخر پاییز جدا کنید طوری که حداقل ۲ گره داشته باشند و در پرلیت یا پیت ماس فرو کنید بعد از ریشه دهی آن را به گلدان شماره ۶ حاوی خاکی سبک و پر انرژی انتقال دهید.\n"));
        arrayList.add(new Item(R.drawable.potos,
                "پوتوس",
                "تابستان5-4 روز 1 بار ",
                "کم و مقاوم به سایه ",
                "22 درجه سانتیگراد",
                "خاک مناسب: خاک باغچه، ماسه و خاک برگ\n" +
                        "کوددهی: 3 گرم در لیتر کود محلول در آب و یا کود مایع هر 2 هفته 1 بار از فروردین تا آبان ماه\n" +
                        "پتوس گیاهی برگ زینتی و آپارتمانی است. برگ ها قلبی شکل اند. بسیاری ازگونه ها حالت بالارونده دارند و تا سقف بالا می روند.\n" +
                        "\n" +
                        "دو نوع دارد: پتوسبرگ معمولی و پتوس برگ ابلق.\n" +
                        "با اینکه هر دو مقاوم به سایه هستند، ولی نوع ابلق آن، نیاز به نور کمی بیشتر برای تشکیل رنگیزه دارد. در صورتی که نور کافی دریافت نکند، برگ ها به سبزی گرایش پیدا می کنند.\n" +
                        "\n" +
                        "پتوس ها، درمنازل به راحتی قابل نگهداری هستند. نیاز به نور مستقیم خورشید ندارند، ودر صورت دریافت نور مستقیم، آفتاب سوختگی بصورت تاول و سوختگی روی برگ هانمود پیدا می کند.\n" +
                        "مقاوم به رطوبت کم محیط است و در صورتیکه رطوبت بسیاربالا باشد، برگ ها خیلی پهن و درشت می شوند. با اینکه به راحتی روی دیوارقابل هدایت است، اما ممکن است در قسمت های بالایی و نزدیک به سقف، در اثرتجمع گرما دچار سوختگی شود و در نتیجه گیاه بد شکل می شود.\n" +
                        "چون برگ زینتی است به آبیاری و مواد غذایی گیاه باید توجه شود. دورآبیاری ۲_۱ بار در هفته و هر ماه ۱ بار استفاده از کود مایع مناسبِ این گیاه است.\n" +
                        "\n" +
                        "در حالی که پوتوس یک گیاه آپارتمانی با نیاز های مراقبتی کم و پرورشِ آسان است، باید مراقب باشید! زیرا این گیاه سمی است! البته این گیاه کشنده نیست اما اگر خورده و هضم شود به دلیلِ وجود کلسیم اگزالات در ترکیباتش، به تحریک دستگاه گوارشی و استفراغ منجر می شود. این گیاه همچنین برای سگ ها، گربه ها و کودکان کم سن سمی است؛ البته همانطور که گفته شد کشنده نیست ولی آن ها را بسیار مریض و بد حال می کند.\n" +
                        "عوارض و درمان:\n" +
                        "در صورتی که مشاهده کردید برگهای گیاه زیبای آن می ریزند و ساقه ها خم میشوند، احتمال بدهید گیاه تشنهو هوا خشک است، گیاه را فراوان آبیاری کرده و به محل خنک تری منتقل کنید. نور کم و یا کمبود مواد غذایی میتواند باعث درازای ساقه ها و فاصله زیاد بین برگها شود.\n" +
                        "نقاط قهوه ای و سیاه در مرکز یا نوک برگ معرف آسیب اشعه مستقیم آفتاب است. اگر هم در سطح زیرین برگها لکه ی برجسته قهوه ای وجود داشت، هفته ای یکبار با سم حشره کش نفوذی گیاه را سمپاشی کنید تا علایم بر طرف گردد.\n" +
                        "در صورتی که از رشد فعال و ظهور برگهای جدید خبری نباشد می توان حدس زد، محیط گیاه خیلی سرد است.\n" +
                        "اگر آن رابه جای گرمتری ببرید مشکل بر طرف میشود. هوای سرد همچنین می تواند برگها را چین و چروکدار و قهوه ای کند. در اثر خاک باتلاقی و یا آبیاری با آب خیلی سرد، برگهای پایینی گیاه میریزند و زرد می شوند.\n"));
        arrayList.add(new Item(R.drawable.kaochoo,
                "کائوچو",
                "آبیاری (شیوه غبارپاشی)",
                "نور متعادل",
                "80-70 درجه فارنهايت",
                "کائوچو یا لاستیک جزو مواد بسیار ضروری در زندگی مدرن امروزی است کائوچو به دلیل خواص کشسانی فوق العاده اش برای ساخت انواع محصولات اعم از لوازم بیمارستانی، وسایل خانگی و اسباب بازی مورد استفاده قرار می گیرد.\n" +
                        "\n" +
                        "این ماده در صنعت نیز کاربردهای فراوانی دارد.کائوچو از زمانی که گیاهان بر روی زمین به وجود آمدند وجود داشته است. برخی از فسیل های گیاهان تولیدکننده کائوچو، سه میلیون  سال قدمت دارند.\n" +
                        "\n" +
                        "کائوچو از گیاهان خاصی گرفته می شود. در واقع بیش از 400 نوع گیاه وجود دارد که از شیرابه آنها مقادیر مختلفی کائوچو به دست می آید. قسمت اعظم کائوچوی طبیعی جهان را درخت «هوا برازیلینسیس» تولید می کند. این درخت که طول آن به بیش از 35 متر می رسد، بومی کشور برزیل است. در حال حاضر، بزرگترین منابع کائوچوی طبیعی جهان در «مالایا» واقع در جنوب شرقی  آسیا قرار دارد.\n" +
                        "\n" +
                        "برای تهیه کائوچو ابتدا شکافی در تنه درخت به وجود می آورند و سپس شیرابه سفید رنگی را که از شکاف خارج می شود، جمع آوری می کنند. این شیرابه را پس از آنکه سفت و خشک شد، به صورت ورقه در می آورند.. به این ترتیب ورقه های کائوچوی خام برای صدور به سایر کشورها آماده می شوند. جالب است بدانید که کائوچوی خام، ماده ای سست و چسبناک است و خاصیت کشسانی زیادی ندارد. استحکام و کشسانی کائوچو را با افزودن گوگرد افزایش می دهند. به این کار «ولکانیزه» می گویند.\n" +
                        " بعد از عمل ولکانیزه، مواد پرکننده (معمولاً دوده کربن) به کائوچو افزوده می شود تاکشسانی و قدرت آن باز هم افزایش یابد. پس از طی این مراحل،کائوچوی خام به ماده ای با خاصیت کشسانی زیاد تبدیل می شود و مورد استفاده قرار می گیرد. البته تولیدکائوچو با این روش بسیار گران و پرهزینه است.\n"));

        arrayList.add(new Item(R.drawable.bbb,
                "برگ بو",
                "به مقدار لازم",
                "آفتاب کامل ",
                "۵ درجه",
                "گیاه برگ بو به راحتی در دمای -۵ درجه نیز دوام خواهد آورد، اما آن دسته گیاهانی که در گلدان رشد می کنند، دارای ریشه های حساس به دما هستند، بنابراین برای جلوگیری از یخ زدگی ریشه ها حتما به دور گلدان لایه های محافظتی بپیچید. این گیاه برای رشد به آفتاب کامل و یا نیمه آفتاب نیاز دارد و مکان های دارای سایه برای رشد آن مناسب نمی باشند. به همین دلیل گلدان برگ بوی خود را در قسمتی قرار دهید که در روز آفتاب مستقیم و در بعدازظهر سایه بگیرد.\n" +
                        "\n" +
                        "خاک مناسب برگ بو\n" +
                        "خاک مناسب این گیاه همان خاک معمولی بوده که می توانید خاک برگ و یا کود پوسیده دامی به نسبت ۵۰ درصد کمتر از حجم کل خاک با آن همراه کنید. برای آن دسته برگ بوهایی که در گلدان رشد می کنند نیز بهتر است گلدانی با حداقل ۳۰ سانتی متر عمق و قطری برابر با ۲۰ تا ۹۰ سانتی متر بسته به اندازه گیاه انتخاب کنید. برای خاک گلدانی نیز از مخلوط یک قسمت خاک معمولی+یک قسمت خاک برگ+یک قسمت شن بهره گرفته، و برای زهکشی مناسب حتما وسیله ای بلند همچون آجر زیر گلدان قرار دهید تا آب اضافه باعث پوسیدگی ریشه نشود. یادتان باشد تعویض گلدان باید اوایل بهار انجام شده و بهتر است این کار هر دو سال یکبار صورت بگیرد. این گیاه مخصوصا اگر از نوع گلدانی باشد نیاز به کودهای کامل همچون  فرمول های -۱۰-۱۰ هر ۵-۴ هفته یک مرتبه دارد.\n" +
                        "\n" +
                        "آفات و مشکلات گیاه برگ بو\n" +
                        "اگر به تغذیه مناسب گیاه برگ بود رسیدگی شود این گیاه در مقابل آفات مقاوم خواهد بود، اما در غیر اینصورت شاهد آفاتی همچون شته ها، کنه های تار عنکبوتی و شپشکهای گیاهی خواهید بود. زرد شدن برگ های گیاه به دلایل پیری برگ و یا کمبود عناصر غذایی و یا آسیب های ناشی از دمای هوا و سرد شدن بیش از اندازه و یا کمبود بیش از اندازه آب باشد. ممکن است شاهد پوسته شدن و ریختن پوست تنه گیاه پس از زمستان های سرد باشید، در این حالت می توان گفت مشکل حاد نبوده و باید ساقه های خشکیده را از زیر ناحیه ای که پوسته شده ببرید.\n" +
                        "\n"));
        arrayList.add(new Item(R.drawable.polchini,"پول چینی",
                "فقط هفته ای یک بار ",
                "نور غیر مستقیم ",
                "کم",
                "گیاه پول چینی از جمله گیاهان آپارتمانی است که امروزه محبوبیت و شهرت بسیاری یافته است. از آنجایی که شرایط نگهداری و  مراقبت از این گیاه در طول عمر آن تاثیر بسزایی دارد؛ بر آن شدیم تا در این مقاله درباره نحوه کاشت گیاه پول چینی، ویژگی های آن و همچنین چگونگی مراقبت از آن بیشتر برای شما توضیح دهیم.\n" +
                        "\n" +
                        "گیاه پول چینی از جمله گیاهان بومی سرزمین چین است که با گذر زمان و به دلایل گوناگون به کشور ما نیز راه پیدا کرده است. امروزه این گل به دلیل زیبایی و ویژگی های بی نظیری که دارد محبوبیت بسیاری در میان ایرانیان پیدا کرده است. نام گل پول چینی تطابق زیادی به ظاهر آن دارد؛ چرا که برگ های این گیاه کاملا شبیه به سکه های پول در کشور چین هستند. اغلب این گیاه را با نام دیگری تحت عنوان گیاه پپرومیا پیله آ نیز می شناسند. این گیاه را از جمله گیاهان نادر و کمیاب می دانند که معمولا به راحتی پیدا نمی شود.\n" +
                        "\n" +
                        "تفاوت گیاه پول چینی با درخت پول چیست؟\n" +
                        "\n" +
                        "لازم است بدانید گیاه پول چینی هر چند با درخت پول چینی شباهت اسمی زیادی دارد؛ اما نباید این دو را یکی دانست. گیاه پول چینی با گیاه پاچیرا یا همان درخت پول چینی تفاوت های ظاهری و بیولوژیکی فراوانی دارند. به طور مثال از نظر ظاهری پاچیرا دارای برگ های سبز تیره، دراز و کشیده می باشد و ساقه اش بلند، صاف و مرتجع است. اما گیاه پول چینی برگ های گرد و پهن دارد. از نظر بیولوژیکی نیز لازم است بدانید گیاه پول چینی سایه دوست است و فقط هفته ای یک بار به آب نیاز دارد.\n" +
                        "\n" +
                        "گیاه پول چینی برای چه مکان هایی مناسب است؟\n" +
                        "\n" +
                        "با توجه به ویژگی های که گیاه پول چینی دارد، این گیاه در زمره گیاهان آپارتمانی قرار گرفته است. یکی از دلایلی که می توان برای نگهداری این گیاه در محیط های آپارتمانی دانست، آبیاری کم آن می باشد. از طرفی دیگر نیاز نداشتن به نور مستقیم آفتاب دلیل عمده دیگری است که می تواند این گیاه را در زمره گیاهان آپارتمانی کم دردسر قرار دهد. لذا می توان آن را برای زیباتر کردن خانه ها مسکونی، محیط های اداری، مکان های تجاری یا حتی راهروهای موجود در این فضاها و دیگر محیط های آپارتمانی با شرایط مساعد، مناسب دانست.\n"));
        arrayList.add(new Item(R.drawable.nakhlasbi,
                "نخل دم اسبی",
                "سه هفته یک بار ",
                "نور مستقیم خورشید ",
                "12 تا 21 ",
                "پرورش و نگهداری گیاه لیندا\n" +
                        "\n"+
                        "   این گیاه به نخل دم اسبی و لیندا مشهور است . بومی جنوب غرب آمریکا و مکزیک است و به زندگی بیابانی عادت دارد. برگ های آن باریک و کشیده و ضخیم و مقاوم ، مجنون و آویزان و فنری است. این برگ ها سطح مقطع کمی دارند تا مانع از هدر رفتن آب گیاه شوند. حالت زیبای آن ناشی از سرازیر شدن برگ ها به طرف پایین بخصوص در سنین بالاست. انتهای ساقه ضخیم می شود و شکل عجیبی به خود می گیرد و نام انگلیسی آن به معنی پای فیل به همین علت است. پایه بسیار بزرگ و ورم کرده گیاه، آب را در خود ذخیره می نماید.\n" +
                        "ارتفاع لیندا ممکن است به دو متر هم برسد. با بالا رفتن سن گیاه از ساقه آن جوانه هایی می روید که به خاطر حفظ شکل و فرم آن باید فوراً حذف گردند. نگهداری از آن برای باغبان های آماتور نیز ساده است. زادگاه آن مکزیک است، برگها باریک و کشیده و ضخیم و مقاوم، مجنون و آویزان و فنری، حالت زیبای آن ناشی از سرازیر دشن برگها به طرف پایین بخصوص در سنین بالا، انتهای ساقه ضخیم و شکل عجیبی به خود می گیرد و نام انگلیسی آن به معنی پای فیل به همین علت است، در زبان عامه به لیندا معروف ات، به خاطرنوع خاص برگها و ساقه آن به عنوان گیاه گلدانی منفرد نگهداری می گردد، با بالا رفتن سن گیاه از ساقه آن جوانه هایی می ریود که به خاطر حفظ شکل و فرم آن باید فوراً حذف گردند. این جنس دارای24 گونه از درختچه ها و درختهای همیشه سبز میباشد.برگهای لیندا مجنون ، آویزان ، باریک ، کشیده ، ضخیم و مقاوم که طولشان تا 1.8 متررسیده و عرضشان کمتر از 2.5 سانتیمتر می باشد. رنگ برگها سبز تا سبز مایل به تیره و حالت زیبای لیندا ناشی از خمش برگها به طرف پایین بخصوص در سنین بالاست.رنگ گلهای آن سفید مایل به کرم است و به ندرت و فقط بر روی گیاهان مسن بخصوص در تابستان ظاهر میشود.\n" +
                        "\n" +
                        "نیازها\n" +
                        "تکثیر :کاشت بذر در خاک پیت در هوای گرم،ریشه دار نمودن جوانه های ظاهر شده روی ساقه\n" +
                        "نور:در جایی از آپارتمان به خوبی رشد می کند که نور مستقیم خورشید به جز ماههای تیر و مرداد روزانه چهار ساعت یا بیشتر در آنجا بتابد. در شرایطی که پرورش آن با نور مصنوعی فراهم شود نباید از حداقل هشتصد شمع و مدت تابش آن از 12 ساعت در روز کمتر باشد. \n" +
                        "رطوبت :در تمام طول سال هفته ای یکبار غبارپاشی کافی است،در مواقعی که درجه حرارت زیر 10 درجه است غبارپاشی نکنید.\n" +
                        "درجه حرارت:درجه حرارت ایده آل بین 18 تا 25 درجه سانتیگراد است. البته درجه حرارت های متغیر بین 5 تا 30 درجه را نیز به خوبی تحمل می کند.\n" +
                        "فصل تعویض گلدان:در صورت نیاز باید قبل از آغاز فعالیت مجدد گیاه در اوایل بهار در محیطی سربسته و بدون کوران انجام گیرد.\n" +
                        "دما :حرارت بالا را دوست دارد اما با حرارت متوسط نیز سازگار است . در دامنه دمایی 12 تا 21 درجه رشد کرده و به سرما حساس است . دمای لازم برای زمستان گذرانی حداقل در حدود 10 درجه سانتیگراد است .\n" +
                        "آبیاری :به دلیل خصوصیات گیاه لیندا برای زیست در شرایط طبیعی خودش ،گیاه لیندا قادر است تا یک سال آب را در ساقه خود ذخیره کند. بهتر است رطوبت خاک پایین باشد و خاک در بین دو آبیاری کاملا خشک شود . در طول فصل رشد بهتر است گیاه هر سه هفته یک بار آبیاری شود و در طول زمستان به نظر میرسد که بار آبیاری برای گیاه کافی است یعنی به اندازه ای که مانع از پژمردگی برگهای گیاه شود . آبیاری بیش از حد به گیاه لیندا متداولترین علت آسیب و نابودی گیاه است .\n" +
                        "اگر روی برگ های لیندا آب ریخته شد سریع برگ ها را خشک کنید و اگر برگ ها را خشک نکردید و بیشترشان پژمرده شد، سعی کنید برگ های پژمرده را از بدنه اش جدا کنید و تا بیرون آمدن جوانه های جدید صبر کنید تا گیاه تان به وضع عادی برگردد در غیر این صورت گیاه تان را از دست داده اید.\n" +
                        "لکه های قرمز را جدی بگیرید\n" +
                        "شاید مهم ترین آفتی که لیندا را تهدید می کند، کنه قرمز باشد. اگر روی برگ های لیندا لکه های قرمز دیدید، با دستمالی این لکه ها را از روی ساقه ها بردارید. اگر سریع متوجه شوید کنه های قرمز دیگر نمی توانند پیشروی کنند.\n" +
                        "\n" +
                        "عوارض و درمان\n" +
                        "برگهای جدید ظاهر نمیشوند و گیاه پژمرده و خسته است:یا نور کافی نیست که گلدان را به محل روشن تری منتقل کنید و یا اینکه تغذیه مصنوعی به تاخیر افتاده است،گیاه را طبق دستور تغذیه کنید.\n" +
                        "برگهای سطوح خارجی زرد شده و یکی پس از دیگری می افتند:ابیاری بیش از اندازه انجام شده است،اجازه دهید سطح خاک گلدان در فاصله بین دو ابیاری خشک شود،زهکش را بازدید کنید،زیر گلدانی فاقد اب باشد\n" +
                        "ساقه منقبض و چروک است:گیاه تشنه است،گلدان را درون تشت پر از اب قرار دهید،ابیاری را تنظیم کنید.\n" +
                        "برگها خشک شده و میریزند:هوا خیلی گرم است،گیاه را به محل خنک تری منتقل کنید،غبارپاشی را فراموش نکنید.\n" +
                        "لکه های سوخته روی برگها مشاهده میشود:عامل ان غبارپاشی در افتاب است،در سایه غبارپاشی کنید\n" +
                        "لکه های قهوه ای در سطح زیرین برگها مشاهده میشود:عامل ان افت است،هر ماه یکبار با سم حشره کش نفوذی طبق دستور سمپاشی کنید تا علائم از بین بروند،لکه ها را میتوانید با پنبه اغشته به محلول سم نیز مسموم کنید.\n" +
                        "زخم های سفید رنگ پنبه ای در هر دو طرف برگ مشاهده میشود:حمله افت باعث ان است،با سم حشره کش نفوذی هر 2 هفته یکبار سمپاشی و یا اینکه با پنبه خیس اغشته به محلول سم لکه ها را مسموم کنید.\n" +
                        "برگها سقوط میکنند:هوا خیلی سرد است،گیاه را به محل گرمتری منتقل کنی.\n" +
                        "برگهای مجنون و اویزان دم اسبی لیندا در صورتی زیبا تر است که گلدان ان در بلندی و یا روی چهارپایه ای قرار گیرد،قاعده ضخیم و گوشتی ساقه زمانی کاملا نمایان است که گیاه به صورت سطحی در گلدان کاشت شود.\n"));
        arrayList.add(new Item(R.drawable.sine,
                "گلِ سینه",
                "رطوبت دائمی ",
                "۳۰ تا ۵۰%  ",
                "۱۰ درجۀ ",
                "این گونه از ارکیده که به گلِ سینه نیز معروف است، به خاطر مراقبت آسان، گزینۀ مناسبی برای نگهداری در آپارتمان می باشد.کاتالیا مانند سایر ارکیده های کشت شده، گیاهی هوازی است، به همین دلیل دارای اندام هایی به نام پیاز کاذب برای ذخیره آب می باشد و ریشه هایی بزرگ و گوشتی، پوشیده از لایه اسفنجی و ویلامن نگهدارندۀ آب، دارد. ریشه های این گل معمولاً در فاصله میان هر آب دهی، خشک هستند و باید در محیطی پر منفذ و با زهکشی مناسب کشت شوند.\n" +
                        "\n" +
                        "دارای اندام هایی به نام پیاز کاذب برای ذخیره آب می باشد و ریشه هایی بزرگ و گوشتی، پوشیده از لایه اسفنجی و ولایه نگهدارندۀ آب، دارد. ریشه های این گل معمولاً در فاصله میان هر آب دهی، خشک هستند و باید در محیطی پر منفذ و با زهکشی مناسب کشت شوند . گیاهان این خانواده تک لپه ٬علفی ٬ پایا و گرمسیری هستند. ارکیده ها دارای دو نوع رشد : ساقه ایستاده و ساقه خزنده هستند. گل آذین به صورت خوشه یا سنبله و گلها نامنظم است. هر گل شامل سه گلبرگ و سه کاسبرگ است. برگها دارای شبکه رگیرگی موازی می باشند. و برگها از شکل های مختلف کشیده ، گرد یا بیضی برخوردارند. برگها در بعضی جنس ها ضخیم و چرمی شکل و در برخی نازک هستند.\n" +
                        "\n" +
                        "نور مناسب کاتالیا :\n" +
                        "\n" +
                        "یکی از عوامل مهم کشت و گل دهی کاتالیا چه در خانه و چه در گلخانه، نور است. گیاهان باید در معرض نور درخشان خورشید قرار گیرند، اما منظور ما نور مستقیم ظهر نیست. بدین معنی که در خانه؛ کنار پنجره شرقی، غربی یا جنوبیِ که دارای سایه بان (مانند پرده) باشد و در گل خانه، ۳۰ تا ۵۰ % نور کامل خورشید کافی می باشد. برگ ها باید به رنگ سبز متوسط باشند.\n" +
                        "رطوبت مورد نیاز کاتالیا :\n" +
                        "\n" +
                        "کاتالیا به رطوبت نسبی بین ۵۰ تا ۸۰ درصد نیاز دارد. در خانه هم می توانید این شرایط را فراهم کنید: گیاه را در سینی شن که آن را با آب پر کرده اید، قرار دهید به گونه ای که گیاه بالا تر از آب باشد. اسپری کردن گل در صبح، فقط مناسب مناطق با آب و هوای خشک است. هوا همیشه باید در اطراف گل جریان داشته باشد (به خصوص در مناطق دارای رطوبت زیاد و سرد)، تا از ایجاد قارچ و بیماری های باکتریایی جلوگیری کند. در گلخانه نیز می توان با خیس کردن کف گلخانه رطوبت ایجاد کرد. سرد سازی با تبخیر، هوا را خنک و رطوبت را افزایش می دهد.\n" +
                        " \n" +
                        "آبیاری کاتیا :\n" +
                        "\n" +
                        "آب دهی باید به دو شیوه انجام شود: آب ریختن در گلدان یا ایجاد رطوبت در هوا. آب دهی در گلدان مشروط به رعایت ضوابط خاصی است: اندازه و نوع گلدان، دما، نور و غیره. خاک گل های بالغ کاتالیا باید قبل از آب دهی مجدد، کاملاً خشک باشد. نهال ها به رطوبت دائمی بیشتری نیاز دارند. گلدانی را که در آن گل کاشته اید، وزن کنید و گلدان خالی هم اندازۀ آن را هم وزن کرده و وزن آن ها را مقایسه نمائید تا ببینید آیا گیاه شما نیاز به آب دارد یا خیر. مداد تیزی را در خاک فرو کنید، اگر به راحتی داخل آن رفت، می تواند نشانۀ مرطوب بودن خاک باشد. اگر مطمئن نیستید، بهترین کار این است که یک یا دو روز تا زمان آب دهی صبر کنید. گیاهانی که دارای رشد فعالی هستند، بیشتر از گیاهانی که در حال استراحت هستند، نیاز به آب دارند. آب زیر ۱۰ درجۀ سانتی گراد ممکن است به گیاه آسیب رسانده و خاک را نرم کند.\n" +
                        "تکثیر کاتالیا :\n" +
                        "\n" +
                        "این گیاه بیشتر به بوسیله تقسیم بوته افزوده می شود. در روش افزایش بوسیله بذر ۴ـ۸ سال به درازا می کشد که به گل بنشیند ٬ امروزه برای افزایش این گیاه ٬ از کاشت مریستم در سیستم های ریز افزایی استفاده فراوان می شود .ارکیده ها تعداد بسیار زیادی بذر تولید کرده که بذر آنها فاقد هر گونه آندوسپرمی می با شد از این رو در طبیعت برای سبز شدن نیاز به همکاری قارچ ها دارند.\n" +
                        " \n" +
                        "کود مورد نیاز کاتالیا :\n" +
                        "\n" +
                        "کود دهی باید به طور منظم انجام شود و می بایست از کودِ دارای نسبتِ بالای نیتروژن یا نسبت مشابه آن (از پوست صنوبر) استفاده شود. گهگاه از کودِ دارای فسفر زیاد یا تقویت کنندۀ گل دهی استفاده کنید تا جوانه هایی قوی و گل هایی سالم داشته باشید. گیاهان دارای رشد فعال، هر دو هفته یک بار به کود نیاز دارند، در غیر این صورت یک بار در ماه این کار را انجام دهید. در هر بار آب دهی می توانید کود را از یک چهارمِ محلول توصیه شده بریزید. هر ماه یک بار با فشار به گل آب بدهید تا از جمع شدن نمک های کود جلوگیری کنید.\n" +
                        "تعویض گلدان کاتالیا :\n" +
                        "\n" +
                        "گل های بالغ کاتالیا معمولا در گلدان متوسط و نهال آن در گلدان کوچک، پرورش داده می شوند. زمانی که گل دارای ۶ پیاز کاذب و بالغ شد، باید در یک گلدان بزرگ تر قرار داده شده و تقسیم نیز نشود. در صورت تقسیم گیاه هر قسمت باید دارای ۳ تا ۵ پیاز باشد. گلدانی را انتخاب کنید که ۲ تا ۳ سال برای رشد آنجا داشته باشد. مخروطی از خاک را ته گلدان قرار دهید، ریشه های فرسوده را ببرید و ریشه های محکم و شاداب را روی این مخروط پخش کنید. تقریباً تا اواسط گلدان را با خاک پر کنید و سپس اطراف ریشه ها را با خاک پر کنید، خاک را محکم فشار دهید و در صورت نیاز یک چوب در آن قرار دهید. برای مدتی گیاه را مرطوب، در سایه و با ریشۀ خشک نگه دارید تا ریشه های جدید برویند. محلول ویتامین B۱ می تواند به رویش ریشه های تازه کمک کند.\n"));
        arrayList.add(new Item(R.drawable.ficus,
                "گل فیکوس ",
                "متوسط ",
                "در سایه آفتاب ",
                "13 تا 29 درجه ",
                "خواص بتانیکی گل فیکوس :\n" +
                        "نوع: این گیاه، دارای گونه های مختلف از قبیل برگ پهن، برگ ریز و غیره می باشد در سایه آفتاب از رشد بهتری برخوردار است\n" +
                        "و به روشنایی نسبی نیاز دارد.\n" +
                        "ساقه: ساقه ها خشبی، نیمه خشبی و مفتولی رونده می باشند. دارای شیرابه مخصوص هستند که در نتیجه زخمی شدن ساقه از آن ها جاری می شود.\n" +
                        "برگ: برگ های فیکوس ها، همیشه سبز هستند و به اشکال درختی، درختچه و بالا رونده دیده می شوند.\n" +
                        "درجه حرارت لازم برای گل فیکوس :\n" +
                        "فیکوس ها در گرمای معتدل به خوبی رشد و نمو می کنند و دمای مطلوب آن ها بین 13 تا 29 درجه ی سانتی گراد است.\n" +
                        "نور مناسب برای رشد فیکوس :\n" +
                        "در نور متوسط تا زیاد، به خوبی رشد و نمو می کنن\n" +
                        "به طوری که این گیاهان در جنگل ها، در سایه ی درختان دیگر به خوبی رشد و نمو می کنند. در منازل هم، نور کم و حرارت متغیر اتاق ها را تحمل می نمایند. البته بهتر است برای انواع درختی، محل پر نور ساختمان و برای سایر انواع، محل سایه را انتخاب کنید.\n" +
                        "رطوبت هوا :\n" +
                        "فیکوس ها به رطوبت نسبی 25 تا 50 درصد نیاز دارند به همین دلیل بهتر است هرچند وقت یک بار،سطح برگ ها را با اسفنج مرطوب پاک نمایید تا ضمن تمیز و براق نمودن برگ ها که جلوه خاصی به زیبایی گیاه می بخشد\n" +
                        "رطوبت نسبی مورد نیاز آن ها نیز تامین گردد. در ارقام برگ ریز نیز می توانید با اسپری کردن آب بر روی برگ ها، مخصوصا در فصول گرم سال، نیاز رطوبتی آن ها را تامین کنید.\n" +
                        "آبیاری گل فیکوس :\n" +
                        "نیاز آبی فیکوس متوسط است به طوری که در فاصله ی بین دو آبیاری باید سطح خاک گلدان خشک گردد.\n" +
                        "ضمنا نسبت به زیادی و سردی آب حساس است و رعایت نکردن این نکته، باعث ریزش برگ ها می شود.\n" +
                        "توجه: در آبیاری فیکوس ها هرگز آن ها را غرقاب نکنید.\n" +
                        "\n" +
                        "خاک مناسب برای فیکوس :\n" +
                        "-فیکوس ها در خاک غنی از مواد آلی و کود پوسیده ی دامی سریعا رشد و نمو می کنند.\n" +
                        "-برای تهیه خاک مناسب باید ترکیب خاک شامل یک سوم خاک باغچه + یک سوم خاک برگ پوسیده + یک سوم کود پوسیده دامی می باشد.\n" +
                        "-هر دو سال یک مرتبه ، در فصل بهار ، خاک گلدان را عوض نمایید. پس از این که گیاه تنومند شد نیازی به تعویض گلدان نخواهد داشت فقط هرچند ماه یک مرتبه خاک سطحی گلدان را سیخک زده، با کود شیمیایی کامل آن را تقویت کنید.\n" +
                        "کود مناسب برای فیکوس \n" +
                        "-خاک گلدان فیکوس باید از نظر مواد آلی و معدنی غنی باشد.\n" +
                        "-کوددهی به صورت محلول پاشی از طریق به کار بردن یک کود کامل و کود های میکرو فقط در زمان رشد و نمو فیکوس ها توصیه می شود.\n" +
                        "-در صورتی که به دلیل درجه حرارت محیط یا هر عامل دیگر، رشد فیکوس ها متوقف شودکودپاشی خصوصا با غلظت زیاد باعث سوختگی برگ های جدید می گردد.\n"));
        arrayList.add(new Item(R.drawable.filonderond,
                "فیلودندرون",
                "وسط آبیاری بایدخشک بشه ",
                "نور ملایم ",
                "۱۲ درجه ",
                "فیلودندرون جز اون دسته ای گلهاییه که من حتما برای خونم خودم میخرم ،مخصوصا اتاق پذیرایی، با اون برگها مینیاتوری و زیباش جلوه ی خاصی به اتاق میده ، نگهداریشمکه راحته و درکل یه گلیه که کسی هرجایی نمیبینه ! برخلاف بقیه هم خونواده هاش نیازی به قیم نداره ، گیاهی است از خانواده آراسه و زادگاه ان امریکای جنوبی است،برگها سبز براق است که با بزرگتر شدن شکافها و دندانه های برگ عمیق تر و شکل برگ انجیر به خود میگیرد.ریشه های هوایی ان منحصر به ریشه های نزدیکی قاعده ی برگهاست که باید به طرف خاک گلدان هدایت گردد.همانطوری که از نام انگلیسی ان بر می اید و فیلودندرون را راست قامت نهاده اند احتیاج به قیم ندارد و برگها از مرکز می رویند،هوای گرم و مرطوب از شرایط ایده ال ان است و بعلت گستردیگی بوته و برگها باید دور از محل پر رفت و امد باشد،نگهداری فیلودندرون ها ساده و گیاهی مناسب برای مبتدیان است.\n" +
                        "\n" +
                        "نیازها: \n" +
                        "نور: کنار پنجره با نور ملایم بهترین مکان برای این گیاه است،اشعه ی مستقیم آفتاب مخصوصا در ظهر به برگهای گیاه صدمه می زند\n" +
                        "دما: حداقل درجه حرارت در زمستان ۱۲ درجه و حداکثر ان در تابستان ۲۴ درجه توصیه می گردد.در درجه حرارت بالاتر غبارپاشی الزامی است.\n" +
                        "آبیاری: بین دو آبیاری باید خاکش خشک بشه !\n" +
                        "رطوبت: یک جزیره زیرش درست کنید تا همیشه بخار آب دور برگاشو بگیره و رطوبت پایدار داشته باشید توی زمستون هم ظرف اب روی شوفاژ یا بخاری قرار بدید\n" +
                        "تغذیه :هر دو هفته یکبار جهت تامین مواد غذایی گیاه از کود شیمیایی گرین ایتالیا در لینک زیر مطلب  مخصوص گیاهان زینتی استفاده کنید.\n" +
                        "خاک مناسب :خاک  کمپوست یا خاک هلندی بهترین محیط برای رشد ریشه است.\n" +
                        "تعویض گلدان: با شروع فصل رشد در هر سال زمان تعویض گلدان فرا میرسد.در صورت سنگین بودن گلدان به تعویض خاکهای سطحی با خاک نو و غنی اکتفا کنید.بهتراست اجازه دهید ریشه از زیر گلدان بیرون بزند بعد تعویض کنید.\n" +
                        "تکثیر: ازدیاد این گل در منزل کار اسانی نیست،حرفه ای ها از بذر و قلمه استفاده میکنند\n" +
                        "عوارض و درمان:\n" +
                        "برگها میریزند:هوا خیلی گرم و خشک است،آبیاری را بیشتر کنید،گلدان را به محل خنک تر منتقل کنید.\n" +
                        "برگها زرد میشوند و میریزند:ابیاری زیاده از حد است،سوراخ ته گلدان را بازدید کنید،در صورت باتلاقی شدن گلدان با یک میله آهنی به ملایمت خاک و ریگ انتهای گلدان را بحرکت دراورید.در زمستان فاصله ابیاری را کمتر کنید.\n" +
                        "برگ های جدید یا ظاهر نمیشوند یا خیلی کوچک هستند:به گلدان بزرگتر احتیاج دارد،در صورت عدم امکان تعویض تغذیه مصنوعی توصیه می شود.\n" +
                        "\n" +
                        "ساقه ها دراز و ضعیف هستند:نور کم است،گلدان را به محل روشن تر با اشعه ی غیرمتسقیم افتاب منتقل دهید.\n" +
                        "سبزینه ها در برگ ها کم شده اند و سطح زیرین انها مملو از تار عنکبوت است:حمله کنه قرمز میکروسکوپی باعث این عارضه است،با سم کنه کش طبق دستور هر دو هفته یکبار سمپاشی کنید.\n" +
                        "لکه های سوخته روی برگها مشاهده میشود:اشعه ی مستقیم افتاب یا غبارپاشی در افتاب باعث ان است،گلدان را به نیم سایه منتقل کنید،و از غبارپاشی در افتاب بپرهیزید.\n" +
                        "برگها رنگ پریده و کم رشد شده اند:هوا سرد است،گلدان را به محل گرمتری انتقال دهید\n" +
                        "تمیز نمودن برگها:با دست چپ برگها را نگهداشته و با دست راست و با اسفنج  و یا پا پارچه ی مرطوب برگها را تمیز نمایید.در صورت لزوم فقط هر ماه یکبار  از مواد براق کننده ی شیمیایی استفاده کنید.\n" +
                        "فروشندگان گل و گیاه برای جلب نظر مشتری برگ ها را با مواد براق کننده تمیز میکنند،روزنه های موجود در سطح برگها که برای اعمال حیاتی گیاه باید باز باشند،با اینگونه مواد مسدود میشود،غبارپاشی برای تمیز کردن برگها کافی است.\n"));

        return arrayList;
    }
}
